[
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/36212848-the-other-woman", "image": ["https://images.gr-assets.com/books/1525957746l/36212848.jpg"], "avg_ratings": ["\n  3.82\n"], "num_reviews": ["\n  ", "\n  18,448\n  ratings\n"], "genres": ["Thriller", "Fiction", "Suspense", "Mystery", "Audiobook"], "title": "The Other Woman", "author": "Sandie Jones", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "125019198X", "description": ["Emily thinks Adam’s perfect; the man she thought she’d never meet. But lurking in the shadows is a rival; a woman who shares a deep bond with the man she loves.", "Emily chose Adam, but she didn’t choose his mother Pammie. There’s nothing a mother wouldn’t do for her son, and now Emily is about to find out just how far Pammie will go to get what she wants: Emily gone forever.", " is an addictive, fast-paced psychological thriller about the destructive relationship between Emily, her boyfriend Adam, and his manipulative mother Pammie."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/35224895-wish-i-were-here", "image": ["https://images.gr-assets.com/books/1495800550l/35224895.jpg"], "avg_ratings": ["\n  3.42\n"], "num_reviews": ["\n  ", "\n  19\n  ratings\n"], "genres": ["Fiction", "Contemporary"], "title": "Wish I Were Here", "author": "Erin Lavan", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Savannah Waters never expected to ride through the Alps on the back of her rugged doctor’s Harley in pursuit of her stolen nude self-portrait, when her world was turned upside down.", "After sinking to rock bottom following her ex-boyfriend’s drug overdose, Savannah is dragged to jail, a nauseating intervention, and AA meetings. Finally, she is introduced to an intriguing psychiatrist who sees her as more than a patient. ", "A trip to Europe with the gorgeous Jake would be a dream come true – were it not for the wacky gang of wealthy weirdos they’re traveling with. Europe is invigorating, the food and wine delectable and the company stimulating to say the least – but how can Savannah get closer to her dream Doc while they’re surrounded by so many people who need his curative touch?", "To top it all, her deeply personal (and very nude) artwork lies in wait on Isle de Brêhat, tantalizingly close to the end of her European odyssey…", "From the feisty pen of debut author Erin Lavan, WISH I WERE HERE is an irresistible modern-day romance that will put a smile on your face and leave you hungry for a taste of adventure."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/34037113-the-rules-of-magic", "image": ["https://images.gr-assets.com/books/1492802012l/34037113.jpg"], "avg_ratings": ["\n  3.98\n"], "num_reviews": ["\n  ", "\n  38,618\n  ratings\n"], "genres": ["Fiction", "Fantasy", "Magical Realism", "Historical", "Historical Fiction", "Fantasy", "Magic", "Paranormal", "Witches"], "title": "The Rules of Magic", "author": "Alice Hoffman", "num_pages": "369", "awards": ["Mythopoeic Fantasy Award Nominee for Adult Literature (2018)"], "places": ["Massachusetts", "New York City, New York", "Paris"], "character_names": ["Vincent Owens", "Franny Owens", "Jet Owens"], "language": "English", "description": ["For the Owens family, love is a curse that began in 1620, when Maria Owens was charged with witchery for loving the wrong man.", "Hundreds of years later, in New York City at the cusp of the sixties, when the whole world is about to change, Susanna Owens knows that her three children are dangerously unique. Difficult Franny, with skin as pale as milk and blood red hair, shy and beautiful Jet, who can read other people’s thoughts, and charismatic Vincent, who began looking for trouble on the day he could walk.", "From the start Susanna sets down rules for her children: No walking in the moonlight, no red shoes, no wearing black, no cats, no crows, no candles, no books about magic. And most importantly, never, ever, fall in love. But when her children visit their Aunt Isabelle, in the small Massachusetts town where the Owens family has been blamed for everything that has ever gone wrong, they uncover family secrets and begin to understand the truth of who they are. Back in New York City each begins a risky journey as they try to escape the family curse.", "The Owens children cannot escape love even if they try, just as they cannot escape the pains of the human heart. The two beautiful sisters will grow up to be the revered, and sometimes feared, aunts in ", ", while Vincent, their beloved brother, will leave an unexpected legacy."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/27824826-the-dry", "image": ["https://images.gr-assets.com/books/1456113132l/27824826.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  95,911\n  ratings\n"], "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Thriller", "Mystery Thriller", "Cultural", "Australia"], "title": "The Dry", "author": "Jane Harper", "num_pages": "352", "awards": ["Barry Award for Best First Novel (2018)", "Ned Kelly Award for Best First Fiction (2017)", "CWA Gold Dagger Award", "Goodreads Choice Award Nominee for Mystery & Thriller & for Debut Goodreads Author (2017)", "Indie Book of the Year Award (2017)", "ABIA Winner: General Fiction Book of the Year & Book of the Year (2017)"], "places": ["Australia"], "character_names": [], "language": "English", "description": []},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/39507318-the-library-book", "image": ["https://images.gr-assets.com/books/1524238338l/39507318.jpg"], "avg_ratings": ["\n  4.15\n"], "num_reviews": ["\n  ", "\n  9,633\n  ratings\n"], "genres": ["Nonfiction", "History", "Writing", "Books About Books", "Crime", "True Crime"], "title": "The Library Book", "author": "Susan Orlean", "num_pages": "318", "awards": ["Goodreads Choice Award Nominee for Nonfiction (2018)"], "places": [], "character_names": [], "language": "English", "ISBN": "1476740186", "description": ["On the morning of April 28, 1986, a fire alarm sounded in the Los Angeles Public Library. As the moments passed, the patrons and staff who had been cleared out of the building realized this was not the usual fire alarm. As one fireman recounted, “Once that first stack got going, it was ‘Goodbye, Charlie.’” The fire was disastrous: it reached 2000 degrees and burned for more than seven hours. By the time it was extinguished, it had consumed four hundred thousand books and damaged seven hundred thousand more. Investigators descended on the scene, but more than thirty years later, the mystery remains: Did someone purposefully set fire to the library—and if so, who?", "Weaving her lifelong love of books and reading into an investigation of the fire, award-winning ", "reporter and ", "bestselling author Susan Orlean delivers a mesmerizing and uniquely compelling book that manages to tell the broader story of libraries and librarians in a way that has never been done before.", "In ", ", Orlean chronicles the LAPL fire and its aftermath to showcase the larger, crucial role that libraries play in our lives; delves into the evolution of libraries across the country and around the world, from their humble beginnings as a metropolitan charitable initiative to their current status as a cornerstone of national identity; brings each department of the library to vivid life through on-the-ground reporting; studies arson and attempts to burn a copy of a book herself; reflects on her own experiences in libraries; and reexamines the case of Harry Peak, the blond-haired actor long suspected of setting fire to the LAPL more than thirty years ago.", "Along the way, Orlean introduces us to an unforgettable cast of characters from libraries past and present—from Mary Foy, who in 1880 at eighteen years old was named the head of the Los Angeles Public Library at a time when men still dominated the role, to Dr. C.J.K. Jones, a pastor, citrus farmer, and polymath known as “The Human Encyclopedia” who roamed the library dispensing information; from Charles Lummis, a wildly eccentric journalist and adventurer who was determined to make the L.A. library one of the best in the world, to the current staff, who do heroic work every day to ensure that their institution remains a vital part of the city it serves.", "Brimming with her signature wit, insight, compassion, and talent for deep research, ", "is Susan Orlean’s thrilling journey through the stacks that reveals how these beloved institutions provide much more than just books—and why they remain an essential part of the heart, mind, and soul of our country. It is also a master journalist’s reminder that, perhaps especially in the digital era, they are more necessary than ever."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/32075853-erotic-stories-for-punjabi-widows", "image": ["https://images.gr-assets.com/books/1493817315l/32075853.jpg"], "avg_ratings": ["\n  3.91\n"], "num_reviews": ["\n  ", "\n  23,921\n  ratings\n"], "genres": ["Fiction", "Contemporary", "Romance", "Audiobook"], "title": "Erotic Stories for Punjabi Widows", "author": "Balli Kaur Jaswal", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0062645129", "description": ["A lively, sexy, and thought-provoking East-meets-West story about community, friendship, and women’s lives at all ages—a spicy and alluring mix of ", " and ", "Nikki lives in cosmopolitan West London, where she tends bar at the local pub. The daughter of Indian immigrants, she’s spent most of her twenty-odd years distancing herself from the traditional Sikh community of her childhood, preferring a more independent (that is, Western) life. When her father’s death leaves the family financially strapped, Nikki, a law school dropout, impulsively takes a job teaching a \"creative writing\" course at the community center in the beating heart of London’s close-knit Punjabi community.", "Because of a miscommunication, the proper Sikh widows who show up are expecting to learn basic English literacy, not the art of short-story writing. When one of the widows finds a book of sexy stories in English and shares it with the class, Nikki realizes that beneath their white dupattas, her students have a wealth of fantasies and memories. Eager to liberate these modest women, she teaches them how to express their untold stories, unleashing creativity of the most unexpected—and exciting—kind.", "As more women are drawn to the class, Nikki warns her students to keep their work secret from the Brotherhood, a group of highly conservative young men who have appointed themselves the community’s \"moral police.\" But when the widows’ gossip offers shocking insights into the death of a young wife—a modern woman like Nikki—and some of the class erotica is shared among friends, it sparks a scandal that threatens them all."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/27170141-you-ll-grow-out-of-it", "image": ["https://images.gr-assets.com/books/1462261735l/27170141.jpg"], "avg_ratings": ["\n  3.81\n"], "num_reviews": ["\n  ", "\n  16,393\n  ratings\n"], "genres": ["Autobiography", "Memoir", "Nonfiction", "Humor", "Audiobook", "Writing", "Essays"], "title": "You'll Grow Out of It", "author": "Jessi Klein", "num_pages": "291", "awards": ["Goodreads Choice Award Nominee for Humor (2016)"], "places": [], "character_names": [], "language": "English", "ISBN": "1455531189", "description": ["INSTANT ", " AND ", " BESTSELLER! YOU'LL GROW OUT OF IT hilariously, and candidly, explores the journey of the twenty-first century woman.", "As both a tomboy and a late bloomer, comedian Jessi Klein grew up feeling more like an outsider than a participant in the rites of modern femininity.", "In YOU'LL GROW OUT OF IT, Klein offers - through an incisive collection of real-life stories - a relentlessly funny yet poignant take on a variety of topics she has experienced along her strange journey to womanhood and beyond. These include her \"transformation from Pippi Longstocking-esque tomboy to are-you-a-lesbian-or-what tom man,\" attempting to find watchable porn, and identifying the difference between being called \"ma'am\" and \"miss\" (\"Miss\" sounds like you weigh ninety-nine pounds).", "Raw, relatable, and consistently hilarious, YOU'LL GROW OUT OF IT is a one-of-a-kind book by a singular and irresistible comic voice."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/36681184-still-lives", "image": ["https://images.gr-assets.com/books/1536677752l/36681184.jpg"], "avg_ratings": ["\n  3.35\n"], "num_reviews": ["\n  ", "\n  14,563\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Adult Fiction", "Audiobook", "Contemporary", "Mystery", "Crime", "Adult", "Suspense"], "title": "Still Lives", "author": "Maria Hummel", "num_pages": "275", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1619021110", "description": ["Kim Lord is an avant-garde figure, feminist icon, and agent provocateur in the L.A. art scene. Her groundbreaking new exhibition ", " is comprised of self-portraits depicting herself as famous, murdered women—the Black Dahlia, Chandra Levy, Nicole Brown Simpson, among many others—and the works are as compelling as they are disturbing, implicating a culture that is too accustomed to violence against women.", "As the city’s richest art patrons pour into the Rocque Museum’s opening night, all the staff, including editor Maggie Richter, hope the event will be enough to save the historic institution’s flailing finances. Except Kim Lord never shows up to her own gala. Fear mounts as the hours and days drag on and Lord remains missing. Suspicion falls on the up-and-coming gallerist Greg Shaw Ferguson, who happens to be Maggie’s ex. A rogue’s gallery of eccentric art world figures could also have motive for the act, and as Maggie gets drawn into her own investigation of Lord’s disappearance, she’ll come to suspect all of those closest to her.", "Set against a culture that often fetishizes violence, ", " is a page-turning exodus into the art world’s hall of mirrors, and one woman’s journey into the belly of an industry flooded with money and secrets."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/23019289-ashley-s-war", "image": ["https://images.gr-assets.com/books/1433353074l/23019289.jpg"], "avg_ratings": ["\n  4.27\n"], "num_reviews": ["\n  ", "\n  3,533\n  ratings\n"], "genres": ["Nonfiction", "History", "War", "Military Fiction", "War", "Biography"], "title": "Ashley's War: The Untold Story of a Team of Women Soldiers on the Special Ops Battlefield", "author": "Gayle Tzemach Lemmon", "num_pages": "292", "awards": ["Goodreads Choice Award Nominee for History & Biography (2015)"], "places": [], "character_names": [], "language": "English", "ISBN": "006233381X", "description": ["From the author of the New York Times bestseller The Dressmaker of Khair Khana comes the poignant and gripping story of a groundbreaking team of female American warriors who served alongside Special Operations soldiers on the battlefield in Afghanistan­—including Ashley White, a beloved soldier who died serving her country’s cause.", "In 2010, the U.S. Army Special Operations Command created Cultural Support Teams, a pilot program to put women on the battlefield alongside Green Berets and Army Rangers on sensitive missions in Afghanistan. The idea was that women could access places and people that had remained out of reach, and could build relationships—woman to woman—in ways that male soldiers in a conservative, traditional country could not. Though officially banned from combat, female soldiers could be “attached” to different teams, and for the first time, women throughout the Army heard the call to try out for this special ops program.", "In Ashley’s War, Gayle Tzemach Lemmon uses exhaustive firsthand reporting and a finely tuned understanding of the complexities of war to tell the story of CST-2, a unit of women hand-picked from across the Army, and the remarkable hero at its heart: 1st Lt. Ashley White, who would become the first Cultural Support Team member killed in action and the first CST remembered on the Army Special Operations Memorial Wall of Honor alongside the Army Rangers with whom she served.", "Transporting readers into this little-known world of fierce women bound together by valor, danger, and the desire to serve, Ashley’s War is a riveting combat narrative and a testament to the unbreakable bonds born of war.", "Gayle Tzemach Lemmon is a Senior Fellow at the Council on Foreign Relations and a contributor to The Atlantic’s Defense One. She is the bestselling author of The Dressmaker of Khair Khana and writes regularly for leading media outlets. A Fulbright scholar and Robert Bosch Fellow, she began reporting from conflict regions during MBA study at the Harvard Business School following nearly a decade covering politics at ABC News."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/36388243-something-in-the-water", "image": ["https://images.gr-assets.com/books/1528120440l/36388243.jpg"], "avg_ratings": ["\n  3.66\n"], "num_reviews": ["\n  ", "\n  40,741\n  ratings\n"], "genres": ["Fiction", "Thriller", "Mystery", "Audiobook", "Thriller", "Mystery Thriller"], "title": "Something in the Water", "author": "Catherine Steadman", "num_pages": "342", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller and for Debut Author (2018)"], "places": ["Bora Bora", "London, England"], "character_names": [], "language": "English", "ISBN": "1524797189", "description": ["Erin is a documentary filmmaker on the brink of a professional breakthrough, Mark a handsome investment banker with big plans. Passionately in love, they embark on a dream honeymoon to the tropical island of Bora Bora, where they enjoy the sun, the sand, and each other. Then, while scuba diving in the crystal blue sea, they find something in the water. . . .", "Suddenly the newlyweds must make a dangerous choice: to speak out or to protect their secret. After all, if no one else knows, who would be hurt? Their decision will trigger a devastating chain of events. . . .", "Wonder no longer. Catherine Steadman's enthralling voice shines throughout this spellbinding debut novel. With piercing insight and fascinating twists, ", " challenges the reader to confront the hopes we desperately cling to, the ideals we're tempted to abandon, and the perfect lies we tell ourselves."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/34043643-the-last-mrs-parrish", "image": ["https://images.gr-assets.com/books/1486501028l/34043643.jpg"], "avg_ratings": ["\n  3.88\n"], "num_reviews": ["\n  ", "\n  49,629\n  ratings\n"], "genres": ["Fiction", "Thriller", "Mystery", "Audiobook"], "title": "The Last Mrs. Parrish", "author": "Liv Constantine", "num_pages": "560", "awards": [], "places": ["Connecticut"], "character_names": [], "language": "English", "ISBN": "0062688162", "description": ["Amber Patterson is fed up. She’s tired of being a nobody: a plain, invisible woman who blends into the background. She deserves more—a life of money and power like the one blond-haired, blue-eyed goddess Daphne Parrish takes for granted.", "To everyone in the exclusive town of Bishops Harbor, Connecticut, Daphne—a socialite and philanthropist—and her real-estate mogul husband, Jackson, are a couple straight out of a fairy tale.", "Amber’s envy could eat her alive . . . if she didn't have a plan. Amber uses Daphne’s compassion and caring to insinuate herself into the family’s life—the first step in a meticulous scheme to undermine her. Before long, Amber is Daphne’s closest confidante, traveling to Europe with the Parrishes and their lovely young daughters, and growing closer to Jackson. But a skeleton from her past may undermine everything that Amber has worked towards, and if it is discovered, her well-laid plan may fall to pieces. ", "With shocking turns and dark secrets that will keep you guessing until the very end, ", " is a fresh, juicy, and utterly addictive thriller from a diabolically imaginative talent."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/17349222-this-is-the-story-of-a-happy-marriage", "image": ["https://images.gr-assets.com/books/1515365151l/17349222.jpg"], "avg_ratings": ["\n  4.01\n"], "num_reviews": ["\n  ", "\n  19,394\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Writing", "Essays", "Audiobook"], "title": "This is the Story of a Happy Marriage", "author": "Ann Patchett", "num_pages": "308", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0062236679", "description": ["Blending literature and memoir, Ann Patchett, author of ", " and ", " examines her deepest commitments — to writing, family, friends, dogs, books, and her husband — creating a resonant portrait of a life in ", " takes us into the very real world of Ann Patchett’s life. Stretching from her childhood to the present day, from a disastrous early marriage to a later happy one, it covers a multitude of topics, including relationships with family and friends, and charts the hard work and joy of writing, and the unexpected thrill of opening a bookstore.", "As she shares stories of the people, places, ideals, and art to which she has remained indelibly committed, Ann Patchett brings into focus the large experiences and small moments that have shaped her as a daughter, wife, and writer."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/26247008-truly-madly-guilty", "image": ["https://images.gr-assets.com/books/1491249206l/26247008.jpg"], "avg_ratings": ["\n  3.56\n"], "num_reviews": ["\n  ", "\n  184,021\n  ratings\n"], "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Contemporary", "Audiobook", "Mystery"], "title": "Truly Madly Guilty", "author": "Liane Moriarty", "num_pages": "415", "awards": ["Goodreads Choice Award for Fiction (2016)", "Holden-Crowther Book Award Nominee (2016)"], "places": ["Sydney, New South Wales"], "character_names": [], "language": "English", "ISBN": "1250069793", "description": ["Six responsible adults. Three cute kids. One small dog. It’s just a normal weekend. What could possibly go wrong?", "Sam and Clementine have a wonderful, albeit, busy life: they have two little girls, Sam has just started a new dream job, and Clementine, a cellist, is busy preparing for the audition of a lifetime. If there’s anything they can count on, it’s each other.", "Clementine and Erika are each other’s oldest friends. A single look between them can convey an entire conversation. But theirs is a complicated relationship, so when Erika mentions a last minute invitation to a barbecue with her neighbors, Tiffany and Vid, Clementine and Sam don’t hesitate. Having Tiffany and Vid’s larger than life personalities there will be a welcome respite.", "Two months later, it won’t stop raining, and Clementine and Sam can’t stop asking themselves the question: What if we hadn’t gone?", "In Truly Madly Guilty, Liane Moriarty takes on the foundations of our lives: marriage, sex, parenthood, and friendship. She shows how guilt can expose the fault lines in the most seemingly strong relationships, how what we don’t say can be more powerful than what we do, and how sometimes it is the most innocent of moments that can do the greatest harm."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/33155774-do-not-become-alarmed", "image": ["https://images.gr-assets.com/books/1482644401l/33155774.jpg"], "avg_ratings": ["\n  3.44\n"], "num_reviews": ["\n  ", "\n  13,172\n  ratings\n"], "genres": ["Fiction", "Thriller", "Mystery", "Thriller", "Mystery Thriller"], "title": "Do Not Become Alarmed", "author": "Maile Meloy", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0735216525", "description": ["From a beloved, award-winning writer, the much-anticipated novel about what happens when two families go on a tropical vacation - and the children go missing.", "When Liv and Nora decide to take their families on a holiday cruise, everyone is thrilled. The ship's comforts and possibilities seem infinite. The children - two eleven-year-olds, an eight-year-old, and a six-year-old—love the nonstop buffet and the independence they have at the Kids' Club. But when they all go ashore in beautiful Central America, a series of minor misfortunes leads the families farther and farther from the ship's safety. One minute the children are there, and the next they're gone. ", "What follows is a riveting, revealing story told from the perspectives of the adults and the children, as the once-happy parents - now turning on one another and blaming themselves - try to recover their children and their lives. ", "Celebrated for her ability to write vivid, spare, moving fiction, Maile Meloy shows how quickly the life we count on can fall away, and how a crisis changes everyone's priorities. The fast-paced, gripping plot of Do Not Become Alarmed carries with it an insightful, provocative examination of privilege, race, guilt, envy, the dilemmas of modern parenthood, and the challenge of living up to our own expectations."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/32075861-the-essex-serpent", "image": ["https://images.gr-assets.com/books/1482090227l/32075861.jpg"], "avg_ratings": ["\n  3.63\n"], "num_reviews": ["\n  ", "\n  31,370\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Literary Fiction"], "title": "The Essex Serpent", "author": "Sarah Perry", "num_pages": "422", "awards": ["British Book Award for Book of the Year (2017)", "Costa Book Award Nominee for Novel (2016)", "Wellcome Book Prize Nominee for Longlist (2017)", "Dylan Thomas Prize Nominee for Shortlist (2017)", "Women's Prize for Fiction Nominee for Longlist (2017)", "Walter Scott Prize Nominee for Longlist (2017)", "Waterstones Book of the Year (2016)", "Europese Literatuurprijs Nominee (2018)", "RSL Encore Award Nominee for Shortlist (2017)", "HWA Endeavour Ink Gold Crown Nominee for Shortlist (2017)"], "places": ["Essex County, England"], "character_names": [], "language": "English", "ISBN": "0062666371", "description": ["An exquisitely talented young British author makes her American debut with this rapturously acclaimed historical novel, set in late nineteenth-century England, about an intellectually minded young widow, a pious vicar, and a rumored mythical serpent that explores questions about science and religion, skepticism, and faith, independence and love.", "When Cora Seaborne’s brilliant, domineering husband dies, she steps into her new life as a widow with as much relief as sadness: her marriage was not a happy one. Wed at nineteen, this woman of exceptional intelligence and curiosity was ill-suited for the role of society wife. Seeking refuge in fresh air and open space in the wake of the funeral, Cora leaves London for a visit to coastal Essex, accompanied by her inquisitive and obsessive eleven-year old son, Francis, and the boy’s nanny, Martha, her fiercely protective friend.", "While admiring the sites, Cora learns of an intriguing rumor that has arisen further up the estuary, of a fearsome creature said to roam the marshes claiming human lives. After nearly 300 years, the mythical Essex Serpent is said to have returned, taking the life of a young man on New Year’s Eve. A keen amateur naturalist with no patience for religion or superstition, Cora is immediately enthralled, and certain that what the local people think is a magical sea beast may be a previously undiscovered species. Eager to investigate, she is introduced to local vicar William Ransome. Will, too, is suspicious of the rumors. But unlike Cora, this man of faith is convinced the rumors are caused by moral panic, a flight from true belief.", "These seeming opposites who agree on nothing soon find themselves inexorably drawn together and torn apart—an intense relationship that will change both of their lives in ways entirely unexpected."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/32895291-the-lying-game", "image": ["https://images.gr-assets.com/books/1497632504l/32895291.jpg"], "avg_ratings": ["\n  3.52\n"], "num_reviews": ["\n  ", "\n  60,364\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense"], "title": "The Lying Game", "author": "Ruth Ware", "num_pages": "370", "awards": [], "places": [], "character_names": ["Isa Wilde", "Kate Atagon", "Fatima Chaudhry"], "language": "English", "ISBN": "1501156004", "description": ["From the instant ", " bestselling author of blockbuster thrillers ", " and ", " comes Ruth Ware’s chilling new novel.", "On a cool June morning, a woman is walking her dog in the idyllic coastal village of Salten along a tidal estuary known as the Reach. Before she can stop him, the dog charges into the water to retrieve what first appears to be a wayward stick, but to her horror, turns out to be something much more sinister...", "The next morning, three women in and around London—Fatima, Thea, and Isabel—receive the text they had always hoped would NEVER come, from the fourth in their formerly inseparable clique, Kate, that says only, “I need you.”", "The four girls were best friends at Salten, a second rate boarding school set near the cliffs of the English Channel. Each different in their own way, the four became inseparable and were notorious for playing the Lying Game, telling lies at every turn to both fellow boarders and faculty, with varying states of serious and flippant nature that were disturbing enough to ensure that everyone steered clear of them. The myriad and complicated rules of the game are strict: no lying to each other—ever. Bail on the lie when it becomes clear it is about to be found out. But their little game had consequences, and the girls were all expelled in their final year of school under mysterious circumstances surrounding the death of the school’s eccentric art teacher, Ambrose (who also happens to be Kate’s father).", "Atmospheric, twisty, and with just the right amount of chill that will keep you wrong-footed—which has now become Ruth Ware’s signature style—", " is sure to be her next big bestseller. Another unputdownable thriller from the Agatha Christie of our time."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/28763485-the-sun-is-also-a-star", "image": ["https://images.gr-assets.com/books/1459793538l/28763485.jpg"], "avg_ratings": ["\n  4.10\n"], "num_reviews": ["\n  ", "\n  96,461\n  ratings\n"], "genres": ["Young Adult", "Contemporary", "Romance", "Fiction"], "title": "The Sun Is Also a Star", "author": "Nicola Yoon", "num_pages": "384", "awards": ["California Book Award for Young Adult (Gold) (2016)", "Michael L. Printz Award Nominee (2017)", "South Carolina Book Award Nominee for Young Adult (2019)", "Rhode Island Teen Book Award Nominee for Honorable Mention (2018)", "John Steptoe New Talent Author Award (2017)", "Amelia Elizabeth Walden Award Nominee (2017)", "Goodreads Choice Award Nominee for Young Adult Fiction (2016)", "Missouri Gateway Readers Award Nominee (2018)", "Premio El Templo de las Mil Puertas Nominee for Mejor novela extranjera independiente (2017)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "ISBN": "0553496689", "description": ["Natasha: I’m a girl who believes in science and facts. Not fate. Not destiny. Or dreams that will never come true. I’m definitely not the kind of girl who meets a cute boy on a crowded New York City street and falls in love with him. Not when my family is twelve hours away from being deported to Jamaica. Falling in love with him won’t be my story.", "Daniel: I’ve always been the good son, the good student, living up to my parents’ high expectations. Never the poet. Or the dreamer. But when I see her, I forget about all that. Something about Natasha makes me think that fate has something much more extraordinary in store—for both of us.", "The Universe: Every moment in our lives has brought us to this single moment. A million futures lie before us. Which one will come true?"]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/26116473-the-outliers", "image": ["https://images.gr-assets.com/books/1450363086l/26116473.jpg"], "avg_ratings": ["\n  3.30\n"], "num_reviews": ["\n  ", "\n  5,945\n  ratings\n"], "genres": ["Young Adult", "Mystery", "Thriller", "Fiction", "Suspense"], "title": "The Outliers", "author": "Kimberly McCreight", "num_pages": "336", "awards": [], "places": ["Boston, Massachusetts"], "character_names": [], "language": "English", "ISBN": "0062359096", "description": ["Wylie hasn’t heard from Cassie in over a week, not since their last fight. But that doesn’t matter. Cassie’s in trouble, so Wylie decides to do what she has done so many times before: save her best friend from herself.", "This time it’s different, though. Instead of telling Wylie where she is, Cassie sends cryptic clues. And instead of having Wylie come by herself, Jasper shows up saying Cassie sent him to help. Trusting the guy who sent Cassie off the rails doesn’t feel right, but Wylie has no choice: she has to ignore her gut instinct and go with him.", "But figuring out where Cassie is goes from difficult to dangerous, fast. As Wylie and Jasper head farther and farther north into the dense woods of Maine, Wylie struggles to control her growing sense that something is really wrong. What isn’t Cassie telling them? And could finding her be only the beginning?"]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/5352.The_Summons", "image": ["https://images.gr-assets.com/books/1388611098l/5352.jpg"], "avg_ratings": ["\n  3.69\n"], "num_reviews": ["\n  ", "\n  60,776\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller"], "title": "The Summons", "author": "John Grisham", "num_pages": "384", "awards": [], "places": ["Clanton, Mississippi", "Atlantic City, New Jersey", "Charlottesville, Virginia"], "character_names": ["Ray Atlee", "Forrest Atlee", "Reuben Atlee", "Harry Rex Vonner"], "language": "English", "ISBN": "0385339593", "description": ["Ray Atlee is a professor of law at the University of Virginia. He's forty-three, newly single, and still enduring the aftershocks of a surprise divorce. He has a younger brother, Forrest, who redefines the notion of a family's black sheep.", "And he has a father, a very sick old man who lives alone in the ancestral home in Clanton, Mississippi. He is known to all as Judge Atlee, a beloved and powerful official who has towered over local law and politics for forty years. No longer on the bench, the Judge has withdrawn to the Atlee mansion and become a recluse.", "With the end in sight, Judge Atlee issues a summons for both sons to return home to Clanton, to discuss the details of his estate. It is typed by the Judge himself, on his handsome old stationery, and gives the date and time for Ray and Forrest to appear in his study.", "Ray reluctantly heads south, to his hometown, to the place where he grew up, which he prefers now to avoid. But the family meeting does not take place. The Judge dies too soon, and in doing so leaves behind a shocking secret known only to Ray.", "And perhaps someone else."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/85733.Beach_Road", "image": ["https://images.gr-assets.com/books/1387705973l/85733.jpg"], "avg_ratings": ["\n  3.82\n"], "num_reviews": ["\n  ", "\n  30,611\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller"], "title": "Beach Road", "author": "James Patterson", "num_pages": "390", "awards": [], "places": ["Long Island, New York", "Montauk, New York"], "character_names": [], "language": "English", "ISBN": "0316159786", "description": ["Tom Dunleavy has a one-man law firm in America's wealthiest resort town: legendary East Hampton. But his job barely keeps him in paper clips. His clients make a living serving the rich. The billionaires and celebrities swarming the beaches already have lawyers on their payroll.", "Then a friend of Tom's is arrested for a triple murder near a movie star's mansion. Tom knows in his gut that Dante Halleyville is innocent. Dante asks him to represent him in what could be the Trial of the Century.", "Tom recruits Manhattan superlawyer Kate Costello to help. She's a tough hire, because Kate is his ex-girlfriend, but she agrees. In their search to find who really executed three locals, Tom orchestrates a series of revelations to expose the killer, and what emerges is staggering.", "The final scenes of this audiobook unveil a truth that will leave readers gasping in shock. Written with the precision that has made James Patterson \"a master of his genre\" (", "), ", " is his wildest, most thrilling novel ever."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/25775707-small-wars", "image": ["https://images.gr-assets.com/books/1467905738l/25775707.jpg"], "avg_ratings": ["\n  3.98\n"], "num_reviews": ["\n  ", "\n  12,144\n  ratings\n"], "genres": ["Fiction", "Thriller", "Mystery", "Short Stories"], "title": "Small Wars", "author": "Lee Child", "num_pages": "44", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1473540488", "description": []},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/5360.A_Painted_House", "image": ["https://images.gr-assets.com/books/1386924850l/5360.jpg"], "avg_ratings": ["\n  3.69\n"], "num_reviews": ["\n  ", "\n  69,817\n  ratings\n"], "genres": ["Fiction", "Mystery"], "title": "A Painted House", "author": "John Grisham", "num_pages": "384", "awards": ["Publieksprijs voor het Nederlandse Boek Nominee (2001)"], "places": ["Arkansas"], "character_names": ["Luke"], "language": "English", "ISBN": "0385337930", "description": ["Until that September of 1952, Luke Chandler had never kept a secret or told a single lie. But in the long, hot summer of his seventh year, two groups of migrant workers — and two very dangerous men — came through the Arkansas Delta to work the Chandler cotton farm. And suddenly mysteries are flooding Luke’s world.", "A brutal murder leaves the town seething in gossip and suspicion. A beautiful young woman ignites forbidden passions. A fatherless baby is born ... and someone has begun furtively painting the bare clapboards of the Chandler farmhouse, slowly, painstakingly, bathing the run-down structure in gleaming white. And as young Luke watches the world around him, he unravels secrets that could shatter lives — and change his family and his town forever...."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/38255337-one-day-in-december", "image": ["https://images.gr-assets.com/books/1543961496l/38255337.jpg"], "avg_ratings": ["\n  4.08\n"], "num_reviews": ["\n  ", "\n  40,331\n  ratings\n"], "genres": ["Romance", "Fiction", "Womens Fiction", "Chick Lit", "Contemporary", "Holiday", "Christmas"], "title": "One Day in December", "author": "Josie Silver", "num_pages": "416", "awards": [], "places": ["London, England"], "character_names": ["Laurie James", "Jack O'Mara", "Sarah", "Oscar Ogilvy-Black"], "language": "English", "ISBN": "0525574689", "description": ["Two people. Ten chances. One unforgettable love story.", "Laurie is pretty sure love at first sight doesn't exist anywhere but the movies. But then, through a misted-up bus window one snowy December day, she sees a man who she knows instantly is the one. Their eyes meet, there's a moment of pure magic... and then her bus drives away.", "Certain they're fated to find each other again, Laurie spends a year scanning every bus stop and cafe in London for him. But she doesn't find him, not when it matters anyway. Instead they \"reunite\" at a Christmas party, when her best friend Sarah giddily introduces her new boyfriend to Laurie. It's Jack, the man from the bus. It would be.", "What follows for Laurie, Sarah and Jack is ten years of friendship, heartbreak, missed opportunities, roads not taken, and destinies reconsidered. ", " is a joyous, heartwarming and immensely moving love story to escape into and a reminder that fate takes inexplicable turns along the route to happiness."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/40409102-this-is-how-it-always-is", "image": ["https://images.gr-assets.com/books/1528314257l/40409102.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  39,380\n  ratings\n"], "genres": ["Fiction", "Contemporary", "Lgbt", "Audiobook", "Adult Fiction", "Adult", "Family", "Book Club", "Literary Fiction", "Realistic Fiction"], "title": "This is How It Always Is", "author": "Laurie Frankel", "num_pages": "338", "awards": ["Goodreads Choice Award Nominee for Fiction (2017)"], "places": [], "character_names": [], "language": "English", "description": ["This is how a family keeps a secret…and how that secret ends up keeping them.", "This is how a family lives happily ever after…until happily ever after becomes complicated.", "This is how children change…and then change the world.", "This is Claude. He’s five years old, the youngest of five brothers, and loves peanut butter sandwiches. He also loves wearing a dress, and dreams of being a princess.", "When he grows up, Claude says, he wants to be a girl.", "Rosie and Penn want Claude to be whoever Claude wants to be. They’re just not sure they’re ready to share that with the world. Soon the entire family is keeping Claude’s secret. Until one day it explodes.", "This Is How It Always Is is a novel about revelations, transformations, fairy tales, and family. And it’s about the ways this is how it always is: Change is always hard and miraculous and hard again, parenting is always a leap into the unknown with crossed fingers and full hearts, children grow but not always according to plan. And families with secrets don’t get to keep them forever."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/26192467-first-comes-love", "image": ["https://images.gr-assets.com/books/1460900049l/26192467.jpg"], "avg_ratings": ["\n  3.61\n"], "num_reviews": ["\n  ", "\n  37,603\n  ratings\n"], "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Romance", "Contemporary"], "title": "First Comes Love", "author": "Emily Giffin", "num_pages": "384", "awards": [], "places": ["New York City, New York", "Syracuse, New York", "Atlanta, Georgia"], "character_names": ["Josie Garland", "Meredith Garland", "Nolan", "Gabe", "Pete"], "language": "English", "ISBN": "034554692X", "description": ["In this dazzling new novel, Emily Giffin, the #1 ", " bestselling author of ", "and ", " introduces a pair of sisters who find themselves at a crossroads.", "  ", " Growing up, Josie and Meredith Garland shared a loving, if sometimes contentious relationship. Josie was impulsive, spirited, and outgoing; Meredith hardworking, thoughtful, and reserved. When tragedy strikes their family, their different responses to the event splinter their delicate bond.", "  ", " Fifteen years later, Josie and Meredith are in their late thirties, following very different paths. Josie, a first grade teacher, is single—and ", " to swearing off dating for good. What she wants more than the right guy, however, is to become a mother—a feeling that is heightened when her ex-boyfriend’s daughter ends up in her class. Determined to have the future she’s always wanted, Josie decides to take matters into her own hands.", "  ", " On the outside, Meredith is the model daughter with the perfect life. A successful attorney, she’s married to a wonderful man, and together they’re raising a beautiful four-year-old daughter. Yet lately, Meredith feels dissatisfied and restless, secretly wondering if she chose the life that was expected of her rather than the one she truly desired. ", "  ", " As the anniversary of their tragedy looms and painful secrets from the past begin to surface, Josie and Meredith must not only confront the issues that divide them, but also come to terms with their own choices. In their journey toward understanding and forgiveness, both sisters discover they need each other more than they knew . . . and that in the recipe for true happiness, love always comes first.", "  ", " Emotionally honest and utterly enthralling, ", " is a story about family, friendship, and the courage to follow your own heart—wherever that may lead."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/11332955-fateful", "image": ["https://images.gr-assets.com/books/1328335797l/11332955.jpg"], "avg_ratings": ["\n  3.90\n"], "num_reviews": ["\n  ", "\n  10,168\n  ratings\n"], "genres": ["Young Adult", "Fantasy", "Paranormal", "Historical", "Historical Fiction", "Romance", "Fantasy", "Shapeshifters", "Werewolves"], "title": "Fateful", "author": "Claudia Gray", "num_pages": "341", "awards": [], "places": [], "character_names": ["Tess Davies", "Alec Marlowe"], "language": "English", "description": []},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/25627445-beach-rental", "image": ["https://images.gr-assets.com/books/1434739950l/25627445.jpg"], "avg_ratings": ["\n  4.06\n"], "num_reviews": ["\n  ", "\n  4,099\n  ratings\n"], "genres": ["Romance", "Fiction", "Contemporary"], "title": "Beach Rental", "author": "Grace Greene", "num_pages": "300", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["On the Crystal Coast of North Carolina, in the small town of Emerald Isle… ", "Juli Cooke, hard-working and getting nowhere fast, marries a dying man, Ben Bradshaw, for a financial settlement, not expecting he will set her on a journey of hope and love. The journey brings her to Luke Winters, a local art dealer, but Luke resents the woman who married his sick friend and warns her not to hurt Ben—and he’s watching to make sure she doesn’t. ", "Until Ben dies and the stakes change. ", "Framed by the timelessness of the Atlantic Ocean and the brilliant blue of the beach sky, Juli struggles against her past, the opposition of Ben’s and Luke’s families, and even the living reminder of her marriage—to build a future with hope and perhaps to find the love of her life—if she can survive the danger from her past. "]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/25814539-opening-belle", "image": ["https://images.gr-assets.com/books/1454256728l/25814539.jpg"], "avg_ratings": ["\n  3.39\n"], "num_reviews": ["\n  ", "\n  5,746\n  ratings\n"], "genres": ["Womens Fiction", "Chick Lit", "Fiction", "Contemporary", "New York"], "title": "Opening Belle", "author": "Maureen Sherry", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1501110624", "description": ["Getting rich on Wall Street would be a lot more fun if the men would keep their hands off her assets. A whip-smart and funny novel told by a former Wall Street insider who reveals what it’s like for a working woman to balance love, ambition, and family in a world of glamorous excess, outrageous risk-taking, and jaw-dropping sexism.", "In 2008, Isabelle—a self-made, thirty-something Wall Street star—appears to have it all: an Upper West Side apartment, three healthy children, a handsome husband, and a high-powered job. But her reality is something else. Her trading desk work environment resembles a 1980s frat party, her husband feels employment is beneath him, and the bulk of childcare and homecare still falls in Belle’s already full lap.", "Enter Henry, the former college fiancé she never quite got over; now a hedge fund mogul. He becomes her largest client, and Belle gets to see the life she might have had with him. While Henry campaigns to win Belle back, the sexually harassed women in her office take action to improve their working conditions, and recruit a wary Belle into a secret “glass ceiling club” whose goal is to mellow the cowboy banking culture and get equal pay for their work. All along, Belle can sense the financial markets heading toward their soon-to-be historic crash and that something has to give—and when it does, everything is going to change: her marriage, her career, her world, and her need to keep her colleagues’ hands to themselves.", "From Maureen Sherry, a prize winning writer, a former Managing Director on Wall Street (who never signed a nondisclosure agreement when she left), ", " takes readers into the adrenaline-fueled chaos of a Wall Street trading desk, the lavish parties, the lunch-time rendezvous, and ultimately into the heart of a woman who finds it easier to cook up millions at work than dinner at home."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/30753570-are-you-sleeping", "image": ["https://images.gr-assets.com/books/1482221926l/30753570.jpg"], "avg_ratings": ["\n  3.64\n"], "num_reviews": ["\n  ", "\n  7,807\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Thriller", "Mystery Thriller", "Suspense"], "title": "Are You Sleeping", "author": "Kathleen  Barber", "num_pages": "326", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1501157663", "description": [" meets Ruth Ware’s ", " in this inventive and twisty psychological thriller about a mega-hit podcast that reopens a murder case—and threatens to unravel the carefully constructed life of the victim’s daughter.", "Josie Buhrman has spent the last ten years trying to escape her family’s reputation and with good reason. After her father's murder thirteen years prior, her mother ran away to join a cult and her twin sister Lanie, once Josie’s closest friend and confidant, betrayed her in an unimaginable way. Now, Josie has finally put down roots in New York, settling into domestic life with her partner Caleb, and that’s where she intends to stay. The only problem is that she has lied to Caleb about every detail of her past—starting with her last name.", "When investigative reporter Poppy Parnell sets off a media firestorm with a mega-hit podcast that reopens the long-closed case of Josie’s father’s murder, Josie’s world begins to unravel. Meanwhile, the unexpected death of Josie’s long-absent mother forces her to return to her Midwestern hometown where she must confront the demons from her past—and the lies on which she has staked her future."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/34565022-braving-the-wilderness", "image": ["https://images.gr-assets.com/books/1546075042l/34565022.jpg"], "avg_ratings": ["\n  4.17\n"], "num_reviews": ["\n  ", "\n  34,102\n  ratings\n"], "genres": ["Nonfiction", "Self Help", "Psychology", "Audiobook"], "title": "Braving the Wilderness: The Quest for True Belonging and the Courage to Stand Alone", "author": "Brené Brown", "num_pages": "208", "awards": ["Goodreads Choice Award Nominee for Nonfiction (2017)"], "places": [], "character_names": [], "language": "English", "ISBN": "0812995848", "description": ["\"True belonging doesn't require us to ", " who we are. It requires us to ", " who we are.\" Social scientist Brene Brown, PhD, LMSW, has sparked a global conversation about the experiences that bring meaning to our lives--experiences of courage, vulnerability, love, belonging, shame, and empathy. In ", " Brown redefines what it means to truly belong in an age of increased polarization. With her trademark mix of research, storytelling, and honesty, Brown will again change the cultural conversation while mapping a clear path to true belonging.", "Brown argues that we're experiencing a spiritual crisis of disconnection, and introduces four practices of true belonging that challenge everything we believe about ourselves and each other. She writes, \"True belonging requires us to believe in and belong to ourselves so fully that we can find sacredness both in being a part of something and in standing alone when necessary. But in a culture that's rife with perfectionism and pleasing, and with the erosion of civility, it's easy to stay quiet, hide in our ideological bunkers, or fit in rather than show up as our true selves and brave the wilderness of uncertainty and criticism. But true belonging is not something we negotiate or accomplish with others; it's a daily practice that demands integrity and authenticity. It's a personal commitment that we carry in our hearts.\" Brown offers us the clarity and courage we need to find our way back to ourselves and to each other. And that path cuts right through the wilderness. Brown writes, \"The wilderness is an untamed, unpredictable place of solitude and searching. It is a place as dangerous as it is breathtaking, a place as sought after as it is feared. But it turns out to be the place of true belonging, and it's the bravest and most sacred place you will ever stand.\""]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/11594337-the-one-and-only-ivan", "image": ["https://images.gr-assets.com/books/1424981397l/11594337.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  105,369\n  ratings\n"], "genres": ["Childrens", "Middle Grade", "Fiction", "Animals", "Childrens", "Young Adult"], "title": "The One and Only Ivan", "author": "Katherine Applegate", "num_pages": "307", "awards": ["Newbery Medal (2013)", "California Book Award for Juvenile (Gold) (2012)", "Pennsylvania Young Readers' Choice Award for Grades 3-6 (2014)", "Dorothy Canfield Fisher Children's Book Award Nominee (2014)", "Charlie May Simon Children's Book Award Nominee (2015)", "Bluestem Book Award (2015)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2012)", "SCBWI Crystal Kite Member Choice Award for California/Hawaii (2013)", "Oklahoma Sequoyah Award for Children (2015)", "Rebecca Caudill Young Readers' Book Award Nominee (2015)"], "places": [], "character_names": [], "language": "English", "ISBN": "0061992259", "description": ["Ivan is an easygoing gorilla. Living at the Exit 8 Big Top Mall and Video Arcade, he has grown accustomed to humans watching him through the glass walls of his domain. He rarely misses his life in the jungle. In fact, he hardly ever thinks about it at all.", "Instead, Ivan thinks about TV shows he’s seen and about his friends Stella, an elderly elephant, and Bob, a stray dog. But mostly Ivan thinks about art and how to capture the taste of a mango or the sound of leaves with color and a well-placed line.", "Then he meets Ruby, a baby elephant taken from her family, and she makes Ivan see their home—and his own art—through new eyes. When Ruby arrives, change comes with her, and it’s up to Ivan to make it a change for the better.", "Katherine Applegate blends humor and poignancy to create Ivan’s unforgettable first-person narration in a story of friendship, art, and hope."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/26114146-all-is-not-forgotten", "image": ["https://images.gr-assets.com/books/1467209074l/26114146.jpg"], "avg_ratings": ["\n  3.69\n"], "num_reviews": ["\n  ", "\n  20,209\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "All Is Not Forgotten", "author": "Wendy   Walker", "num_pages": "310", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1250097916", "description": ["In the small, affluent town of Fairview, Connecticut everything seems picture perfect.", "Until one night when young Jenny Kramer is attacked at a local party. In the hours immediately after, she is given a controversial drug to medically erase her memory of the violent assault. But, in the weeks and months that follow, as she heals from her physical wounds, and with no factual recall of the attack, Jenny struggles with her raging emotional memory. Her father, Tom, becomes obsessed with his inability to find her attacker and seek justice while her mother, Charlotte, prefers to pretend this horrific event did not touch her perfect country club world.", "As they seek help for their daughter, the fault lines within their marriage and their close-knit community emerge from the shadows where they have been hidden for years, and the relentless quest to find the monster who invaded their town - or perhaps lives among them - drive this psychological thriller to a shocking and unexpected conclusion."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/34374628-next-year-in-havana", "image": ["https://images.gr-assets.com/books/1498524468l/34374628.jpg"], "avg_ratings": ["\n  4.01\n"], "num_reviews": ["\n  ", "\n  19,121\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical", "Contemporary"], "title": "Next Year in Havana", "author": "Chanel Cleeton", "num_pages": "361", "awards": ["Goodreads Choice Award Nominee for Historical Fiction (2018)"], "places": [], "character_names": [], "language": "English", "ISBN": "0399586687", "description": ["After the death of her beloved grandmother, a Cuban-American woman travels to Havana, where she discovers the roots of her identity--and unearths a family secret hidden since the revolution...", "Havana, 1958. The daughter of a sugar baron, nineteen-year-old Elisa Perez is part of Cuba's high society, where she is largely sheltered from the country's growing political unrest--until she embarks on a clandestine affair with a passionate revolutionary...", "Miami, 2017. Freelance writer Marisol Ferrera grew up hearing romantic stories of Cuba from her late grandmother Elisa, who was forced to flee with her family during the revolution. Elisa's last wish was for Marisol to scatter her ashes in the country of her birth. ", "Arriving in Havana, Marisol comes face-to-face with the contrast of Cuba's tropical, timeless beauty and its perilous political climate. When more family history comes to light and Marisol finds herself attracted to a man with secrets of his own, she'll need the lessons of her grandmother's past to help her understand the true meaning of courage."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/15776309-reconstructing-amelia", "image": ["https://images.gr-assets.com/books/1350193583l/15776309.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  110,769\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Young Adult", "Thriller", "Mystery Thriller", "Contemporary"], "title": "Reconstructing Amelia", "author": "Kimberly McCreight", "num_pages": "382", "awards": ["Anthony Award Nominee for Best First Novel (2014)", "Edgar Award Nominee for Best First Novel (2014)", "Goodreads Choice Award Nominee for Mystery & Thriller (2013)"], "places": ["New York City, New York"], "character_names": [], "language": "English", "ISBN": "006222543X", "description": ["In ", ", the stunning debut novel from Kimberly McCreight, Kate's in the middle of the biggest meeting of her career when she gets the telephone call from Grace Hall, her daughter’s exclusive private school in Park Slope, Brooklyn. Amelia has been suspended, effective immediately, and Kate must come get her daughter—now. But Kate’s stress over leaving work quickly turns to panic when she arrives at the school and finds it surrounded by police officers, fire trucks, and an ambulance. By then it’s already too late for Amelia. And for Kate.", "An academic overachiever despondent over getting caught cheating has jumped to her death. At least that’s the story Grace Hall tells Kate. And clouded as she is by her guilt and grief, it is the one she forces herself to believe. Until she gets an anonymous text: She didn’t jump.", " is about secret first loves, old friendships, and an all-girls club steeped in tradition. But, most of all, it’s the story of how far a mother will go to vindicate the memory of a daughter whose life she couldn’t save.", "Fans of Gillian Flynn's ", " will find ", " just as gripping and surprising."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/32051912-the-alice-network", "image": ["https://images.gr-assets.com/books/1492238040l/32051912.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  101,959\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "War", "World War II"], "title": "The Alice Network", "author": "Kate Quinn", "num_pages": "532", "awards": ["Goodreads Choice Award Nominee for Historical Fiction (2017)"], "places": ["France"], "character_names": [], "language": "English", "ISBN": "0062654195", "description": ["In an enthralling new historical novel from national bestselling author Kate Quinn, two women—a female spy recruited to the real-life Alice Network in France during World War I and an unconventional American socialite searching for her cousin in 1947—are brought together in a mesmerizing story of courage and redemption. "]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/26245850-before-the-fall", "image": ["https://images.gr-assets.com/books/1462515889l/26245850.jpg"], "avg_ratings": ["\n  3.74\n"], "num_reviews": ["\n  ", "\n  92,261\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller", "Thriller", "Mystery Thriller", "Audiobook", "Suspense"], "title": "Before the Fall", "author": "Noah Hawley", "num_pages": "391", "awards": ["Macavity Award Nominee for Best Novel (2017)", "ITW Thriller Award for Best Hardcover Novel (2017)", "Edgar Award for Best Novel (2017)"], "places": [], "character_names": [], "language": "English", "ISBN": "1455561789", "description": ["On a foggy summer night, eleven people—ten privileged, one down-on-his-luck painter—depart Martha's Vineyard on a private jet headed for New York. Sixteen minutes later, the unthinkable happens: the plane plunges into the ocean. The only survivors are the painter Scott Burroughs and a four-year-old boy, who is now the last remaining member of an immensely wealthy and powerful media mogul's family.", "Was it by chance that so many influential people perished? Or was something more sinister at work? A storm of media attention brings Scott fame that quickly morphs into notoriety and accusations, and he scrambles to salvage truth from the wreckage. Amid trauma and chaos, the fragile relationship between Scott and the young boy grows and glows at the heart of this stunning novel, raising questions of fate, morality, and the inextricable ties that bind us together."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/29540318-year-of-yes", "image": ["https://images.gr-assets.com/books/1458219457l/29540318.jpg"], "avg_ratings": ["\n  4.08\n"], "num_reviews": ["\n  ", "\n  45,976\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Audiobook", "Self Help"], "title": "Year of Yes", "author": "Shonda Rhimes", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1471157326", "description": ["In this poignant, hilarious and deeply intimate call to arms, Hollywood's most powerful woman, the mega-talented creator of Grey's Anatomy and Scandal and executive producer of How to Get Away with Murder and Catch, reveals how saying YES changed her life - and how it can change yours too. With three hit shows on television and three children at home, Shonda Rhimes had lots of good reasons to say no when invitations arrived. Hollywood party? No. Speaking engagement? No. Media appearances? No. And to an introvert like Shonda, who describes herself as 'hugging the walls' at social events and experiencing panic attacks before press interviews, there was a particular benefit to saying no: nothing new to fear. Then came Thanksgiving 2013, when Shonda's sister Delorse muttered six little words at her: You never say yes to anything. Profound, impassioned and laugh-out-loud funny, in Year of Yes Shonda Rhimes reveals how saying YES changed - and saved - her life. And inspires readers everywhere to change their own lives with one little word: Yes."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/5886881-dark-places", "image": ["https://images.gr-assets.com/books/1354988288l/5886881.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  468,345\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "Dark Places", "author": "Gillian Flynn", "num_pages": "349", "awards": ["Black Quill Award for Dark Genre Novel of the Year (2010)", "CWA Ian Fleming Steel Dagger Nominee (2010)"], "places": ["Kinnakee, Kansas", "Kansas City, Missouri", "Other Editions (149)", "\n", "\n", "\n", "\n", "\n", "All Editions"], "character_names": ["Libby Day", "Ben Day", "Patty Day", "Ronald 'Runner' Day", "Diondra Wertzner"], "language": "English", "ISBN": "0307341569", "description": ["Libby Day was seven when her mother and two sisters were murdered in “The Satan Sacrifice\" of Kinnakee, Kansas. She survived—and famously testified that her fifteen-year-old brother, Ben, was the killer. Twenty-five years later, the Kill Club—a secret secret society obsessed with notorious crimes—locates Libby and pumps her for details. They hope to discover proof that may free Ben. Libby hopes to turn a profit off her tragic history: She’ll reconnect with the players from that night and report her findings to the club—for a fee. As Libby’s search takes her from shabby Missouri strip clubs to abandoned Oklahoma tourist towns, the unimaginable truth emerges, and Libby finds herself right back where she started—on the run from a killer."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/6837103-the-kitchen-house", "image": ["https://images.gr-assets.com/books/1463229128l/6837103.jpg"], "avg_ratings": ["\n  4.19\n"], "num_reviews": ["\n  ", "\n  204,954\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Book Club"], "title": "The Kitchen House", "author": "Kathleen Grissom", "num_pages": "369", "awards": ["Goodreads Choice Award Nominee for Historical Fiction, Debut Author (2010)"], "places": ["Virginia"], "character_names": ["Ben", "Marshall", "Belle", "Captain Pyke", "Miss Martha", "Lavinia McCarten", "Mama Mae", "Papa George", "Uncle Jacob", "Sukey", "Campbell", "Fanny", "Beattie", "Dory", "Overseer Rankin", "Sally Pyke"], "language": "English", "ISBN": "1439153663", "description": ["When a white servant girl violates the order of plantation society, she unleashes a tragedy that exposes the worst and best in the people she has come to call her family. Orphaned while onboard ship from Ireland, seven-year-old Lavinia arrives on the steps of a tobacco plantation where she is to live and work with the slaves of the kitchen house. Under the care of Belle, the master's illegitimate daughter, Lavinia becomes deeply bonded to her adopted family, though she is set apart from them by her white skin. ", "Eventually, Lavinia is accepted into the world of the big house, where the master is absent and the mistress battles opium addiction. Lavinia finds herself perilously straddling two very different worlds. When she is forced to make a choice, loyalties are brought into question, dangerous truths are laid bare, and lives are put at risk."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/26893819-the-girls", "image": ["https://images.gr-assets.com/books/1492065338l/26893819.jpg"], "avg_ratings": ["\n  3.47\n"], "num_reviews": ["\n  ", "\n  135,456\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Adult", "Literary Fiction", "Contemporary", "Audiobook", "Historical", "Adult Fiction", "Young Adult", "Coming Of Age", "Mystery", "Crime"], "title": "The Girls", "author": "Emma Cline", "num_pages": "355", "awards": ["Shirley Jackson Award for Novel (2016)", "Los Angeles Times Book Prize Nominee for Mystery/Thriller (2016)", "The Center for Fiction First Novel Prize Nominee for Shortlist (2016)", "Goodreads Choice Award Nominee for Fiction (2016)"], "places": ["California"], "character_names": [], "language": "English", "ISBN": "081299860X", "description": ["Northern California, during the violent end of the 1960s. At the start of summer, a lonely and thoughtful teenager, Evie Boyd, sees a group of girls in the park, and is immediately caught by their freedom, their careless dress, their dangerous aura of abandon. Soon, Evie is in thrall to Suzanne, a mesmerizing older girl, and is drawn into the circle of a soon-to-be infamous cult and the man who is its charismatic leader. Hidden in the hills, their sprawling ranch is eerie and run down, but to Evie, it is exotic, thrilling, charged—a place where she feels desperate to be accepted. As she spends more time away from her mother and the rhythms of her daily life, and as her obsession with Suzanne intensifies, Evie does not realize she is coming closer and closer to unthinkable violence, and to that moment in a girl’s life when everything can go horribly wrong."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/28187230-the-woman-in-cabin-10", "image": ["https://images.gr-assets.com/books/1465878007l/28187230.jpg"], "avg_ratings": ["\n  3.68\n"], "num_reviews": ["\n  ", "\n  238,779\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Suspense", "Thriller", "Mystery Thriller"], "title": "The Woman in Cabin 10", "author": "Ruth Ware", "num_pages": "340", "awards": ["Goodreads Choice Award Nominee for Mystery & Thriller (2016)", "Book of the Month Book of the Year Award Nominee (2016)", "Theakston Old Peculier Crime Novel of the Year Nominee for Longlist (2017)"], "places": ["London, England"], "character_names": [], "language": "English", "ISBN": "1501132938", "description": ["Lo Blacklock, a journalist who writes for a travel magazine, has just been given the assignment of a lifetime: a week on a luxury cruise with only a handful of cabins. The sky is clear, the waters calm, and the veneered, select guests jovial as the exclusive cruise ship, the Aurora, begins her voyage in the picturesque North Sea. At first, Lo's stay is nothing but pleasant: the cabins are plush, the dinner parties are sparkling, and the guests are elegant. But as the week wears on, frigid winds whip the deck, gray skies fall, and Lo witnesses what she can only describe as a dark and terrifying nightmare: a woman being thrown overboard. The problem? All passengers remain accounted for and so, the ship sails on as if nothing has happened, despite Lo's desperate attempts to convey that something (or someone) has gone terribly, terribly wrong."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/24396876-the-thing-about-jellyfish", "image": ["https://images.gr-assets.com/books/1439121354l/24396876.jpg"], "avg_ratings": ["\n  4.08\n"], "num_reviews": ["\n  ", "\n  19,881\n  ratings\n"], "genres": ["Childrens", "Middle Grade", "Young Adult", "Realistic Fiction", "Fiction", "Contemporary", "Childrens"], "title": "The Thing About Jellyfish", "author": "Ali Benjamin", "num_pages": "352", "awards": ["National Book Award Nominee for Young People's Literature (2015)", "Keystone to Reading Book Award Nominee for Middle School (2017)", "Rhode Island Teen Book Award Nominee (2017)", "Dorothy Canfield Fisher Children's Book Award Nominee (2017)", "Gouden Lijst for vertaald boek (2017)", "Goodreads Choice Award Nominee for Middle Grade & Children's (2015)"], "places": [], "character_names": [], "language": "English", "ISBN": "0316380865", "description": [" After her best friend dies in a drowning accident, Suzy is convinced that the true cause of the tragedy must have been a rare jellyfish sting--things don't just happen for no reason. Retreating into a silent world of imagination, she crafts a plan to prove her theory--even if it means traveling the globe, alone. Suzy's achingly heartfelt journey explores life, death, the astonishing wonder of the universe...and the potential for love and hope right next door.", "Oddlot Entertainment has acquired the screen rights to ", ", with Gigi Pritzker set to produce with Bruna Papandrea and Reese Witherspoon."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/23346377-in-a-dark-dark-wood", "image": ["https://images.gr-assets.com/books/1429521615l/23346377.jpg"], "avg_ratings": ["\n  3.68\n"], "num_reviews": ["\n  ", "\n  147,854\n  ratings\n"], "genres": ["Mystery", "Thriller", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "In a Dark, Dark Wood", "author": "Ruth Ware", "num_pages": "352", "awards": [], "places": ["England"], "character_names": [], "language": "English", "ISBN": "1846558913", "description": ["Nora hasn't seen Clare for ten years. Not since Nora walked out of school one day and never went back. ", "Until, out of the blue, an invitation to Clare’s hen do arrives. Is this a chance for Nora to finally put her past behind her?", "But something goes wrong. Very wrong.", "Some things can’t stay secret for ever."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/32956365-the-light-we-lost", "image": ["https://images.gr-assets.com/books/1493724414l/32956365.jpg"], "avg_ratings": ["\n  3.90\n"], "num_reviews": ["\n  ", "\n  44,882\n  ratings\n"], "genres": ["Romance", "Fiction", "Contemporary", "Womens Fiction", "Chick Lit"], "title": "The Light We Lost", "author": "Jill Santopolo", "num_pages": "328", "awards": [], "places": ["New York City, New York", "Tel Aviv"], "character_names": ["Lucy", "Gabe Samson"], "language": "English", "ISBN": "0735212759", "description": ["Lucy is faced with a life-altering choice. But before she can make her decision, she must start her story—their story—at the very beginning.", " Lucy and Gabe meet as seniors at Columbia University on a day that changes both of their lives forever. Together, they decide they want their lives to mean something, to matter. When they meet again a year later, it seems fated—perhaps they’ll find life’s meaning in each other. But then Gabe becomes a photojournalist assigned to the Middle East and Lucy pursues a career in New York. What follows is a thirteen-year journey of dreams, desires, jealousies, betrayals, and, ultimately, of love. Was it fate that brought them together? Is it choice that has kept them away? Their journey takes Lucy and Gabe continents apart, but never out of each other’s hearts."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/34273236-little-fires-everywhere", "image": ["https://images.gr-assets.com/books/1522684533l/34273236.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  294,871\n  ratings\n"], "genres": ["Fiction", "Contemporary", "Audiobook"], "title": "Little Fires Everywhere", "author": "Celeste Ng", "num_pages": "338", "awards": ["Goodreads Choice Award for Fiction (2017) and Nominee for Best of the Best  (2018)", "NAACP Image Award Nominee for Fiction (2018)", "Book of the Month Book of the Year Award Nominee (2017)"], "places": ["Cleveland, Ohio", "Shaker Heights, Ohio", "Ohio"], "character_names": ["Mia Warren", "Pearl Warren", "Elena Richardson", "Izzy Richardson", "Moody Richardson", "Trip Richardson", "Lexie Richardson"], "language": "English", "ISBN": "0735224293", "description": []},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/12262741-wild", "image": ["https://images.gr-assets.com/books/1453189881l/12262741.jpg"], "avg_ratings": ["\n  3.98\n"], "num_reviews": ["\n  ", "\n  506,794\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Travel", "Biography"], "title": "Wild: From Lost to Found on the Pacific Crest Trail", "author": "Cheryl Strayed", "num_pages": "315", "awards": ["Oregon Book Award Nominee for Creative Nonfiction (Finalist) (2013)", "Indies Choice Book Award for Adult Nonfiction (2013)", "Puddly Award for Nonfiction (2013)", "Goodreads Choice Award for Memoir & Autobiography (2012)"], "places": ["Oregon"], "character_names": ["Cheryl Strayed"], "language": "English", "ISBN": "0307592731", "description": ["An alternate cover for this ISBN can be found ", ".", "At twenty-two, Cheryl Strayed thought she had lost everything. In the wake of her mother’s death, her family scattered and her own marriage was soon destroyed. Four years later, with nothing more to lose, she made the most impulsive decision of her life. With no experience or training, driven only by blind will, she would hike more than a thousand miles of the Pacific Crest Trail from the Mojave Desert through California and Oregon to Washington State — and she would do it alone.", "Told with suspense and style, sparkling with warmth and humor, ", " powerfully captures the terrors and pleasures of one young woman forging ahead against all odds on a journey that maddened, strengthened, and ultimately healed her."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/22609317-luckiest-girl-alive", "image": ["https://images.gr-assets.com/books/1425975301l/22609317.jpg"], "avg_ratings": ["\n  3.49\n"], "num_reviews": ["\n  ", "\n  120,740\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller", "Contemporary"], "title": "Luckiest Girl Alive", "author": "Jessica Knoll", "num_pages": "352", "awards": ["Edgar Award Nominee for Best First Novel (2016)", "Goodreads Choice Award Nominee for Mystery & Thriller, and for Goodreads Debut Author (2015)"], "places": [], "character_names": [], "language": "English", "ISBN": "1476789630", "description": ["HER PERFECT LIFE IS A PERFECT LIE.", "As a teenager at the prestigious Bradley School, Ani FaNelli endured a shocking, public humiliation that left her desperate to reinvent herself. Now, with a glamorous job, expensive wardrobe, and handsome blue blood fiancé, she’s this close to living the perfect life she’s worked so hard to achieve.", "But Ani has a secret.", "There’s something else buried in her past that still haunts her, something private and painful that threatens to bubble to the surface and destroy everything.", "With a singular voice and twists you won’t see coming, Luckiest Girl Alive explores the unbearable pressure that so many women feel to “have it all” and introduces a heroine whose sharp edges and cutthroat ambition have been protecting a scandalous truth, and a heart that's bigger than it first appears.", "The question remains: will breaking her silence destroy all that she has worked for—or, will it at long last, set Ani free?"]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/31434883-eleanor-oliphant-is-completely-fine", "image": ["https://images.gr-assets.com/books/1493724347l/31434883.jpg"], "avg_ratings": ["\n  4.33\n"], "num_reviews": ["\n  ", "\n  296,276\n  ratings\n"], "genres": ["Fiction", "Contemporary", "Audiobook"], "title": "Eleanor Oliphant Is Completely Fine", "author": "Gail Honeyman", "num_pages": "327", "awards": ["Costa Book Award for First Novel (2017)", "Audie Award for Fiction (2018)", "Women's Prize for Fiction Nominee for Longlist (2018)", "Goodreads Choice Award Nominee for Fiction (2017)", "WHSmith’s Book of the Year (2017)"], "places": ["Glasgow, Scotland"], "character_names": ["Eleanor Oliphant", "Raymond Gibbons"], "language": "English", "ISBN": "0735220689", "description": ["No one’s ever told Eleanor that life should be better than fine. ", "Meet Eleanor Oliphant: She struggles with appropriate social skills and tends to say exactly what she’s thinking. Nothing is missing in her carefully timetabled life of avoiding social interactions, where weekends are punctuated by frozen pizza, vodka, and phone chats with Mummy. ", "But everything changes when Eleanor meets Raymond, the bumbling and deeply unhygienic IT guy from her office. When she and Raymond together save Sammy, an elderly gentleman who has fallen on the sidewalk, the three become the kinds of friends who rescue one another from the lives of isolation they have each been living. And it is Raymond’s big heart that will ultimately help Eleanor find the way to repair her own profoundly damaged one.", "Soon to be a major motion picture produced by Reese Witherspoon, Eleanor Oliphant Is Completely Fine is the smart, warm, and uplifting story of an out-of-the-ordinary heroine whose deadpan weirdness and unconscious wit make for an irresistible journey as she realizes. . . ", "The only way to survive is to open your heart."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/8442457-gone-girl", "image": ["https://images.gr-assets.com/books/1339602131l/8442457.jpg"], "avg_ratings": ["\n  4.05\n"], "num_reviews": ["\n  ", "\n  1,904,853\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller", "Mystery", "Crime"], "title": "Gone Girl", "author": "Gillian Flynn", "num_pages": "399", "awards": ["Barry Award Nominee for Best Novel (2013)", "Anthony Award Nominee for Best Novel (2013)", "Romantic Times Reviewers' Choice Award (RT Award) for Suspense/Thriller Novel (2012)", "Shirley Jackson Award Nominee for Novel (Finalist) (2012)", "Edgar Award Nominee for Best Novel (2013)", "Puddly Award for Fiction (2013)", "Women's Prize for Fiction Nominee for Longlist (2013)", "Grand Prix des lectrices de Elle for roman policier (2013)", "Goodreads Choice Award for Mystery & Thriller and Nominee for Goodreads Author (2012) and Nominee for Best of the Best  (2018)"], "places": ["North Carthage, Missouri", "Missouri"], "character_names": ["Nick Dunne", "Amy Elliot Dunne", "Margo \"Go\" Dunne", "Rand Elliot", "Marybeth Elliot", "Jim Gilpin", "Rhonda Boney", "Tanner Bolt", "Andie Hardy", "Desi Collings"], "language": "English", "ISBN": "0297859382", "description": ["On a warm summer morning in North Carthage, Missouri, it is Nick and Amy Dunne’s fifth wedding anniversary. Presents are being wrapped and reservations are being made when Nick’s clever and beautiful wife disappears. Husband-of-the-Year Nick isn’t doing himself any favors with cringe-worthy daydreams about the slope and shape of his wife’s head, but passages from Amy's diary reveal the alpha-girl perfectionist could have put anyone dangerously on edge", " Under mounting pressure from the police and the media—as well as Amy’s fiercely doting parents—the town golden boy parades an endless series of lies, deceits, and inappropriate behavior. Nick is oddly evasive, and he’s definitely bitter—but is he really a killer? "]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/19486412-big-little-lies", "image": ["https://images.gr-assets.com/books/1492239430l/19486412.jpg"], "avg_ratings": ["\n  4.25\n"], "num_reviews": ["\n  ", "\n  558,934\n  ratings\n"], "genres": ["Fiction", "Mystery", "Contemporary", "Womens Fiction", "Chick Lit"], "title": "Big Little Lies", "author": "Liane Moriarty", "num_pages": "460", "awards": ["Davitt Award for Best Adult Novel (2015)", "Goodreads Choice Award Nominee for Fiction (2014)"], "places": ["Australia"], "character_names": ["Celeste White", "Madeline Martha Mackenzie", "Jane (Liane Moriarty)"], "language": "English", "ISBN": "0399167064", "description": [" follows three women, each at a crossroads:", "Madeline is a force to be reckoned with. She’s funny and biting, passionate, she remembers everything and forgives no one. Her ex-husband and his yogi new wife have moved into her beloved beachside community, and their daughter is in the same kindergarten class as Madeline’s youngest (", "is this possible?). And to top it all off, Madeline’s teenage daughter seems to be choosing Madeline’s ex-husband over her. (How. Is. This. Possible?).", "Celeste is the kind of beautiful woman who makes the world stop and stare. While she may seem a bit flustered at times, who wouldn’t be, with those rambunctious twin boys? Now that the boys are starting school, Celeste and her husband look set to become the king and queen of the school parent body. But royalty often comes at a price, and Celeste is grappling with how much more she is willing to pay.", "New to town, single mom Jane is so young that another mother mistakes her for the nanny. Jane is sad beyond her years and harbors secret doubts about her son. But why? While Madeline and Celeste soon take Jane under their wing, none of them realizes how the arrival of Jane and her inscrutable little boy will affect them all.", " is a brilliant take on ex-husbands and second wives, mothers and daughters, schoolyard scandal, and the dangerous little lies we tell ourselves just to survive."]},
{"list": "Reese Book Club", "url": "https://www.goodreads.com/book/show/36809135-where-the-crawdads-sing", "image": ["https://images.gr-assets.com/books/1524102644l/36809135.jpg"], "avg_ratings": ["\n  4.54\n"], "num_reviews": ["\n  ", "\n  63,429\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Audiobook"], "title": "Where the Crawdads Sing", "author": "Delia Owens", "num_pages": "325", "awards": ["Goodreads Choice Award Nominee for Historical Fiction (2018)"], "places": ["North Carolina Coast"], "character_names": [], "language": "English", "description": ["For years, rumors of the “Marsh Girl” have haunted Barkley Cove, a quiet town on the North Carolina coast. So in late 1969, when handsome Chase Andrews is found dead, the locals immediately suspect Kya Clark, the so-called Marsh Girl. But Kya is not what they say. Sensitive and intelligent, she has survived for years alone in the marsh that she calls home, finding friends in the gulls and lessons in the sand. Then the time comes when she yearns to be touched and loved. When two young men from town become intrigued by her wild beauty, Kya opens herself to a new life–until the unthinkable happens.", "Perfect for fans of Barbara Kingsolver and Karen Russell, ", " is at once an exquisite ode to the natural world, a heartbreaking coming-of-age story, and a surprising tale of possible murder. Owens reminds us that we are forever shaped by the children we once were, and that we are all subject to the beautiful and violent secrets that nature keeps."]}
]