[
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/348914.Wuthering_Heights", "image": ["https://images.gr-assets.com/books/1544305592l/348914.jpg"], "avg_ratings": ["\n  3.84\n"], "num_reviews": ["\n  ", "\n  1,140,976\n  ratings\n"], "genres": ["Classics", "Fiction", "Romance", "Literature"], "title": "Wuthering Heights", "author": "Emily Brontë", "num_pages": "359", "awards": [], "places": ["Yorkshire Dales, England"], "character_names": ["Heathcliff", "Catherine Earnshaw", "Edgar Linton", "Isabella Linton", "Hindley Earnshaw", "Ellen (Nelly) Dean", "Mr. Lockwood", "Hareton Earnshaw", "Catherine Linton", "Linton Heathcliff"], "language": "English", "ISBN": "0141439556", "description": ["Lockwood, the new tenant of Thrushcross Grange, situated on the bleak Yorkshire moors, is forced to seek shelter one night at Wuthering Heights, the home of his landlord. There he discovers the history of the tempestuous events that took place years before; of the intense relationship between the gypsy foundling Heathcliff and Catherine Earnshaw; and how Catherine, forced to choose between passionate, tortured Heathcliff and gentle, well-bred Edgar Linton, surrendered to the expectations of her class. As Heathcliff's bitterness and vengeance at his betrayal is visited upon the next generation, their innocent heirs must struggle to escape the legacy of the past.", "Emily Brontë's only novel, a work of tremendous and far-reaching influence, the Penguin Classics edition of Wuthering Heights is the definitive edition of the text, edited with an introduction by Pauline Nestor. In this edition, a new preface by Lucasta Miller, author of The Brontë Myth, looks at the ways in which the novel has been interpreted, from Charlotte Brontë onwards. This complements Pauline Nestor's introduction, which discusses changing critical receptions of the novel, as well as Emily Brontë's influences and background.", "Emily Brontë (1818-48), along with her sisters, Charlotte and Anne, was one of the most significant literary figures of the 19th century. She wrote just one strikingly innovative novel, Wuthering Heights, but was also a gifted and intense poet.", "'Wuthering Heights is commonly thought of as \"romantic\", but try rereading it without being astonished by the comfortableness with which Brontë's characters subject one another to extremes of physical and psychological violence'", "Jeanette Winterson", "'As a first novel, there is very little that can compare to it. Even Shakespeare took over a decade to reach the clifftop extremities of King Lear'", "Sarah Waters"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/858480.The_Moon_in_The_Water", "image": ["https://images.gr-assets.com/books/1301765542l/858480.jpg"], "avg_ratings": ["\n  4.11\n"], "num_reviews": ["\n  ", "\n  291\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "Civil War", "English Civil War", "Romance", "Romance", "Historical Romance"], "title": "The Moon in The Water", "author": "Pamela Belle", "num_pages": "530", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0425082687", "description": ["An historical saga set during the English Civil War and telling the story of two star-crossed lovers.", "This is the first of Pamela's civil war series. Pamela did extensive research into her writings to give an accurate portrayal of life in 17th century England during the civil war. Her fictional family, the Herons, live in Suffolk England in 'Goldhayes' manor. The family is caught up in the war, and they fight for the King, against Parliament. The book richly describes the battles in which the Herons are involved. Many of the characters that interact with the family are real, as are the events in which the family takes part in. There is a romance between two of the main characters, Thomazine and Francis Heron, who are cousins. Thomazine, however, was betrothed to another cousin, Dominic Drakelon, when she was 10, and the resulting conflict gives this story much suspense, and appeal."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/8689913-madame-tussaud", "image": ["https://images.gr-assets.com/books/1320558120l/8689913.jpg"], "avg_ratings": ["\n  3.95\n"], "num_reviews": ["\n  ", "\n  18,086\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "Cultural", "France", "European History", "French Revolution"], "title": "Madame Tussaud: A Novel of the French Revolution", "author": "Michelle Moran", "num_pages": "446", "awards": [], "places": ["Paris"], "character_names": ["Maximilien Robespierre"], "language": "English", "ISBN": "0307588653", "description": ["The world knows Madame Tussaud as a wax artist extraordinaire... but who was this woman who became one of the most famous sculptresses of all time? In these pages, her tumultuous and amazing story comes to life as only Michelle Moran can tell it. The year is 1788, and a revolution is about to begin.", "Smart and ambitious, Marie Tussaud has learned the secrets of wax sculpting by working alongside her uncle in their celebrated wax museum, the Salon de Cire. From her popular model of the American ambassador, Thomas Jefferson, to her tableau of the royal family at dinner, Marie's museum provides Parisians with the very latest news on fashion, gossip, and even politics. Her customers hail from every walk of life, yet her greatest dream is to attract the attention of Marie Antoinette and Louis XVI; their stamp of approval on her work could catapult her and her museum to the fame and riches she desires. After months of anticipation, Marie learns that the royal family is willing to come and see their likenesses. When they finally arrive, the king's sister is so impressed that she requests Marie's presence at Versailles as a royal tutor in wax sculpting. It is a request Marie knows she cannot refuse - even if it means time away from her beloved Salon and her increasingly dear friend, Henri Charles.", "As Marie gets to know her pupil, Princesse Élisabeth, she also becomes acquainted with the king and queen, who introduce her to the glamorous life at court. From lavish parties with more delicacies than she's ever seen to rooms filled with candles lit only once before being discarded, Marie steps into a world entirely different from her home on the Boulevard du Temple, where people are selling their teeth in order to put food on the table.", "Meanwhile, many resent the vast separation between rich and poor. In salons and cafés across Paris, people like Camille Desmoulins, Jean-Paul Marat, and Maximilien Robespierre are lashing out against the monarchy. Soon, there's whispered talk of revolution... Will Marie be able to hold on to both the love of her life and her friendship with the royal family as France approaches civil war? And more important, will she be able to fulfill the demands of powerful revolutionaries who ask that she make the death masks of beheaded aristocrats, some of whom she knows?", "Spanning five years, from the budding revolution to the Reign of Terror, Madame Tussaud brings us into the world of an incredible heroine whose talent for wax modeling saved her life and preserved the faces of a vanished kingdom"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/33507.Twenty_Thousand_Leagues_Under_the_Sea", "image": ["https://images.gr-assets.com/books/1494979127l/33507.jpg"], "avg_ratings": ["\n  3.87\n"], "num_reviews": ["\n  ", "\n  167,711\n  ratings\n"], "genres": ["Classics", "Science Fiction", "Fiction", "Adventure", "Fantasy", "Literature", "Cultural", "France", "Science Fiction", "Steampunk", "Novels", "Literature", "19th Century"], "title": "Twenty Thousand Leagues Under the Sea", "author": "Jules Verne", "num_pages": "394", "awards": [], "places": ["Antarctica", "Bahamas", "Indian Ocean", "Pacific Ocean", "Atlantis", "Red Sea", "Mediterranean"], "character_names": ["Pierre Aronnax", "Ned Land", "Captain Nemo"], "language": "English", "ISBN": "076072850X", "description": ["French naturalist Dr. Aronnax embarks on an expedition to hunt down a sea monster, only to discover instead the ", " a remarkable submarine built by the enigmatic Captain Nemo. Together Nemo and Aronnax explore the underwater marvels, undergo a transcendent experience amongst the ruins of Atlantis, and plant a black flag at the South Pole. But Nemo's mission is one of revenge-and his methods coldly efficient."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/1599845.The_Day_of_the_Butterfly", "image": ["https://images.gr-assets.com/books/1266453472l/1599845.jpg"], "avg_ratings": ["\n  3.60\n"], "num_reviews": ["\n  ", "\n  141\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical", "Romance", "Historical Romance", "European Literature", "British Literature"], "title": "The Day of the Butterfly", "author": "Norah Lofts", "num_pages": "320", "awards": ["Georgette Heyer Historical Novel Prize (1979)"], "places": [], "character_names": [], "language": "English", "ISBN": "0449243591", "description": ["Chestnut-haired Daisy saw her own past unfurling like one of Sir Charles' maps. Not step was ever consciously planned; being chosen by Lady Langton as a suitable nursemaid for Mrs. Westcott; getting sacked; drifting into Kitty Hammond's fashionable house of pleasure; dancing for her living; meeting Jack Skelton; loving Jack far more than he had ever loved her; marrying Sir Charles Overton whose embraces she merely endured.", "But now all that had changed. Now there was Captain Hugo Stirling and he brought with him a love wonderful beyond all imagining. A love doomed to end too soon..."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/2039223.Winter_Study", "image": ["https://images.gr-assets.com/books/1434549679l/2039223.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  6,520\n  ratings\n"], "genres": ["Mystery", "Fiction"], "title": "Winter Study", "author": "Nevada Barr", "num_pages": "370", "awards": [], "places": ["United States of America", "Michigan"], "character_names": ["Anna Pigeon"], "language": "English", "ISBN": "0399154582", "description": ["Soon after Anna Pigeon joins the famed wolf study team of Isle Royale National Park in the middle of Lake Superior, the wolf packs begin to behave in peculiar ways. Giant wolf prints are found, and Anna spies the form of a great wolf from a surveillance plane. When a female member of the team is savaged, Anna is convinced they are being stalked, and what was once a beautiful, idyllic refuge becomes a place of unnatural occurrences and danger beyond the ordinary…"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/23346582-a-god-in-ruins", "image": ["https://images.gr-assets.com/books/1428899247l/23346582.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  41,131\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "War", "Audiobook", "Literary Fiction"], "title": "A God in Ruins", "author": "Kate Atkinson", "num_pages": "396", "awards": ["Costa Book Award for Novel (2015)", "Women's Prize for Fiction Nominee for Longlist (2016)", "Goodreads Choice Award Nominee for Historical Fiction (2015)", "Woman & Home Reader's Choice Award for Ultimate Page Turner (2016)"], "places": [], "character_names": [], "language": "English", "ISBN": "0385618719", "description": ["In ", " Ursula Todd lived through the turbulent events of the last century again and again. In ", ", Atkinson turns her focus on Ursula’s beloved younger brother Teddy – would-be poet, RAF bomber pilot, husband and father – as he navigates the perils and progress of the 20th century. For all Teddy endures in battle, his greatest challenge will be to face living in a future he never expected to have."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/213753.Life_As_We_Knew_It", "image": ["https://images.gr-assets.com/books/1328012816l/213753.jpg"], "avg_ratings": ["\n  3.89\n"], "num_reviews": ["\n  ", "\n  105,163\n  ratings\n"], "genres": ["Young Adult", "Science Fiction", "Dystopia", "Science Fiction", "Fiction"], "title": "Life As We Knew It", "author": "Susan Beth Pfeffer", "num_pages": "337", "awards": ["Buxtehuder Bulle (2010)", "South Carolina Book Award Nominee for Young Adult Book Award (2009)", "Rhode Island Teen Book Award Nominee (2008)", "Evergreen Teen Book Award (2009)", "The Inky Awards Nominee for Silver Inky (2008)", "California Young Readers Medal Nominee for Young Adult (2009)", "Andre Norton Award Nominee (2006)", "Missouri Truman Readers Award (2009)", "Missouri Gateway Readers Award Nominee (2009)", "Rebecca Caudill Young Readers' Book Award Nominee (2009)"], "places": ["Pennsylvania", "Howell, Pennsylvania"], "character_names": ["Miranda Evans", "Matt Evans", "Jonny Evans", "Laura Evans"], "language": "English", "ISBN": "0152061548", "description": ["Miranda’s disbelief turns to fear in a split second when a meteor knocks the moon closer to the earth. How should her family prepare for the future when worldwide tsunamis wipe out the coasts, earthquakes rock the continents, and volcanic ash blocks out the sun? As summer turns to Arctic winter, Miranda, her two brothers, and their mother retreat to the unexpected safe haven of their sunroom, where they subsist on stockpiled food and limited water in the warmth of a wood-burning stove.", "Told in journal entries, this is the heart-pounding story of Miranda’s struggle to hold on to the most important resource of all--hope--in an increasingly desperate and unfamiliar world."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/5971165-the-white-queen", "image": ["https://images.gr-assets.com/books/1439412993l/5971165.jpg"], "avg_ratings": ["\n  3.92\n"], "num_reviews": ["\n  ", "\n  141,831\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Historical", "Fiction"], "title": "The White Queen", "author": "Philippa Gregory", "num_pages": "408", "awards": [], "places": ["England"], "character_names": ["Elizabeth of York", "Elizabeth Woodville", "Richard III of England", "Edward IV of England", "Edward V of England", "Richard Neville, 16th Earl of Warwick", "George Plantagenet, 1st Duke of Clarence", "Cecily Neville", "Perkin Warbeck", "Jacquetta Woodville", "Anthony Woodville, 2nd Earl Rivers"], "language": "English", "ISBN": "1416563687", "description": []},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/15723977-warriors-in-winter", "image": ["https://images.gr-assets.com/books/1347014302l/15723977.jpg"], "avg_ratings": ["\n  3.81\n"], "num_reviews": ["\n  ", "\n  196\n  ratings\n"], "genres": ["Romance", "Romance", "Historical Romance", "Historical", "Historical", "Historical Fiction", "Historical", "Medieval", "Category Romance", "Harlequin"], "title": "Warriors in Winter", "author": "Michelle Willingham", "num_pages": "283", "awards": [], "places": ["Ireland"], "character_names": [], "language": "English", "ISBN": "0373297181", "description": ["Spend Christmas with your favorite warriors—the MacEgans!", "It's a year since Brianna MacEgan's husband was killed, and she remains coldly obsessed with avenging his death. But Arturo de Manzano is intent on distracting her with his muscled fighter's body—and the ice around her heart is soon in danger of melting.", "Lost in a snowstorm, Rhiannon MacEgan is rescued by a fierce Viking. Her lonely soul instantly finds its mate in Kaall, but can they ever be together? For not only is Kaall blind, he's also her beloved cousin's most hated enemy.", "Adriana de Manzano is betrothed to Liam MacEgan, a man she absolutely adores. But she's hiding a terrible secret. To save Liam's life in the Holy Land, she was forced to betray him. If she tells this proud warrior the truth, can he ever forgive her?"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/15749844-life-after-life", "image": ["https://images.gr-assets.com/books/1353240930l/15749844.jpg"], "avg_ratings": ["\n  3.75\n"], "num_reviews": ["\n  ", "\n  176,523\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Historical", "Science Fiction", "Time Travel"], "title": "Life After Life", "author": "Kate Atkinson", "num_pages": "479", "awards": ["Costa Book Award for Novel (2013)", "Tähtifantasia Award Nominee (2015)", "Women's Prize for Fiction Nominee (2013)", "Andrew Carnegie Medal Nominee for Fiction (2014)", "Walter Scott Prize Nominee (2014)", "Goodreads Choice Award for Historical Fiction (2013)", "Waterstones Book of the Year Nominee (2013)"], "places": ["England"], "character_names": ["Ursula Todd"], "language": "English", "ISBN": "0385618670", "description": ["What if you could live again and again, until you got it right? ", "On a cold and snowy night in 1910, Ursula Todd is born to an English banker and his wife. She dies before she can draw her first breath. On that same cold and snowy night, Ursula Todd is born, lets out a lusty wail, and embarks upon a life that will be, to say the least, unusual. For as she grows, she also dies, repeatedly, in a variety of ways, while the young century marches on towards its second cataclysmic world war. ", "Does Ursula's apparently infinite number of lives give her the power to save the world from its inevitable destiny? And if she can - will she?"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/15818362-into-the-darkest-corner", "image": ["https://images.gr-assets.com/books/1355923186l/15818362.jpg"], "avg_ratings": ["\n  4.10\n"], "num_reviews": ["\n  ", "\n  52,525\n  ratings\n"], "genres": ["Thriller", "Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller", "Mystery", "Crime"], "title": "Into the Darkest Corner", "author": "Elizabeth Haynes", "num_pages": "450", "awards": [], "places": ["London, England", "Lancaster, Northern England"], "character_names": ["Catherine \"Cathy\" Bailey", "Stuart Richardson", "Lee Brightman", "Sylvia Bartlett"], "language": "English", "ISBN": "0062197266", "description": ["When young, pretty Catherine Bailey meets Lee Brightman, she can't believe her luck. Gorgeous, charismatic, and a bit mysterious, Lee seems almost too perfect to be true.", "But what begins as flattering attention and spontaneous, passionate sex transforms into raging jealousy, and Catherine soon discovers that Lee's dazzling blue eyes and blond good looks hide a dark, violent nature. Disturbed by his increasingly erratic, controlling behavior, she tries to break it off; turning to her friends for support, she's stunned to find they don't believe her. Increasingly isolated and driven into the darkest corner of her world, a desperate Catherine plans a meticulous escape.", "Four years later, Lee is behind bars and Catherine—now Cathy—is trying to build a new life in a new city. Though her body has healed, the trauma of the past still haunts her. Then Stuart Richardson, her attractive new neighbor, moves in. Encouraging her to confront her fears, he sparks unexpected hope and the possibility of love and a normal life.", "Until the day the phone rings . . ."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/139987.The_Snow_Queen", "image": ["https://images.gr-assets.com/books/1320401869l/139987.jpg"], "avg_ratings": ["\n  3.76\n"], "num_reviews": ["\n  ", "\n  12,064\n  ratings\n"], "genres": ["Classics", "Fantasy", "Fiction", "Childrens", "Fantasy", "Fairy Tales", "Audiobook", "Childrens", "Picture Books", "Short Stories", "Holiday", "Christmas", "European Literature", "Danish"], "title": "The Snow Queen", "author": "Hans Christian Andersen", "num_pages": "96", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0375415122", "description": ["Reprinted here for the first time since the 19th century, these color illustrations by T. Pym make the classic Andersen fairy tale even more magical. One of Andersen's best-beloved tales, ", "is a story about the strength and endurance of childhood friendship. Gerda's search for her playmate Kay–who was abducted by the Snow Queen and taken to her frozen palace–is brought to life in delicate and evocative illustrations."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/16287487-an-apple-for-the-creature", "image": ["https://images.gr-assets.com/books/1360567859l/16287487.jpg"], "avg_ratings": ["\n  3.87\n"], "num_reviews": ["\n  ", "\n  7,299\n  ratings\n"], "genres": ["Fantasy", "Urban Fantasy", "Fantasy", "Fantasy", "Paranormal", "Anthologies", "Short Stories", "Fantasy", "Magic", "Paranormal", "Vampires"], "title": "An Apple for the Creature", "author": "Charlaine Harris", "num_pages": "609", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1410455327", "description": ["Includes a never-before-published Sookie Stackhouse story! ", "What could be scarier than the first day of school? How about a crash course in the paranormal from Charlaine Harris and Toni L. P. Kelner, editors of \"Home Improvement: Undead Edition\"? Your worst school nightmares--taking that math test you never studied for, finding yourself naked in school assembly, not knowing which door to enter--will pale in comparison to these thirteen original stories that take academic anxiety to whole new realms. ", " In #1 \"New York Times \"bestselling author Charlaine Harris's story, \"Playing Possum,\" Sookie Stackhouse brings enough birthday cupcakes for her nephew's entire class but finds she's one short when the angry ex-boyfriend of the school secretary shows up. ", " When her guardian, Kate Daniels, sends her undercover to a school for exceptional children, teenaged Julie learns an all-new definition of \"exceptional,\" in \"New York Times\" bestselling author Ilona Andrews's \"Magic Tests.\" ", " For those who like fangs with their forensics, \"New York Times \"bestselling author Nancy Holder offers \"VSI,\" in which FBI agent Claire is tested as never before in a school for Vampire Scene Investigation. ", " And in \"New York Times\" bestselling author Thomas Sniegoski's \"The Bad Hour,\" Remy Chandler and his dog Marlowe find evil unleashed in an obedience school. ", " You'll need more than an apple to stave off the creatures in these and nine other stories. Remember your first lesson: resistance is fruitless! ", " Includes stories by: ILONA ANDREWS, AMBER BENSON, RHYS BOWEN, MIKE CAREY, CHARLAINE HARRIS, DONALD HARSTAD, STEVE HOCKENSMITH, NANCY HOLDER, FAITH HUNTER, TONI L.P. KELNER, MARJORIE LIU, JONATHAN MABERRY, THOMAS SNIEGOSKI"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/2986057-the-winter-of-enchantment", "image": ["https://images.gr-assets.com/books/1347320510l/2986057.jpg"], "avg_ratings": ["\n  4.09\n"], "num_reviews": ["\n  ", "\n  96\n  ratings\n"], "genres": ["Fantasy", "Fiction", "Childrens"], "title": "The Winter of Enchantment", "author": "Victoria Walker", "num_pages": "152", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1930900333", "description": ["Through a magic mirror Sebastian travels from his Victorian world of winter snow and Mrs. Parkin to a magic world of Melissa, Mantari the cat, a wicked Enchanter, and many other exciting people. Melissa, a pretty young girl, has been imprisoned in a large house by the wicked Enchanter. Sebastian first meets Melissa through the magic mirror and resolves to do everything in his power, and with the help of a little magic, to free her. First published in 1968, this wonderful children's classic is back in hardcover!"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/37541021-the-miniaturist", "image": ["https://images.gr-assets.com/books/1523565958l/37541021.jpg"], "avg_ratings": ["\n  3.59\n"], "num_reviews": ["\n  ", "\n  93,451\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Mystery"], "title": "The Miniaturist", "author": "Jessie Burton", "num_pages": "430", "awards": ["Specsavers National Book Award for Books Are My Bag New Writer of the Year (2014)", "Walter Scott Prize Nominee (2015)", "Goodreads Choice Award Nominee for Historical Fiction (2014)", "Waterstones Book of the Year (2014)"], "places": ["Amsterdam"], "character_names": ["Petronella Brandt", "Johannes Brandt", "Cornelia", "Otto", "Marin Brandt", "Jack Philips", "Frans Meermans", "Agnes Meermans"], "language": "English", "ISBN": "1509857486", "description": ["Set in seventeenth century Amsterdam--a city ruled by glittering wealth and oppressive religion--a masterful debut steeped in atmosphere and shimmering with mystery, in the tradition of Emma Donoghue, Sarah Waters, and Sarah Dunant.", "\"There is nothing hidden that will not be revealed . . .\"", "On a brisk autumn day in 1686, eighteen-year-old Nella Oortman arrives in Amsterdam to begin a new life as the wife of illustrious merchant trader Johannes Brandt. But her new home, while splendorous, is not welcoming. Johannes is kind yet distant, always locked in his study or at his warehouse office--leaving Nella alone with his sister, the sharp-tongued and forbidding Marin.", "But Nella's world changes when Johannes presents her with an extraordinary wedding gift: a cabinet-sized replica of their home. To furnish her gift, Nella engages the services of a miniaturist--an elusive and enigmatic artist whose tiny creations mirror their real-life counterparts in eerie and unexpected ways . . .", "Johannes' gift helps Nella to pierce the closed world of the Brandt household. But as she uncovers its unusual secrets, she begins to understand--and fear--the escalating dangers that await them all. In this repressively pious society where gold is worshipped second only to God, to be different is a threat to the moral fabric of society, and not even a man as rich as Johannes is safe. Only one person seems to see the fate that awaits them. Is the miniaturist the key to their salvation . . . or the architect of their destruction?", "Enchanting, beautiful, and exquisitely suspenseful, ", " is a magnificent story of love and obsession, betrayal and retribution, appearance and truth."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/30634833-the-birdman-s-wife", "image": ["https://images.gr-assets.com/books/1470274767l/30634833.jpg"], "avg_ratings": ["\n  3.70\n"], "num_reviews": ["\n  ", "\n  586\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Cultural", "Australia"], "title": "The Birdman's Wife", "author": "Melissa Ashley", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1925344991", "description": ["Inspired by a letter found tucked inside her famous husband’s papers, ", " imagines the fascinating inner life of Elizabeth Gould, who was so much more than just the woman behind the man.", "Elizabeth was a woman ahead of her time, juggling the demands of her artistic life with her roles as wife, lover and helpmate to a passionate and demanding genius, and as a devoted mother who gave birth to eight children. In a society obsessed with natural history and the discovery of new species, the birdman’s wife was at its glittering epicentre. Her artistry breathed life into hundreds of exotic finds, from her husband’s celebrated collections to Charles Darwin’s famous Galapagos finches.", "Fired by Darwin’s discoveries, in 1838 Elizabeth defied convention by joining John on a trailblazing expedition to the untamed wilderness of Van Diemen’s Land and New South Wales to collect and illustrate Australia’s ‘curious’ birdlife.", "From a naïve and uncertain young girl to a bold adventurer determined to find her own voice and place in the world, ", " paints an indelible portrait of an extraordinary woman overlooked by history, until now."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/32600721-the-cottingley-secret", "image": ["https://images.gr-assets.com/books/1499439852l/32600721.jpg"], "avg_ratings": ["\n  3.85\n"], "num_reviews": ["\n  ", "\n  4,223\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Fantasy", "Historical", "Magical Realism"], "title": "The Cottingley Secret", "author": "Hazel Gaynor", "num_pages": "383", "awards": [], "places": ["Howth", "Yorkshire, England", "Cottingley, Bradford, West Yorkshire, England"], "character_names": [], "language": "English", "ISBN": "006249984X", "description": ["The author of ", "turns the clock back one hundred years to a time when two young girls from Cottingley, Yorkshire, convinced the world that they had done the impossible and photographed fairies in their garden. Now, in her newest novel, international bestseller Hazel Gaynor reimagines their story.", "… It was inexplicable, impossible, but it had to be true—didn’t it? When two young cousins, Frances Griffiths and Elsie Wright from Cottingley, England, claim to have photographed fairies at the bottom of the garden, their parents are astonished. But when one of the great novelists of the time, Sir Arthur Conan Doyle, becomes convinced of the photographs’ authenticity, the girls become a national sensation, their discovery offering hope to those longing for something to believe in amid a world ravaged by war. Frances and Elsie will hide their secret for many decades. But Frances longs for the truth to be told.", "… When Olivia Kavanagh finds an old manuscript in her late grandfather’s bookshop she becomes fascinated by the story it tells of two young girls who mystified the world. But it is the discovery of an old photograph that leads her to realize how the fairy girls’ lives intertwine with hers, connecting past to present, and blurring her understanding of what is real and what is imagined. As she begins to understand why a nation once believed in fairies, can Olivia find a way to believe in herself?"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/30231547-anne-boleyn", "image": ["https://images.gr-assets.com/books/1495124659l/30231547.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  3,317\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Historical", "Fiction", "English History", "Tudor Period"], "title": "Anne Boleyn: A King's Obsession", "author": "Alison Weir", "num_pages": "529", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1472227638", "description": ["It is the spring of 1527. Henry VIII has come to Hever Castle in Kent to pay court to Anne Boleyn. He is desperate to have her. For this mirror of female perfection he will set aside his Queen and all Cardinal Wolsey’s plans for a dynastic French marriage.", "Anne Boleyn is not so sure. She loathes Wolsey for breaking her betrothal to the Earl of Northumberland’s son, Harry Percy, whom she had loved. She does not welcome the King’s advances; she knows that she can never give him her heart.", "But hers is an opportunist family. And whether Anne is willing or not, they will risk it all to see their daughter on the throne…"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/31742324-seven-days-in-may", "image": ["https://images.gr-assets.com/books/1490043726l/31742324.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  751\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "War", "World War I", "Romance"], "title": "Seven Days in May", "author": "Kim Izzo", "num_pages": "356", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1443453498", "description": ["As the First World War rages in continental Europe, two New York heiresses, Sydney and Brooke Sinclair, are due to set sail for England. Brooke is engaged to marry impoverished aristocrat Edward Thorpe-Tracey, the future Lord Northbrook, in ", " wedding of the social calendar. Sydney has other adventures in mind; she is drawn to the burgeoning suffragette movement, which is a constant source of embarrassment to her proper sister. As international tempers flare, the German embassy releases a warning that any ships making the Atlantic crossing are at risk. Undaunted, Sydney and Brooke board the ", " for the seven-day voyage with Edward, not knowing that disaster lies ahead.", "In London, Isabel Nelson, a young woman grateful to have escaped her blemished reputation in Oxford, has found employment at the British Admiralty in the mysterious Room 40. While she begins as a secretary, it isn’t long before her skills in codes and cyphers are called on, and she learns a devastating truth and the true cost of war.", "As the days of the voyage pass, these four lives collide in a struggle for survival as the ", " meets its deadly fate."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/10966007-the-help", "image": ["https://images.gr-assets.com/books/1303597269l/10966007.jpg"], "avg_ratings": ["\n  4.46\n"], "num_reviews": ["\n  ", "\n  1,830,823\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Historical", "Adult"], "title": "The Help", "author": "Kathryn Stockett", "num_pages": "534", "awards": ["Orange Prize Nominee for Fiction Longlist (2010)", "Audie Award for Fiction (2010)", "Exclusive Books Boeke Prize (2009)", "SIBA Book Award for Fiction (2010)", "Indies Choice Book Award for Adult Debut (2010)", "Puddly Award for Fiction (2011)", "Lincoln Award Nominee (2013)", "Grand Prix des lectrices de Elle for roman (2011)", "Goodreads Choice Award for Fiction (2009) and Nominee for Best of the Best  (2018)", "Townsend Prize for Fiction (2010)"], "places": ["Jackson, Mississippi", "Jackson, Mississippi", "Mississippi"], "character_names": ["Constantine Bates", "Eugenia “Skeeter” Phelan", "Aibileen Clark", "Minny Jackson", "Hilly Holbrook", "Elizabeth Leefolt", "Celia Foote", "Stuart Whitworth", "Mae Mobley Leefolt", "Leroy Jackson", "Elaine Stein", "Yule May Crookle", "Johnny Foote", "William Holbrook", "Senator “Stoolie” Whitworth", "Pascagoula", "Treelore Clark"], "language": "English", "ISBN": "0425245136", "description": ["Three ordinary women are about to take one extraordinary step.", " Twenty-two-year-old Skeeter has just returned home after graduating from Ole Miss. She may have a degree, but it is 1962, Mississippi, and her mother will not be happy till Skeeter has a ring on her finger. Skeeter would normally find solace with her beloved maid Constantine, the woman who raised her, but Constantine has disappeared and no one will tell Skeeter where she has gone.", " Aibileen is a black maid, a wise, regal woman raising her seventeenth white child. Something has shifted inside her after the loss of her own son, who died while his bosses looked the other way. She is devoted to the little girl she looks after, though she knows both their hearts may be broken.", " Minny, Aibileen’s best friend, is short, fat, and perhaps the sassiest woman in Mississippi. She can cook like nobody’s business, but she can’t mind her tongue, so she’s lost yet another job. Minny finally finds a position working for someone too new to town to know her reputation. But her new boss has secrets of her own.", " Seemingly as different from one another as can be, these women will nonetheless come together for a clandestine project that will put them all at risk. And why? Because they are suffocating within the lines that define their town and their times. And sometimes lines are made to be crossed.", " In pitch-perfect voices, Kathryn Stockett creates three extraordinary women whose determination to start a movement of their own forever changes a town, and the way women—mothers, daughters, caregivers, friends—view one another. A deeply moving novel filled with poignancy, humor, and hope, ", " is a timeless and universal story about the lines we abide by, and the ones we don’t."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/8492776-the-remains-of-the-day", "image": ["https://images.gr-assets.com/books/1451444285l/8492776.jpg"], "avg_ratings": ["\n  4.11\n"], "num_reviews": ["\n  ", "\n  161,183\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Classics", "Literature", "Literary Fiction", "Historical"], "title": "The Remains of the Day", "author": "Kazuo Ishiguro", "num_pages": "258", "awards": ["Man Booker Prize (1989)"], "places": ["England"], "character_names": ["James Stevens", "Miss Kenton", "Lord Darlington", "Mr. Farraday", "Reginald Cardinal", "Dupont", "William Stevens", "Senator Lewis"], "language": "English", "ISBN": "0571258247", "description": []},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/25227669-at-the-water-s-edge", "image": ["https://images.gr-assets.com/books/1427437015l/25227669.jpg"], "avg_ratings": ["\n  3.66\n"], "num_reviews": ["\n  ", "\n  64,477\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical", "Cultural", "Scotland"], "title": "At the Water's Edge", "author": "Sara Gruen", "num_pages": "368", "awards": ["Goodreads Choice Award Nominee for Historical Fiction (2015)"], "places": ["Scottish Highlands"], "character_names": ["Maddie Hyde", "Ellis Hyde"], "language": "English", "description": ["After embarrassing themselves at the social event of the year in high society Philadelphia on New Year’s Eve of 1942, Maddie and Ellis Hyde are cut off financially by Ellis’s father, a former army Colonel who is already embarrassed by his son’s inability to serve in WWII due to his being colorblind. To Maddie’s horror, Ellis decides that the only way to regain his father’s favor is to succeed in a venture his father attempted and very publicly failed at: he will hunt the famous Loch Ness monster and when he finds it he will restore his father’s name and return to his father’s good graces (and pocketbook). Joined by their friend Hank, a wealthy socialite, the three make their way to Scotland in the midst of war. Each day the two men go off to hunt the monster, while another monster, Hitler, is devastating Europe. And Maddie, now alone in a foreign country, must begin to figure out who she is and what she wants. The novel tells of Maddie’s social awakening: to the harsh realities of life, to the beauties of nature, to a connection with forces larger than herself, to female friendship, and finally, to love."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/20826683-all-the-light-we-cannot-see", "image": ["https://images.gr-assets.com/books/1392633807l/20826683.jpg"], "avg_ratings": ["\n  4.33\n"], "num_reviews": ["\n  ", "\n  754,306\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "War"], "title": "All the Light We Cannot See", "author": "Anthony Doerr", "num_pages": "544", "awards": ["Pulitzer Prize for Fiction (2015)", "Audie Award for Fiction (2015)", "ALA Alex Award (2015)", "Dayton Literary Peace Prize for Fiction (Runner-Up) (2015)", "Ohioana Book Award for Fiction (2015)", "Andrew Carnegie Medal for Fiction (2015)", "Idaho Book of the Year Award (2014)", "National Book Award Finalist for Fiction (2014)", "Goodreads Choice Award for Historical Fiction (2014) and Nominee for Best of the Best  (2018)", "International DUBLIN Literary Award Nominee (2016)"], "places": ["Paris", "Saint Malo", "Zollverein"], "character_names": ["Werner Pfennig", "Marie-Laure LeBlanc", "Frank Volkheimer", "Etienne LeBlanc", "Frederick (All the Light We Cannot See)", "Jutta Pfennig", "Madame Manec", "Reinhold von Rumpel", "Frau Elena", "Daniel LeBlanc", "Dr. Hauptmann", "Walter Bernd", "Bastian"], "language": "English", "ISBN": "0007548672", "description": []},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/28591881-flight-of-dreams", "image": ["https://images.gr-assets.com/books/1453075235l/28591881.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  4,042\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Mystery"], "title": "Flight of Dreams", "author": "Ariel Lawhon", "num_pages": "304", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1925344649", "description": ["On the evening of May 3rd, 1937, ninety-seven people board the Hindenburg for its final, doomed flight to Lakehurst, New Jersey. Among them are a frightened stewardess who is not what she seems; the steadfast navigator determined to win her heart; a naive cabin boy eager to earn a permanent spot on the world’s largest airship; an impetuous journalist who has been blacklisted in her native Germany; and an enigmatic American businessman with a score to settle. Over the course of three hazy, champagne-soaked days their lies, fears, agendas, and hopes for the future are revealed.", " ", " is a fiercely intimate portrait of the real people on board the last flight of the Hindenburg. Behind them is the gathering storm in Europe and before them is looming disaster. But for the moment they float over the Atlantic, unaware of the inexorable, tragic fate that awaits them.", "Brilliantly exploring one of the most enduring mysteries of the twentieth century, ", " is that rare novel with spellbinding plotting that keeps you guessing till the last page and breathtaking emotional intensity that stays with you long after."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/24358244-at-the-edge-of-the-orchard", "image": ["https://images.gr-assets.com/books/1447379582l/24358244.jpg"], "avg_ratings": ["\n  3.62\n"], "num_reviews": ["\n  ", "\n  13,751\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Audiobook"], "title": "At the Edge of the Orchard", "author": "Tracy Chevalier", "num_pages": "292", "awards": [], "places": ["Ohio", "California"], "character_names": ["John Chapman", "James Goodenough", "Sadie Goodenough", "Robert Goodenough", "William Lobb"], "language": "English", "ISBN": "0007350392", "description": ["From internationally bestselling author Tracy Chevalier, a riveting drama of a pioneer family on the American frontier", "1838: James and Sadie Goodenough have settled where their wagon got stuck - in the muddy, stagnant swamps of northwest Ohio. They and their five children work relentlessly to tame their patch of land, buying saplings from a local tree man known as John Appleseed so they can cultivate the fifty apple trees required to stake their claim on the property. But the orchard they plant sows the seeds of a long battle. James loves the apples, reminders of an easier life back in Connecticut; while Sadie prefers the applejack they make, an alcoholic refuge from brutal frontier life.", "1853: Their youngest child Robert is wandering through Gold Rush California. Restless and haunted by the broken family he left behind, he has made his way alone across the country. In the redwood and giant sequoia groves he finds some solace, collecting seeds for a naturalist who sells plants from the new world to the gardeners of England. But you can run only so far, even in America, and when Robert's past makes an unexpected appearance he must decide whether to strike out again or stake his own claim to a home at last.", "Chevalier tells a fierce, beautifully crafted story in ", ", her most graceful and richly imagined work yet."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/13131900-the-romanov-conspiracy", "image": ["https://images.gr-assets.com/books/1344663428l/13131900.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  1,933\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Thriller", "Cultural", "Russia", "Mystery", "Historical"], "title": "The Romanov Conspiracy", "author": "Glenn Meade", "num_pages": "515", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1451611862", "description": [" ", " ", "Dr. Laura Pavlov, an American forensic archaeologist, is about to unravel a mystery that promises to shed light on one of the 20th century’s greatest enigmas. ", "A member of an international team digging on the outskirts of the present-day Russian city of Ekaterinburg, where the Romanov royal family was executed in July 1918, Pavlov discovers a body perfectly preserved in the permafrost of a disused mine shaft. ", "The remains offer dramatic new clues to the disappearance of the Romanovs, and in particular their famous daughter, Princess Anastasia, whose murder has always been in question. Pavlov’s discovery sets her on an unlikely journey to Ireland, where a carefully hidden account of a years-old covert mission is about to change the accepted course of world history and hurl her back into the past—into a maelstrom of deceit, secrets, and lies. ", "Drawn from historical fact, ", "is a high-tension story of love and friendship tested by war, and a desperate battle between revenge and redemption, set against one of the most bloody and brutal revolutions in world history."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/3143249-in-a-far-country", "image": ["https://images.gr-assets.com/books/1335727660l/3143249.jpg"], "avg_ratings": ["\n  4.05\n"], "num_reviews": ["\n  ", "\n  476\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Romance"], "title": "In a Far Country", "author": "Linda Holeman", "num_pages": "512", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0755331885", "description": ["Pree Fincastle, daughter of impoverished British missionaries in India, is left alone and destitute when tragedy strikes. She embarks on a journey in search of Kai, the son of her mother's ayah, and the only person she can trust. But Kai is not the man Pree thought he was, and the secrets he holds will unlock the door to another world, another time - and, shockingly, another life. From the whispering Ravi River to the hidden heart of the Peshawar, this is a story of penury and prostitution, tragedy and bloodshed, secrets and love. But ultimately it is a story of hope; a story that, once read, will never be forgotten..."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/15797005-the-romanov-cross", "image": ["https://images.gr-assets.com/books/1344371975l/15797005.jpg"], "avg_ratings": ["\n  3.88\n"], "num_reviews": ["\n  ", "\n  2,034\n  ratings\n"], "genres": ["Thriller", "Historical", "Historical Fiction", "Fiction", "Mystery", "Cultural", "Russia", "Thriller", "Mystery Thriller", "Suspense"], "title": "The Romanov Cross", "author": "Robert Masello", "num_pages": "495", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0553807803", "description": ["Army epidemiologist Frank Slater is facing a court-martial, but after his punishment is mysteriously lifted, Slater is offered a job no one else wants—to travel to a small island off the coast of Alaska and investigate a potentially lethal phenomenon: The permafrost has begun to melt, exposing bodies from a colony that was wiped out by the dreaded Spanish flu of 1918. Frank must determine if the thawed remains still carry the deadly virus in their frozen flesh and, if so, ensure that it doesn’t come back to life.", "Frank and his handpicked team arrive by helicopter, loaded down with high-tech tools, prepared to exhume history. The colony, it transpires, was once settled by a sect devoted to the mad Russian monk Rasputin, but there is even more hiding in the past than Frank’s team is aware of. Any hope of success hinges on their willingness to accept the fact that even their cutting-edge science has its limits—and that the ancient wisdom of the Inuit people who once inhabited this eerie land is as essential as any serum. By the time Frank discovers that his mission has been compromised—crashed by a gang of reckless treasure hunters—he will be in a brutal race against time. With a young, strong-willed Inuit woman by his side, Frank must put a deadly genie back in the bottle before all of humanity pays the price.", " is at once an alternate take on one of history’s most profound mysteries, a love story as unlikely as it is inevitable, and a thriller of heart-stopping, supernatural suspense. With his signature blend of fascinating history and fantastic imagination, critically acclaimed author Robert Masello has once again crafted a terrifying story of past events coming back to haunt the present day . . . and of dark deeds aching to be unearthed.", " “In this fascinating, funny, and frightening supernatural thriller, [Robert] Masello skillfully weaves together the story of the deaths of the Russian royal family with the possibility of a new worldwide influenza pandemic. . . . Toss in a pack of slavering wolves, the undead, and a chilling ending, and the result is a terrific, can’t-put-it-down read. Fine prose and plotting help solidify Masello’s position at the top of this crowded subgenre.”—", " “A former Army epidemiologist contends with greedy locals and the harsh Alaskan terrain in order to prevent the recurrence of a deadly pandemic. . . . Masello weaves several disparate genres—medical thriller, historical novel, ghost story—into a coherent whole. A delicious sense of creeping dread permeates the first act, greatly enhanced by its setting in the stark but beautiful landscape of northwestern Alaska. . . . Tense, taut and impossible to put down.”—", "(starred review)"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/670377.The_Black_Velvet_Gown", "image": ["https://images.gr-assets.com/books/1279592428l/670377.jpg"], "avg_ratings": ["\n  3.99\n"], "num_reviews": ["\n  ", "\n  1,208\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Romance", "Fiction", "Historical"], "title": "The Black Velvet Gown", "author": "Catherine Cookson", "num_pages": "356", "awards": [], "places": ["Durham, England"], "character_names": [], "language": "English", "ISBN": "0671682539", "description": ["There would be times when Riah Millican came to regret that her husband had learned to read and write, and then shared his knowledge with her and their children. For this was Durham in the 1830's, when employers tended to regard the spread of education with suspicion. But now Seth Millican was dead and she was a widow with the need to find a home and a living for herself and her children.", "The chance of becoming a housekeeper didn't work out, but it led to Moor House and a scholarly recluse obsessed with that very book learning that could open so many doors and yet create so many problems; especially with her daughter, Biddy, who was not only bright, but witful...", "THE BLACK VELVET GOWN is the story of a mother and daughter, often at odds with each other, facing the need to challenge and fight the prejudice of an age\u0097a narrative of great power and diversity that is one of Catherine Cookson's major achievements."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/365460.The_Stranger_House", "image": ["https://images.gr-assets.com/books/1320402882l/365460.jpg"], "avg_ratings": ["\n  3.74\n"], "num_reviews": ["\n  ", "\n  1,166\n  ratings\n"], "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "The Stranger House", "author": "Reginald Hill", "num_pages": "544", "awards": [], "places": ["Illthwaite"], "character_names": ["Samantha Flood", "Miguel Madero"], "language": "English", "ISBN": "0770429890", "description": ["A stunning new psychological thriller set in past and present-day Cumbria from the award-winning author of the Dalziel and Pascoe series.", "Things move slowly in the tiny village of Illthwaite, but that’s about to change with the arrival of two strangers. Sam Flood is a young Australian post-grad en route to Cambridge. Miguel Madero is a Spanish historian in flight from a seminary. They have nothing in common and no connection, except that they both want to dig up bits of the past that some people would rather keep buried. Sam is looking for information about her grandmother who left Illthwaite courtesy of the child migrant scheme four decades earlier. The past Mig is interested in is more than four centuries old.", "They meet in the village pub, the Stranger House, a remnant of the old Illthwaite Priory. They can find nothing to agree on. Sam believes that anything that can’t be explained by math isn’t worth explaining; Mig sees ghosts; Sam is a fun-loving, experienced young woman; Mig is a 26-year-old virgin. But once their paths cross, they become increasingly entangled as they pursue what at first seem to be separate quests, finding out the hard way who to trust and who to fear in this ancient village.", "The action is fast, there are clashes physical and metaphysical, and shocks natural and supernatural, as the tension mounts to an explosive climax. But fans of Reginald Hill’s will not be surprised to find a few laughs along the way. And very loyal fans might even recognize a ghost from the very distant past. . . ."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/10835994-cross-currents", "image": ["https://images.gr-assets.com/books/1311704301l/10835994.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  467\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Asia"], "title": "Cross Currents", "author": "John Shors", "num_pages": "322", "awards": [], "places": ["Thailand"], "character_names": [], "language": "English", "ISBN": "045123460X", "description": ["Thailand's pristine Ko Phi Phi island attracts tourists from around the world. There, struggling to make ends meet, small-resort owners Lek and Sarai are happy to give an American named Patch room and board in exchange for his help. But when Patch's brother, Ryan, arrives, accompanied by his girlfriend, Brooke, Lek learns that Patch is running from the law, and his presence puts Lek's family at risk. Meanwhile, Brooke begins to doubt her love for Ryan while her feelings for Patch blossom.In a landscape where nature's bounty seems endless, these two families are swept up in an approaching cataclysm that will require all their strength of heart and soul to survive..."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/15808466-temple-of-a-thousand-faces", "image": ["https://images.gr-assets.com/books/1348172330l/15808466.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  1,155\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "Asia", "Historical"], "title": "Temple of a Thousand Faces", "author": "John Shors", "num_pages": "544", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0451239172", "description": [" When his land is taken by force, Prince Jayavar of the Khmer people narrowly escapes death at the hands of the conquering Cham king. Exiled from their homeland, he and his mystical wife Ajadevi set up a secret camp in the jungle with the intention of amassing an army bold enough to reclaim their kingdom and free their people. Meanwhile, Cham King Indravarman rules with an iron fist, pitting even his most trusted men against each other and squashing any hint of rebellion.", " Moving from a poor fisherman's family whose sons find the courage to take up arms against their oppressors, to a beautiful bride who becomes a prize of war, to an ambitious warrior whose allegiance is torn--", " is an unforgettable saga of love, betrayal, and survival at any cost.", " READERS GUIDE INCLUDED"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/6457081-remarkable-creatures", "image": ["https://images.gr-assets.com/books/1327161912l/6457081.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  37,487\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "European Literature", "British Literature", "Literature", "19th Century"], "title": "Remarkable Creatures", "author": "Tracy Chevalier", "num_pages": "352", "awards": [], "places": ["Lyme Regis, England"], "character_names": ["Mary Anning", "Elizabeth Philpot", "William Buckland", "Captain Birch", "Cuvier"], "language": "English", "ISBN": "0007178379", "description": ["In 1810, a sister and brother uncover the fossilized skull of an unknown animal in the cliffs on the south coast of England. With its long snout and prominent teeth, it might be a crocodile – except that it has a huge, bulbous eye.", " is the story of Mary Anning, who has a talent for finding fossils, and whose discovery of ancient marine reptiles such as that ichthyosaur shakes the scientific community and leads to new ways of thinking about the creation of the world.", "Working in an arena dominated by middle-class men, however, Mary finds herself out of step with her working-class background. In danger of being an outcast in her community, she takes solace in an unlikely friendship with Elizabeth Philpot, a prickly London spinster with her own passion for fossils.", "The strong bond between Mary and Elizabeth sees them through struggles with poverty, rivalry and ostracism, as well as the physical dangers of their chosen obsession. It reminds us that friendship can outlast storms and landslides, anger and jealousy."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/17157640-the-last-runaway", "image": ["https://images.gr-assets.com/books/1355973031l/17157640.jpg"], "avg_ratings": ["\n  3.80\n"], "num_reviews": ["\n  ", "\n  26,892\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Adult Fiction"], "title": "The Last Runaway", "author": "Tracy Chevalier", "num_pages": "343", "awards": ["Goodreads Choice Award Nominee for Historical Fiction (2013)"], "places": ["Faithwell, Ohio"], "character_names": ["Honor Bright Haymaker", "Donovan Mills", "Mrs. Reed", "Belle Mills", "Jack Haymaker"], "language": "English", "ISBN": "0007350341", "description": ["When modest Quaker Honor Bright sails from Bristol with her sister, she is fleeing heartache for a new life in America, far from home. But tragedy leaves her alone and vulnerable, torn between two worlds and dependent on the kindness of strangers.", "Life in 1850s Ohio is precarious and unsentimental. The sun is too hot, the thunderstorms too violent, the snow too deep. The roads are spattered with mud and spit. The woods are home to skunks and porcupines and raccoons. They also shelter slaves escaping north to freedom.", "Should Honor hide runaways from the ruthless men who hunt them down? The Quaker community she has joined may oppose slavery in principle, but does it have the courage to help her defy the law? As she struggles to find her place and her voice, Honor must decide what she is willing to risk for her beliefs.", "Set in the tangled forests and sunlit cornfields of Ohio, Tracy Chevalier′s vivid novel is the story of bad men and spirited women, surprising marriages and unlikely friendships, and the remarkable power of defiance."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/13457428-secrets-of-the-tides", "image": ["https://images.gr-assets.com/books/1328674508l/13457428.jpg"], "avg_ratings": ["\n  3.76\n"], "num_reviews": ["\n  ", "\n  3,092\n  ratings\n"], "genres": ["Fiction", "Womens Fiction", "Chick Lit", "Contemporary", "Family", "Drama", "Mystery", "Adult", "Romance", "Historical", "Historical Fiction", "Womens Fiction"], "title": "Secrets of the Tides", "author": "Hannah Richell", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["The Tides are a family with dark secrets. Haunted by the events of one tragic day ten years ago, they are each, in their own way, struggling to move forwards with their lives.Dora, the youngest daughter, lives in a ramshackle East End warehouse with her artist boyfriend Dan. Dora is doing a good job of skating across the surface of her life - but when she discovers she is pregnant the news leaves her shaken and staring back at the darkness of a long-held guilt.Returning to Clifftops, the rambling family house perched high on the Dorset coastline, Dora must confront her past. Clifftops hasn't changed in years and moving through its rooms and gardens, Dora can still feel the echo of that terrible summer's day when life changed forever for the Tides.As Dora begins her search for clues surrounding the events of that fateful day, she comes to realise that the path to redemption may rest with her troubled sister, Cassie. If Dora can unlock the secrets Cassie swore she would take to her grave, just maybe she will have a shot at salvation.But can long-held secrets ever really be forgiven? And even if you do manage to forgive and forget, how do you ever allow yourself to truly love again?A stunningly powerful debut of family secrets, grief and forgiveness."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/1103.Snow_Flower_and_the_Secret_Fan", "image": ["https://images.gr-assets.com/books/1327880508l/1103.jpg"], "avg_ratings": ["\n  4.06\n"], "num_reviews": ["\n  ", "\n  316,158\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "China", "Historical", "Cultural", "Asia"], "title": "Snow Flower and the Secret Fan", "author": "Lisa See", "num_pages": "269", "awards": ["California Book Award for Fiction (Silver) (2005)", "Lincoln Award Nominee (2008)", "Asian/Pacific American Award for Literature for Adult Fiction Honor (2005)"], "places": ["Hunan"], "character_names": ["Snowflower", "Lily"], "language": "English", "ISBN": "0812968069", "description": ["In nineteenth-century China, in a remote Hunan county, a girl named Lily, at the tender age of seven, is paired with a laotong, “old same,” in an emotional match that will last a lifetime. The laotong, Snow Flower, introduces herself by sending Lily a silk fan on which she’s painted a poem in nu shu, a unique language that Chinese women created in order to communicate in secret, away from the influence of men.", "As the years pass, Lily and Snow Flower send messages on fans, compose stories on handkerchiefs, reaching out of isolation to share their hopes, dreams, and accomplishments. Together, they endure the agony of foot-binding, and reflect upon their arranged marriages, shared loneliness, and the joys and tragedies of motherhood. The two find solace, developing a bond that keeps their spirits alive. But when a misunderstanding arises, their deep friendship suddenly threatens to tear apart."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/23164931-time-and-time-again", "image": ["https://images.gr-assets.com/books/1411333773l/23164931.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  7,400\n  ratings\n"], "genres": ["Science Fiction", "Time Travel", "Historical", "Historical Fiction", "Science Fiction", "Fiction", "Fantasy", "Historical"], "title": "Time and Time Again", "author": "Ben Elton", "num_pages": "386", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0593073576", "description": ["It’s the 1st of June 1914 and Hugh Stanton, ex-soldier and celebrated adventurer is quite literally the loneliest man on earth. No one he has ever known or loved has been born yet. Perhaps now they never will be.", "Stanton knows that a great and terrible war is coming. A collective suicidal madness that will destroy European civilization and bring misery to millions in the century to come. He knows this because, for him, that century is already history.", "Somehow he must change that history. He must prevent the war. A war that will begin with a single bullet. But can a single bullet truly corrupt an entire century?", "And, if so, could another single bullet save it?"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/6061360-below-zero", "image": ["https://images.gr-assets.com/books/1442875874l/6061360.jpg"], "avg_ratings": ["\n  4.14\n"], "num_reviews": ["\n  ", "\n  7,363\n  ratings\n"], "genres": ["Mystery", "Fiction", "Thriller", "Mystery", "Crime", "Westerns"], "title": "Below Zero", "author": "C.J. Box", "num_pages": "342", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0399155759", "description": ["Wyoming game warden Joe Pickett's teenage daughter, Sheridan, receives a text message with a staggering implication: that April, the foster daughter thought to have died 6 years ago in a massacre, is still alive. If it really is April who's texting, she's in danger, and for Pickett, the only thing worse than losing her the first time would be losing her again. Pickett must negotiate FBI politics, recruit his fugitive friend Nate Romanowski, and take a crash course in cell-phone-tracking technology to find her."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/20653779-november-rain", "image": ["https://images.gr-assets.com/books/1421890309l/20653779.jpg"], "avg_ratings": ["\n  3.73\n"], "num_reviews": ["\n  ", "\n  79\n  ratings\n"], "genres": ["Mystery"], "title": "November Rain", "author": "Donald Harstad", "num_pages": "306", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "161129049X", "description": ["Carl Houseman, the deputy sheriff of rural Nation County, Iowa, leaves home to enter the world of international intrigue in the sixth in Donald Harstad's critically acclaimed series.", "Houseman's daughter, Jane, has been studying abroad in the UK. When her best friend Emma Schiller has been kidnapped, Houseman, desperate to protect his daughter and help her friend, accepts Scotland Yard's invitation to take him on as a consultant.", "Emma's trail leads to the door of her former professor--and ex-lover--Dr. Robert Northwood, whose impassioned activism on behalf of a pair of Muslim political prisoners has landed him unwittingly in cahoots with a cadre of dangerous individuals. It seems like a simple hoax, except that if Houseman doesn't track down the professor's co-conspirators, the consequences will be anything but simple--and the harm that will result could be global"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/40440.The_Thirteenth_Tale", "image": ["https://images.gr-assets.com/books/1346267826l/40440.jpg"], "avg_ratings": ["\n  3.95\n"], "num_reviews": ["\n  ", "\n  245,705\n  ratings\n"], "genres": ["Fiction", "Mystery", "Historical", "Historical Fiction", "Gothic", "Writing", "Books About Books"], "title": "The Thirteenth Tale", "author": "Diane Setterfield", "num_pages": "406", "awards": ["Dilys Award Nominee (2007)", "ALA Alex Award (2007)", "The Quill Award for Debut Author (2007)"], "places": ["Angelfield"], "character_names": ["Margaret Lea", "Emmeline March", "Adeline March", "Vida Winter", "Aurelius Love"], "language": "English", "ISBN": "0743298020", "description": ["All children mythologize their birth...So begins the prologue of reclusive author Vida Winter's collection of stories, which are as famous for the mystery of the missing thirteenth tale as they are for the delight and enchantment of the twelve that do exist. ", "The enigmatic Winter has spent six decades creating various outlandish life histories for herself -- all of them inventions that have brought her fame and fortune but have kept her violent and tragic past a secret. Now old and ailing, she at last wants to tell the truth about her extraordinary life. She summons biographer Margaret Lea, a young woman for whom the secret of her own birth, hidden by those who loved her most, remains an ever-present pain. Struck by a curious parallel between Miss Winter's story and her own, Margaret takes on the commission. ", "As Vida disinters the life she meant to bury for good, Margaret is mesmerized. It is a tale of gothic strangeness featuring the Angelfield family, including the beautiful and willful Isabelle, the feral twins Adeline and Emmeline, a ghost, a governess, a topiary garden and a devastating fire. ", "Margaret succumbs to the power of Vida's storytelling but remains suspicious of the author's sincerity. She demands the truth from Vida, and together they confront the ghosts that have haunted them while becoming, finally, transformed by the truth themselves. ", "The Thirteenth Tale is a love letter to reading, a book for the feral reader in all of us, a return to that rich vein of storytelling that our parents loved and that we loved as children. Diane Setterfield will keep you guessing, make you wonder, move you to tears and laughter and, in the end, deposit you breathless yet satisfied back upon the shore of your everyday life."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/7126.The_Count_of_Monte_Cristo", "image": ["https://images.gr-assets.com/books/1309203605l/7126.jpg"], "avg_ratings": ["\n  4.23\n"], "num_reviews": ["\n  ", "\n  664,181\n  ratings\n"], "genres": ["Classics", "Fiction", "Historical", "Historical Fiction", "Adventure", "Literature", "Cultural", "France", "Historical", "Classics", "Classic Literature", "Novels", "Romance"], "title": "The Count of Monte Cristo", "author": "Alexandre Dumas", "num_pages": "1276", "awards": [], "places": ["Marseille (Marseilles)", "Montecristo", "Marseille (Marseilles)", "Montecristo", "Rome", "Paris", "France"], "character_names": ["Edmond Dantès", "Abbé Faria", "Giovanni Bertuccio", "Luigi Vampa", "Haydée", "Mercédès Mondego", "Fernand Mondego", "Albert de Morcerf", "Baron Danglars", "Gérard de Villefort", "Valentine de Villefort", "Noirtier de Villefort", "Héloïse de Villefort", "Pierre Morrel", "Maximilien Morrel", "Beauchamp", "Franz d'Épinay", "Lucien Debray", "Eugénie Danglars", "Hermine Danglars", "Benedetto", "Kadrus (tailor,neighboring)"], "language": "English", "ISBN": "0140449264", "description": ["In 1815 Edmond Dantès, a young and successful merchant sailor who has just recently been granted the succession of his erstwhile captain Leclère, returns to Marseille to marry his Catalan fiancée Mercédès. Thrown in prison for a crime he has not committed, Edmond Dantès is confined to the grim fortress of If. There he learns of a great hoard of treasure hidden on the Isle of Monte Cristo and he becomes determined not only to escape, but also to unearth the treasure and use it to plot the destruction of the three men responsible for his incarceration."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/45020.Shakespeare_s_Landlord", "image": ["https://images.gr-assets.com/books/1388270110l/45020.jpg"], "avg_ratings": ["\n  3.76\n"], "num_reviews": ["\n  ", "\n  23,901\n  ratings\n"], "genres": ["Mystery", "Fiction", "Mystery", "Cozy Mystery", "Mystery", "Crime"], "title": "Shakespeare's Landlord", "author": "Charlaine Harris", "num_pages": "216", "awards": [], "places": ["Arkansas", "Shakespeare, Arkansas"], "character_names": ["Lily Bard", "Marshall Sedaka", "Pardon Alby", "T.L. Yorks", "Claude Friedrich"], "language": "English", "ISBN": "0425206866", "description": ["Welcome to Shakespeare, Arkansas. Lily Bard came to the small town of Shakespeare to escape her dark and violent past. Other than the day-to-day workings of her cleaning and errand-running service, she pays little attention to the town around her. So when she spots a dead body being dumped in the town green, she's inclined to stay well away. But she was in the wrong place at the wrong time, and despite her best efforts, she's dragged into the murder case. Lily doesn't care who did it, but when the police and local community start pointing fingers in her direction, she realizes that proving her innocence will depend on finding the real killer in quiet, secretive Shakespeare.", "is the first book in Charlaine Harris's Lily Bard mysterious series."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/54539.Silas_Marner", "image": ["https://images.gr-assets.com/books/1347323528l/54539.jpg"], "avg_ratings": ["\n  3.63\n"], "num_reviews": ["\n  ", "\n  64,004\n  ratings\n"], "genres": ["Classics", "Fiction", "Literature", "Historical", "Historical Fiction"], "title": "Silas Marner", "author": "George Eliot", "num_pages": "262", "awards": [], "places": ["United Kingdom"], "character_names": ["Silas Marner", "Eppie", "Godfrey Cass", "Dunstan Cass", "Dolly Winthrop", "Squire Cass", "Nancy Lammeter", "William Dane", "Priscilla Lammeter", "Aaron Winthrop"], "language": "English", "description": ["George Eliot's tale of a solitary miser gradually redeemed by the joy of fatherhood, ", " is edited with an introduction and notes by David Carroll in Penguin Classics.", "Wrongly accused of theft and exiled from a religious community many years before, the embittered weaver Silas Marner lives alone in Raveloe, living only for work and his precious hoard of money. But when his money is stolen and an orphaned child finds her way into his house, Silas is given the chance to transform his life. His fate, and that of Eppie, the little girl he adopts, is entwined with Godfrey Cass, son of the village Squire, who, like Silas, is trapped by his past. ", ", George Eliot's favourite of her novels, combines humour, rich symbolism and pointed social criticism to create an unsentimental but affectionate portrait of rural life.", "This text uses the Cabinet edition, revised by George Eliot in 1878. David Carroll's introduction is complemented by the original Penguin Classics edition introduction by Q.D. Leavis.", "Mary Ann Evans (1819-80) began her literary career as a translator, and later editor, of the Westminster Review. In 1857, she published ", ", the first of eight novels she would publish under the name of 'George Eliot', including ", ", ", ", and ", ".", "If you enjoyed ", ", you might like Nathaniel Hawthorne's ", ", also available in Penguin Classics.", "'I think ", " holds a higher place than any of the author's works. It is more nearly a masterpiece; it has more of that simple, rounded, consummate aspect ... which marks a classical work'", "Henry James"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/672245.Helliconia_Winter", "image": ["https://images.gr-assets.com/books/1389938680l/672245.jpg"], "avg_ratings": ["\n  3.77\n"], "num_reviews": ["\n  ", "\n  1,701\n  ratings\n"], "genres": ["Science Fiction", "Fiction", "Fantasy"], "title": "Helliconia Winter", "author": "Brian W. Aldiss", "num_pages": "304", "awards": ["British Science Fiction Association Award for Novel (1985)"], "places": [], "character_names": [], "language": "English", "ISBN": "0743445163", "description": ["This is the final volume of the Helliconia Trilogy -- a monumental saga that goes beyond anything yet created by this master among today's imaginative writers. The centuries-long winter of the Great Year on Helliconia is upon us, and the Oligarch is taking harsh measures to ensure the survival of the people of the bleak Northern continent of Sibornal. Behind the battle with which the novel opens lies an act of unparalleled treachery. But the plague is coming on the wings of winter and the Oligarch's will is set against it -- and against the phagors, humanity's ancient enemies, who carry the plague with them."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/32284999-hocus-pocus-in-focus", "image": ["https://images.gr-assets.com/books/1503226570l/32284999.jpg"], "avg_ratings": ["\n  3.70\n"], "num_reviews": ["\n  ", "\n  115\n  ratings\n"], "genres": ["Nonfiction", "Holiday", "Halloween", "Culture", "Pop Culture"], "title": "Hocus Pocus in Focus: The Thinking Fan's Guide to Disney's Halloween Classic", "author": "Aaron Wallace", "num_pages": "206", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "099805920X", "description": ["... ", "In the first and only book ever written about the beloved 1993 Halloween movie, Aaron Wallace takes readers deep into the world of ", " to learn everything they never knew. He provides a lighthearted but scholarly look at the film in its all spooky-kooky glory.", "You'll learn: ", "- The fascinating history behind \"Come, Little Children (Sarah's Song)\" and \"I Put a Spell on You\" ", "- How Steven Spielberg shaped the movie ", "- Why there's all that talk about yabbos and virgins ", "- How Hocus Pocus got away with being the edgiest Disney movie ever made ", "- Whether a sequel could really happen ", "- And much, much more", "Featuring a foreword by Golden Globe nominee ", " (Hocus Pocus's Dani), afterword by ", " (the film's writer and producer), and the ", ", this is the ultimate unofficial fan guide for Halloween and movie lovers everywhere. Finally, Hocus Pocus is celebrated as the classic it's become. You'll love the movie more than you ever knew you could.", " ", "Aaron Wallace is a bestselling author, entertainment critic, and attorney with a particular interest in the artistic output of The Walt Disney Company.", "His critical interest in entertainment began at The University of North Carolina at Chapel Hill, where he earned a Bachelor of Arts degree in both Communication Studies (with a concentration in Media Studies) and English. While there, he taught a recitation course in analyzing children's literature, with an emphasis on Disney's adaptations in theme parks and film.", "Wallace later pursued an interest in law, earning a Juris Doctorate from Wake Forest University. Additionally, he is a professional entertainment critic, having published more than two hundred movie, television, and music reviews to an audience of millions. Since 2004, he's been a part of the writing staff at DVDizzy.com, one of the internet's most accessed sites for entertainment journalism.", "In addition to writing, Aaron hosts Zip-A-Dee-Doo-Pod, the web's longest-running podcast dedicated to all things Disney. Apple has recognized the show as one of its \"Featured Travel Podcasts,\" and Zip-A-Dee-Doo-Pod can often be found among the top-ranking downloads on the iTunes Travel charts. Aaron also appears as a regular co-host on The Hub Podcast, another popular show devoted to having fun with Disney.", "The author's website is available at ", "."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/35285890-saved-by-the-chase", "image": ["https://images.gr-assets.com/books/1496396000l/35285890.jpg"], "avg_ratings": ["\n  3.77\n"], "num_reviews": ["\n  ", "\n  78\n  ratings\n"], "genres": ["Romance", "Contemporary Romance"], "title": "Saved By The Chase (AMBW Winter Romance Book 1)", "author": "Love Journey", "num_pages": "91", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Actor and singer, Hyun-Li had lost everything because he had broken up with the wrong woman. His ex-girlfriend had taken everything from him - his career, his reputation, millions of dollars, and his peace of mind. Now she wanted his life. ", "How will he escape? ", "Good samaritan, Monique, can’t stand by while a man is almost killed. So when she sees Hyun-Li lying on the ground bleeding she takes a chance to save him. But with a blizzard headed their way and a group of mercenaries on their tale, will they survive? Will they escape …. Will the chase lead Hyun-Li to love? ", "**This is a novella - 11,000 words. ", "This book is part of a series and a complete story on it's own. ", "If you love novellas filled with detailed, hot, steamy encounters of the best kind, then you will love the AMBW Winter Romance Series. Download and start reading today. "]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/24040551-the-night-sister", "image": ["https://images.gr-assets.com/books/1427845722l/24040551.jpg"], "avg_ratings": ["\n  3.67\n"], "num_reviews": ["\n  ", "\n  14,673\n  ratings\n"], "genres": ["Horror", "Mystery", "Fiction", "Thriller", "Fantasy", "Paranormal", "Fantasy", "Suspense"], "title": "The Night Sister", "author": "Jennifer  McMahon", "num_pages": "322", "awards": ["Goodreads Choice Award Nominee for Horror (2015)"], "places": ["Vermont"], "character_names": [], "language": "English", "ISBN": "0385538510", "description": ["Once the thriving attraction of rural Vermont, the Tower Motel now stands in disrepair, alive only in the memories of Amy, Piper, and Piper's kid sister, Margot. The three played there as girls until the day that their games uncovered something dark and twisted in the motel's past, something that ruined their friendship forever.", "Now adult, Piper and Margot have tried to forget what they found that fateful summer, but their lives are upended when Piper receives a panicked midnight call from Margot, with news of a horrific crime for which Amy stands accused. Suddenly, Margot and Piper are forced to relive the time that they found the suitcase that once belonged to Silvie Slater, the aunt that Amy claimed had run away to Hollywood to live out her dream of becoming Hitchcock's next blonde bombshell leading lady. As Margot and Piper investigate, a cleverly woven plot unfolds—revealing the story of Sylvie and Rose, two other sisters who lived at the motel during its 1950s heyday. Each believed the other to be something truly monstrous, but only one carries the secret that would haunt the generations to come."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/254705.Winter_World", "image": ["https://images.gr-assets.com/books/1442282009l/254705.jpg"], "avg_ratings": ["\n  4.06\n"], "num_reviews": ["\n  ", "\n  3,161\n  ratings\n"], "genres": ["Nonfiction", "Science", "Environment", "Nature", "Animals", "Science", "Biology", "Science", "Natural History", "Environment"], "title": "Winter World: The Ingenuity of Animal Survival", "author": "Bernd Heinrich", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0060957379", "description": ["From award-winning writer and biologist Bernd Heinrich, an intimate, accessible and eloquent illumination of animal survival in Winter.", "From flying squirrels to grizzly bears, torpid turtles to insects with antifreeze, the animal kingdom relies on some staggering evolutionary innovations to survive winter. Unlike their human counterparts, who must alter their environment to accommodate our physical limitations, animals are adaptable to an amazing range of conditions--i.e., radical changes in a creature's physiology take place to match the demands of the environment. Winter provides an especially remarkable situation, because of how drastically it affects the most elemental component of all life: water.", "Examining everything from food sources in the extremely barren winter landscape to the chemical composition that allows certain creatures to survive, Heinrich's Winter World awakens the largely undiscovered mysteries by which nature sustains herself through the harsh, cruel exigencies of winters"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/763498.October_Dreams", "image": ["https://images.gr-assets.com/books/1309212929l/763498.jpg"], "avg_ratings": ["\n  4.06\n"], "num_reviews": ["\n  ", "\n  1,228\n  ratings\n"], "genres": ["Horror", "Holiday", "Halloween", "Short Stories", "Fiction", "Anthologies"], "title": "October Dreams: A Celebration of Halloween", "author": "Richard Chizmar", "num_pages": "656", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0451458958", "description": ["Classic novellas, never-before-published stories, essays on the history, literature, and films of Halloween, and real-life memories of October 31st-from today's best practitioners of fear:Dean Koontz * Peter Straub * Poppy Z. Brite * Rick Hautala * Steve Rasnic Tem * Elizabeth Engstrom * Thomas Ligotti * Gary A. Braunbeck * Jack Ketchum * Thomas F. Monteleone * Hugh B. Cave * Simon Clark * Christopher Golden * Ray Bradbury * Jack Ketchum * Alan M. Clark * Gahan Wilson * Paula Guran * John Shirley * Tom Piccirilli * Jack Cady * David B. Silva * Robert Morrish * William F. Nolan * Michael Cadnum * Richard Laymon * Douglas Clegg * Douglas E. Winter * Stanley Wiater * Caitlín R. Kiernan * Lewis Shiner * Yvonne Navarro * Tim Lebbon * Kim Newman * F. Paul Wilson * Owl Goingback * Dennis Etchison * Stephen Mark Rainey * Charles L. Grant * Kelly Laymon * Dominick Cancilla * Kristine Kathryn Rusch * Michael Marshall Smith * Wayne Allen Sallee * Ramsey Campbell * Ed Gorman * Stefan Dziemianowicz * Peter Crowther"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/9615347-anya-s-ghost", "image": ["https://images.gr-assets.com/books/1316739317l/9615347.jpg"], "avg_ratings": ["\n  3.88\n"], "num_reviews": ["\n  ", "\n  52,854\n  ratings\n"], "genres": ["Sequential Art", "Graphic Novels", "Young Adult", "Sequential Art", "Comics", "Fantasy", "Fiction"], "title": "Anya's Ghost", "author": "Vera Brosgol", "num_pages": "224", "awards": ["Bram Stoker Award Nominee for Best Graphic Novel (2011)", "Harvey Awards for Best Original Graphic Publication For Younger Readers (2012)", "Will Eisner Comic Industry Awards for Best Publication for Young Adults (ages 12-17) (2012)", "Prix Bédélys Jeunesse (2012)", "Cybils Award for Graphic Novels (Young Adult) (2011)"], "places": [], "character_names": ["Anya Borzatovskaya", "Mrs. Borzatovskaya", "Sasha Borzakovsky", "Emily Reilly", "Siobhan", "Dima", "Elizabeth", "Sean", "Preston"], "language": "English", "ISBN": "1596437138", "description": ["Of all the things Anya expected to find at the bottom of an old well, a new friend was not one of them. Especially not a new friend who’s been dead for a century.", "Falling down a well is bad enough, but Anya's normal life might actually be worse. She's embarrassed by her family, self-conscious about her body, and she's pretty much given up on fitting in at school. A new friend—even a ghost—is just what she needs.", "Or so she thinks. Spooky, sardonic, and secretly sincere, ", " is a wonderfully entertaining debut from author/artist Vera Brosgol."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/33609.Katherine", "image": ["https://images.gr-assets.com/books/1436406825l/33609.jpg"], "avg_ratings": ["\n  4.18\n"], "num_reviews": ["\n  ", "\n  26,562\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical", "Classics", "Historical", "Medieval", "European Literature", "British Literature"], "title": "Katherine", "author": "Anya Seton", "num_pages": "500", "awards": [], "places": ["England"], "character_names": ["Katherine Swynford", "Edward III of England", "John of Gaunt, 1st Duke of Lancaster", "Alice Perrers", "Blanche of Lancaster"], "language": "English", "ISBN": "155652532X", "description": ["This classic romance novel tells the true story of the love affair that changed history—that of Katherine Swynford and John of Gaunt, Duke of Lancaster, the ancestors of most of the British royal family. Set in the vibrant 14th century of Chaucer and the Black Death, the story features knights fighting in battle, serfs struggling in poverty, and the magnificent Plantagenets—Edward III, the Black Prince, and Richard II—who ruled despotically over a court rotten with intrigue. Within this era of danger and romance, John of Gaunt, the king’s son, falls passionately in love with the already married Katherine. Their well-documented affair and love persist through decades of war, adultery, murder, loneliness, and redemption. This epic novel of conflict, cruelty, and untamable love has become a classic since its first publication in 1954."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/12658.Hawaii", "image": ["https://images.gr-assets.com/books/1415585664l/12658.jpg"], "avg_ratings": ["\n  4.20\n"], "num_reviews": ["\n  ", "\n  66,242\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Classics"], "title": "Hawaii", "author": "James A. Michener", "num_pages": "1136", "awards": [], "places": ["Hawaii"], "character_names": [], "language": "English", "ISBN": "0375760377", "description": ["Pulitzer Prize–winning author James A. Michener brings Hawaii’s epic history vividly to life in a classic saga that has captivated readers since its initial publication in 1959. As the volcanic Hawaiian Islands sprout from the ocean floor, the land remains untouched for centuries—until, little more than a thousand years ago, Polynesian seafarers make the perilous journey across the Pacific, flourishing in this tropical paradise according to their ancient traditions. Then, in the early nineteenth century, American missionaries arrive, bringing with them a new creed and a new way of life. Based on exhaustive research and told in Michener’s immersive prose, Hawaii is the story of disparate peoples struggling to keep their identity, live in harmony, and, ultimately, join together."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/1295.The_Clan_of_the_Cave_Bear", "image": ["https://images.gr-assets.com/books/1385331302l/1295.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  203,907\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Fantasy", "Historical"], "title": "The Clan of the Cave Bear", "author": "Jean M. Auel", "num_pages": "512", "awards": ["National Book Award Finalist for First Novel (1981)"], "places": ["Stone Age"], "character_names": ["Ayla", "Brun", "Broud", "Mog-Ur", "Iza"], "language": "English", "ISBN": "0553381679", "description": ["This novel of awesome beauty and power is a moving saga about people, relationships, and the boundaries of love. Through Jean M. Auel's magnificent storytelling we are taken back to the dawn of modern humans, and with a girl named Ayla we are swept up in the harsh and beautiful Ice Age world they shared with the ones who called themselves the ", ". ", "A natural disaster leaves the young girl wandering alone in an unfamiliar and dangerous land until she is found by a woman of the Clan, people very different from her own kind. To them, blond, blue-eyed Ayla looks peculiar and ugly--she is one of the Others, those who have moved into their ancient homeland; but Iza cannot leave the girl to die and takes her with them. Iza and Creb, the old Mog-ur, grow to love her, and as Ayla learns the ways of the Clan and Iza's way of healing, most come to accept her. But the brutal and proud youth who is destined to become their next leader sees her differences as a threat to his authority. He develops a deep and abiding hatred for the strange girl of the Others who lives in their midst, and is determined to get his revenge."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/27838603-the-midnight-watch", "image": ["https://images.gr-assets.com/books/1454232613l/27838603.jpg"], "avg_ratings": ["\n  3.82\n"], "num_reviews": ["\n  ", "\n  2,974\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical"], "title": "The Midnight Watch", "author": "David Dyer", "num_pages": "318", "awards": [], "places": ["New York State", "Boston, Massachusetts", "England"], "character_names": [], "language": "English", "ISBN": "1926428722", "description": ["David Dyer's astonishing novel The Midnight Watch is based on the true story of the SS Californian, the ship that saw the Titanic's distress rockets and yet, unfathomably, did nothing. A psychological thriller.", "Sometimes the smallest of human failings can lead to the greatest of disasters", "On a wretchedly cold night in the North Atlantic, a steamer stopped in an icefield sees the glow of another ship on the horizon. Just after midnight the first of eight distress rockets is fired. Why did the Californian look on while the Titanic sank?", "As soon as Boston American reporter John Steadman lays eyes on the man who stood the midnight watch on the Californian, he knows there's another story lurking behind the official one. Herbert Stone must have seen something, and yet his ship did nothing while the calamity took place. Now Stone, under his captain's orders, must carry his secret in silence, while Steadman is determined to find it out.", "So begins a strange dance around the truth by these three men. Haunted by the fifteen hundred who went to their deaths in those icy waters, and by the loss of his own baby son years earlier, Steadman must either find redemption in the Titanic's tragedy or lose himself.", "Based on true events, The Midnight Watch is at once a heart-stopping mystery and a deeply knowing novel – about the frailty of men, the strength of women, the capriciousness of fate and the price of loyalty."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/11250053-the-snow-child", "image": ["https://images.gr-assets.com/books/1327098624l/11250053.jpg"], "avg_ratings": ["\n  3.97\n"], "num_reviews": ["\n  ", "\n  100,469\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Magical Realism", "Historical"], "title": "The Snow Child", "author": "Eowyn Ivey", "num_pages": "386", "awards": ["Pulitzer Prize Nominee for Fiction (2013)", "Indies Choice Book Award for Adult Debut (2013)", "Tähtifantasia Award Nominee (2014)", "The Center for Fiction First Novel Prize Nominee (2012)", "Specsavers National Book Award for International Author of the Year (2012)", "Goodreads Choice Award Nominee for Historical Fiction (2012)"], "places": ["Alaska"], "character_names": ["Mabel", "Jack", "Snegurochka"], "language": "English", "ISBN": "0316175676", "description": ["Alaska, 1920: a brutal place to homestead, and especially tough for recent arrivals Jack and Mabel. Childless, they are drifting apart - he breaking under the weight of the work of the farm; she crumbling from loneliness and despair. In a moment of levity during the season's first snowfall, they build a child out of snow. The next morning the snow child is gone - but they glimpse a young, blonde-haired girl running through the trees. ", "This little girl, who calls herself Faina, seems to be a child of the woods. She hunts with a red fox at her side, skims lightly across the snow, and somehow survives alone in the Alaskan wilderness. As Jack and Mabel struggle to understand this child who could have stepped from the pages of a fairy tale, they come to love her as their own daughter. But in this beautiful, violent place, things are rarely as they appear, and what they eventually learn about Faina will transform all of them."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/5368.Forever_Amber", "image": ["https://images.gr-assets.com/books/1350464965l/5368.jpg"], "avg_ratings": ["\n  3.99\n"], "num_reviews": ["\n  ", "\n  15,592\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Romance", "Historical", "Classics", "Romance", "Historical Romance"], "title": "Forever Amber", "author": "Kathleen Winsor", "num_pages": "972", "awards": [], "places": ["London, England"], "character_names": ["Charles II of England, Scotland and Ireland", "Barbara Villiers", "Amber St. Clare"], "language": "English", "ISBN": "0141009829", "description": ["Abandoned pregnant and penniless on the teeming streets of London, 16-year-old Amber St. Clare manages, by using her wits, beauty, and courage, to climb to the highest position a woman could achieve in Restoration England-that of favorite mistress of the Merry Monarch, Charles II. From whores and highwaymen to courtiers and noblemen, from events such as the Great Plague and the Fire of London to the intimate passions of ordinary-and extraordinary-men and women, Amber experiences it all. But throughout her trials and escapades, she remains, in her heart, true to the one man she really loves, the one man she can never have. ", "Frequently compared to ", ", ", " is the other great historical romance, outselling every other American novel of the 1940s-despite being banned in Boston for its sheer sexiness. A book to read and reread, this edition brings back to print an unforgettable romance and a timeless masterpiece."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/17349878-above-all-things", "image": ["https://images.gr-assets.com/books/1367486264l/17349878.jpg"], "avg_ratings": ["\n  3.69\n"], "num_reviews": ["\n  ", "\n  3,384\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Adventure", "Cultural", "Canada", "Adult Fiction"], "title": "Above All Things", "author": "Tanis Rideout", "num_pages": "400", "awards": [], "places": ["Mount Everest", "Cambridge, England"], "character_names": [], "language": "English", "ISBN": "0241965446", "description": ["meets ", "in this breathtaking debut novel of obsession and divided loyalties, which brilliantly weaves together the harrowing story of George Mallory's ill-fated 1924 attempt to be the first man to conquer Mount Everest, with that of a single day in the life of his wife as she waits at home in England for news of his return. ", " ", "A captivating blend of historical fact and imaginative fiction, ", " moves seamlessly back and forth between the epic story of Mallory's legendary final expedition and a heartbreaking account of a day in the life of Ruth Mallory. Through George's perspective, and that of the newest member of the climbing team, Sandy Irvine, we get an astonishing picture of the terrible risks taken by the men on the treacherous terrain of the Himalaya. But it is through Ruth's eyes that a complex portrait of a marriage emerges, one forged on the eve of the First World War, shadowed by its losses, and haunted by the ever-present possibility that George might not come home. ", "Drawing on years of research, this powerful and beautifully written novel is a timeless story of desire, redemption, and the lengths we are willing to go for honour, glory, and love."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/37638024-the-rain-watcher", "image": ["https://images.gr-assets.com/books/1518378458l/37638024.jpg"], "avg_ratings": ["\n  3.22\n"], "num_reviews": ["\n  ", "\n  2,351\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Cultural", "France", "Contemporary"], "title": "The Rain Watcher", "author": "Tatiana de Rosnay", "num_pages": "229", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1250200016", "description": [" is a powerful family drama set in Paris as the Malegarde family gathers to celebrate the father's 70th birthday. Their hidden fears and secrets are slowly unraveled as the City of Light undergoes a stunning natural disaster. Seen through the eyes of charismatic photographer Linden Malegarde, the youngest son, all members of the family will have to fight to keep their unity against tragic circumstances.", "In this profound and intense novel of love and redemption, De Rosnay demonstrates all of her writer's skills both as an incredible storyteller but also as a soul seeker."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/413618.Random_Harvest", "image": ["https://images.gr-assets.com/books/1358758527l/413618.jpg"], "avg_ratings": ["\n  4.09\n"], "num_reviews": ["\n  ", "\n  1,462\n  ratings\n"], "genres": ["Fiction", "Classics", "Historical", "Historical Fiction", "Romance", "European Literature", "British Literature"], "title": "Random Harvest", "author": "James Hilton", "num_pages": "336", "awards": [], "places": ["United Kingdom"], "character_names": ["Charles Ranier"], "language": "English", "ISBN": "0786705930", "description": []},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/7058405-the-ice-princess", "image": ["https://images.gr-assets.com/books/1347445122l/7058405.jpg"], "avg_ratings": ["\n  3.71\n"], "num_reviews": ["\n  ", "\n  48,215\n  ratings\n"], "genres": ["Mystery", "Mystery", "Crime", "Fiction", "Thriller", "European Literature", "Scandinavian Literature", "Thriller", "Mystery Thriller"], "title": "The Ice Princess", "author": "Camilla Läckberg", "num_pages": "393", "awards": ["Grand Prix de Littérature Policière for Romans étrangers (2008)", "Prix Polar International (2008)"], "places": ["Fjällbacka"], "character_names": ["Erica Falck", "Patrik Hedström"], "language": "English", "ISBN": "1605980927", "description": ["Returning to her hometown of Fjallbacka after the funeral of her parents, writer Erica Falck finds a community on the brink of tragedy. The death of her childhood friend, Alex, is just the beginning. Her wrists slashed, her body frozen in an ice-cold bath, it seems that she has taken her own life.", "Erica conceives a book about the beautiful but remote Alex, one that will answer questions about their own shared past. While her interest grows into an obsession, local detective Patrik Hedstrom is following his own suspicions about the case. But it is only when they start working together that the truth begins to emerge about a small town with a deeply disturbing past."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/3843654-the-amaranth-enchantment", "image": ["https://images.gr-assets.com/books/1312064049l/3843654.jpg"], "avg_ratings": ["\n  3.66\n"], "num_reviews": ["\n  ", "\n  11,184\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Fairy Tales", "Fantasy", "Magic", "Fiction"], "title": "The Amaranth Enchantment", "author": "Julie Berry", "num_pages": "320", "awards": ["William Allen White Children's Book Award Nominee (2011)"], "places": [], "character_names": ["Peter Duchene", "Lucinda Chapdelaine", "Prince Gregor"], "language": "English", "ISBN": "1599903342", "description": ["When Lucinda Chapdelaine was a small child, her parents left for the royal ball and never returned. Ever since, Lucinda has been stuck in perpetual servitude at her evil aunt's jewelry store. Then, on the very same day, a mysterious visitor and an even more bizarre piece of jewelry both enter the shop, setting in motion a string of twists and turns that will forever alter Lucinda's path.", "In this magical story filled with enchanting surprises, Lucinda will dance at the royal ball, fall under the Amaranth Witch's spell, avenge her parents' death, restore justice to a town that does not yet know the corrupt danger around them, and maybe - just maybe - Lucinda might capture the heart of a prince."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/6320534-under-the-dome", "image": ["https://images.gr-assets.com/books/1511289992l/6320534.jpg"], "avg_ratings": ["\n  3.90\n"], "num_reviews": ["\n  ", "\n  227,270\n  ratings\n"], "genres": ["Horror", "Fiction", "Science Fiction", "Thriller"], "title": "Under the Dome", "author": "Stephen King", "num_pages": "1074", "awards": ["Locus Award Nominee for Best Science Fiction Novel (2010)", "British Fantasy Award Nominee for Best Novel (2010)", "Goodreads Choice Award Nominee for Mystery/Thriller (2009)"], "places": ["Chester's Mill, Maine", "Maine"], "character_names": ["Dale Barbara", "Julia Shumway", "James Rennie", "Junior Rennie", "Eric \"Rusty\" Everett", "Joseph \"Scarecrow Joe\" McClatchey", "Brenda Perkins", "Frank DeLesseps", "Carter Thibodeau", "Melvin Searles", "Georgia Roux", "Andy Sanders", "Phil \"The Chef\" Bushey", "Peter Randolph", "United States Military", "American Law Enforcement", "Dale \"Barbie\" Barbara", "James \"Big Jim\" Rennie", "Bill Allnut", "Sarah Allnut", "Mabel Alston", "Private Clint Ames", "Tommy Anderson", "Willow Anderson", "Elsa Andrews", "Aidan Patrick Appleton", "Alice Rachel Appleton", "Marty Arsenault", "Donnie Baribeau", "Chaz Bender", "Kayla Bevins", "Harriet Bigelow", "Fernald \"Fern\" Bowie", "Stewart Bowie", "Joe Boxer", "Clayton Brassey", "Freeman Brown", "Gina Buffalino", "Michela Burpee", "Romeo \"Rommie\" Burpee", "Little Walter Bushey", "Phil Bushey", "Sammy Bushey", "Billy Cale", "Jack Cale", "Ernie Calvert", "Joanie Calvert", "Lucien Calvert", "Norrie Calvert", "Ed Carty", "Carrie Carver", "Deanna Carver", "Johnny Carver", "Eddie Chalmers", "Pamela Chen", "Henrietta Clavard", "John Clavard", "Reverend Lester Coggins", "Cindy Collins", "Hanna Compton", "Mrs. Connaught", "Lauren Conree", "Rance Conroy", "Arletta Coombs", "Anderson Cooper", "Mary Lou Costas", "Colonel James O. Cox", "Wanda Crumley", "Wendell Crumley", "Wanda Debec", "Frederick \"Fred\"  Howard Denton", "Alden Dinsmore", "Oliver \"Ollie\" Dinsmore", "Rory Dinsmore", "Shelley Dinsmore", "Russ Dorr", "Alva Drake", "Benny Drake", "Norman Drake", "Coralee Dumagen", "Marta Edmunds", "Brendan Ellerbee", "Myra Evans", "Erik \"Rusty\" Everett", "Janelle Everett", "Judy Everett", "Linda Everett", "Rusty Evers", "George Frederick", "Lois Freeman", "Will Freeman", "Jack Evans", "Randall Killian", "Ricky Killian", "Roger Killian", "Leo Lamoine", "George Lathrop", "Reverend Piper Libby", "Rupert \"Rupe\" Libby", "Corrie Macintosh", "Suzanne Malveaux", "Toby Manning", "Thurston Marshall", "Angie McCain", "LaDonna McCain", "Mr. McCain", "Claire McClatchey", "Joe McClatchey", "Sam McClatchey", "James McMurtry", "Lennie Meechum", "Stacey Moggin", "Tabby Morrell", "Frieda Morrison", "Henry Morrison", "Charles \"Stubby\" Norman", "Howard \"Duke\" Perkins", "Major Gene Ray", "Doc Rayburn", "Nora Robichaud", "Bob Roux", "Helen Roux", "Andrew \"Andy\" DeLois Sanders", "Claudette Sanders", "Dorothy \"Dodee\"  Sanders", "Sea Dogs", "Melvin \"Mel\" Searles", "Petra Searles", "Jimmy Sirois", "Carolyn Sturges", "Chuck Thompson", "Al Timmons", "Ginny Tomlinson", "Nell Toomey", "Aubrey Towle", "Johnny Trent", "Douglas Twitchell", "Miz Rose Twitchell", "Jessie Vachon", "Ellen Vanedestine"], "language": "English", "ISBN": "1439148503", "description": ["On an entirely normal, beautiful fall day in Chester’s Mill, Maine, the town is inexplicably and suddenly sealed off from the rest of the world by an invisible force field. Planes crash into it and fall from the sky in flaming wreckage, a gardener’s hand is severed as “the dome” comes down on it, people running errands in the neighboring town are divided from their families, and cars explode on impact. No one can fathom what this barrier is, where it came from, and when—or if—it will go away.", "Dale Barbara, Iraq vet and now a short-order cook, finds himself teamed with a few intrepid citizens—town newspaper owner Julia Shumway, a physician’s assistant at the hospital, a selectwoman, and three brave kids. Against them stands Big Jim Rennie, a politician who will stop at nothing—even murder—to hold the reins of power, and his son, who is keeping a horrible secret in a dark pantry. But their main adversary is the Dome itself. Because time isn’t just short. It’s running out.", "Source: stephenking.com"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/24800.House_of_Leaves", "image": ["https://images.gr-assets.com/books/1403889034l/24800.jpg"], "avg_ratings": ["\n  4.12\n"], "num_reviews": ["\n  ", "\n  102,901\n  ratings\n"], "genres": ["Horror", "Fiction", "Fantasy", "Mystery"], "title": "House of Leaves", "author": "Mark Z. Danielewski", "num_pages": "705", "awards": ["New York Public Library Young Lions Fiction Award (2001)", "Guardian First Book Award Nominee (2000)", "James Tait Black Memorial Prize Nominee for Fiction (2000)"], "places": [], "character_names": ["Zampanò", "Will Navidson", "Karen Green", "Johnny Truant"], "language": "English", "ISBN": "038560310X", "description": ["Years ago, when ", " was first being passed around, it was nothing more than a badly bundled heap of paper, parts of which would occasionally surface on the Internet. No one could have anticipated the small but devoted following this terrifying story would soon command. Starting with an odd assortment of marginalized youth—musicians, tattoo artists, programmers, strippers, environmentalists, and adrenaline junkies—the book eventually made its way into the hands of older generations, who not only found themselves in those strangely arranged pages but also discovered a way back into the lives of their estranged children.", "Now, for the first time, this astonishing novel is made available in book form, complete with the original colored words, vertical footnotes, and newly added second and third appendices.", "The story remains unchanged, focusing on a young family that moves into a small home on Ash Tree Lane where they discover something is terribly wrong: their house is bigger on the inside than it is on the outside.", "Of course, neither Pulitzer Prize-winning photojournalist Will Navidson nor his companion Karen Green was prepared to face the consequences of that impossibility, until the day their two little children wandered off and their voices eerily began to return another story—of creature darkness, of an ever-growing abyss behind a closet door, and of that unholy growl which soon enough would tear through their walls and consume all their dreams."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/17245.Dracula", "image": ["https://images.gr-assets.com/books/1387151694l/17245.jpg"], "avg_ratings": ["\n  3.99\n"], "num_reviews": ["\n  ", "\n  789,821\n  ratings\n"], "genres": ["Classics", "Horror", "Fiction", "Fantasy", "Paranormal", "Vampires"], "title": "Dracula", "author": "Bram Stoker", "num_pages": "488", "awards": [], "places": ["Whitby, Yorkshire, England", "Transylvania", "Budapest", "London, England", "England"], "character_names": ["Jonathan Harker", "Lucy Westenra", "Abraham Van Helsing", "John Seward", "Quincey Morris", "Arthur Holmwood (later Lord Godalming)", "R.M. Renfield", "Mina Murray Harker", "Quincey Harker", "Peter Hawkins", "Samuel F. Billington", "Herr Leutner", "Mr. Swales", "Mr. Westenra", "Mrs. Westenra", "Lord Godalming (elder)", "Patrick Hennessey", "Thomas Bilder", "Sister Agatha (Dracula)", "Dr. Vincent", "Thomas Snelling", "Joseph Smollett", "Sam Bloxam", "Billington Junior", "Attendant Hardy", "Captain of the Demeter", "Abramoff (Demeter Crew)", "Olgaren (Demeter Crew)", "Mate of the Demeter (Roumanian)", "Second Mate of the Demeter", "Rufus Smith", "Mr. Mackenzie", "Mr. Steinkoff", "Captain Donelson", "Immanuel Hildesheim", "Petrof Skinsky", "Lady Godalming", "Mrs. Seward", "Dracula"], "language": "English", "ISBN": "0393970124", "description": ["A rich selection of background and source materials is provided in three areas: Contexts includes probable inspirations for Dracula in the earlier works of James Malcolm Rymer and Emily Gerard. Also included are a discussion of Stoker's working notes for the novel and \"Dracula's Guest,\" the original opening chapter to Dracula. Reviews and Reactions reprints five early reviews of the novel. \"Dramatic and Film Variations\" focuses on theater and film adaptations of Dracula, two indications of the novel's unwavering appeal. David J. Skal, Gregory A. Waller, and Nina Auerbach offer their varied perspectives. Checklists of both dramatic and film adaptations are included.", "Criticism collects seven theoretical interpretations of Dracula by Phyllis A. Roth, Carol A. Senf, Franco Moretti, Christopher Craft, Bram Dijkstra, Stephen D. Arata, and Talia Schaffer.", "A Chronology and a Selected Bibliography are included."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/930.Memoirs_of_a_Geisha", "image": ["https://images.gr-assets.com/books/1388367666l/930.jpg"], "avg_ratings": ["\n  4.10\n"], "num_reviews": ["\n  ", "\n  1,543,326\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Romance", "Historical"], "title": "Memoirs of a Geisha", "author": "Arthur Golden", "num_pages": "434", "awards": [], "places": ["Kyoto"], "character_names": ["Nitta Sayuri", "Mr. Bekku", "Mr. Tanaka Ichiro", "Dr. Crab", "Hatsumoto", "Mameha", "Chairman Iwamura Ken", "Pumpkin", "Nobu Toshikazu"], "language": "English", "ISBN": "0739326228", "description": ["A literary sensation and runaway bestseller, this brilliant debut novel presents with seamless authenticity and exquisite lyricism the true confessions of one of Japan's most celebrated geisha.", "In ", ", we enter a world where appearances are paramount; where a girl's virginity is auctioned to the highest bidder; where women are trained to beguile the most powerful men; and where love is scorned as illusion. It is a unique and triumphant work of fiction - at once romantic, erotic, suspenseful - and completely unforgettable."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/8127.Anne_of_Green_Gables", "image": ["https://images.gr-assets.com/books/1390789015l/8127.jpg"], "avg_ratings": ["\n  4.24\n"], "num_reviews": ["\n  ", "\n  609,286\n  ratings\n"], "genres": ["Classics", "Fiction", "Young Adult", "Childrens", "Historical", "Historical Fiction"], "title": "Anne of Green Gables", "author": "L.M. Montgomery", "num_pages": "320", "awards": [], "places": ["Avonlea, Prince Edward Island", "Prince Edward Island"], "character_names": ["Marilla Cuthbert", "Matthew Cuthbert", "Diana Barry", "Gilbert Blythe", "Rachel Lynde", "Anne Blythe", "Anne Shirley"], "language": "English", "ISBN": "0451528824", "description": ["As soon as Anne Shirley arrives at the snug white farmhouse called Green Gables, she is sure she wants to stay forever . . . but will the Cuthberts send her back to to the orphanage? Anne knows she's not what they expected—a skinny girl with fiery red hair and a temper to match. If only she can convince them to let her stay, she'll try very hard not to keep rushing headlong into scrapes and blurting out the first thing that comes to her mind. Anne is not like anyone else, the Cuthberts agree; she is special—a girl with an enormous imagination. This orphan girl dreams of the day when she can call herself Anne of Green Gables."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/31463.Far_From_the_Madding_Crowd", "image": ["https://images.gr-assets.com/books/1388279695l/31463.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  112,419\n  ratings\n"], "genres": ["Classics", "Fiction", "Romance", "Literature", "19th Century"], "title": "Far From the Madding Crowd", "author": "Thomas Hardy", "num_pages": "433", "awards": [], "places": ["United Kingdom", "Wessex, England", "Casterbridge, England"], "character_names": ["Gabriel Oak", "Bathsheba Everdene", "William Boldwood", "Francis Troy", "Fanny Robin"], "language": "English", "ISBN": "0141439653", "description": ["Independent and spirited Bathsheba Everdene has come to Weatherbury to take up her position as a farmer on the largest estate in the area. Her bold presence draws three very different suitors: the gentleman-farmer Boldwood, soldier-seducer Sergeant Troy and the devoted shepherd Gabriel Oak. Each, in contrasting ways, unsettles her decisions and complicates her life, and tragedy ensues, threatening the stability of the whole community. The first of his works set in Wessex, Hardy's novel of swift passion and slow courtship is imbued with his evocative descriptions of rural life and landscapes, and with unflinching honesty about sexual relationships."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/628036.The_Shadow_of_the_Wind", "image": ["https://images.gr-assets.com/books/1309287864l/628036.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  371,496\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Mystery", "Fantasy"], "title": "The Shadow of the Wind", "author": "Carlos Ruiz Zafón", "num_pages": "487", "awards": ["Barry Award for Best First Novel (2005)", "Borders Original Voices Award for Fiction (2004)", "Dilys Award Nominee (2005)", "Humo's Gouden Bladwijzer (2006)", "Prix du Meilleur Livre Étranger for Roman (2004)", "Prix des libraires du Québec for Lauréats hors Québec (2005)", "One Book One San Diego (2015)", "Premi Llibreter de narrativa Nominee (2002)"], "places": ["Spain", "Barcelona, Catalonia"], "character_names": ["Daniel Sempere", "Fermín Romero de Torres", "Julián Carax", "Miquel Moliner", "Nuria Monfort", "Francisco Javier Fumero", "Beatriz Aguilar", "Jorge Aldaya", "Penélope Aldaya", "Antoni Fortuny", "Clara Barceló", "Monsieur Darcieu", "Viçenteta", "Teniente Palacios", "Doña Yvonne Sotoceballos", "Jacinta Coronado", "Gustavo Barceló", "Bernarda", "Fernando Ramos", "Sophie Carax", "Candide (Voltaire)"], "language": "English", "ISBN": "1594200106", "description": ["Barcelona, 1945: A city slowly heals in the aftermath of the Spanish Civil War, and Daniel, an antiquarian book dealer’s son who mourns the loss of his mother, finds solace in a mysterious book entitled The Shadow of the Wind, by one Julián Carax. But when he sets out to find the author’s other works, he makes a shocking discovery: someone has been systematically destroying every copy of every book Carax has written. In fact, Daniel may have the last of Carax’s books in existence. Soon Daniel’s seemingly innocent quest opens a door into one of Barcelona’s darkest secrets--an epic story of murder, madness, and doomed love."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/5297.The_Picture_of_Dorian_Gray", "image": ["https://images.gr-assets.com/books/1546103428l/5297.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  792,977\n  ratings\n"], "genres": ["Classics", "Fiction", "Horror", "Fantasy"], "title": "The Picture of Dorian Gray", "author": "Oscar Wilde", "num_pages": "367", "awards": [], "places": ["England"], "character_names": ["Dorian Gray", "Basil Hallward", "Lord Henry Wotton", "Sibyl Vane", "James Vane", "Lady Wotton"], "language": "English", "ISBN": "0375751513", "description": ["﻿Written in his distinctively dazzling manner, Oscar Wilde’s story of a fashionable young man who sells his soul for eternal youth and beauty is the author’s most popular work. The tale of Dorian Gray’s moral disintegration caused a scandal when it ﬁrst appeared in 1890, but though Wilde was attacked for the novel’s corrupting inﬂuence, he responded that there is, in fact, “a terrible moral in ", ".” Just a few years later, the book and the aesthetic/moral dilemma it presented became issues in the trials occasioned by Wilde’s homosexual liaisons, which resulted in his imprisonment. Of Dorian Gray’s relationship to autobiography, Wilde noted in a letter, “Basil Hallward is what I think I am: Lord Henry what the world thinks me: Dorian what I would like to be—in other ages, perhaps.”"]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/13315732-the-hound-of-the-baskervilles", "image": ["https://images.gr-assets.com/books/1324901106l/13315732.jpg"], "avg_ratings": ["\n  4.10\n"], "num_reviews": ["\n  ", "\n  205,836\n  ratings\n"], "genres": ["Classics", "Mystery", "Fiction", "Mystery", "Crime"], "title": "The Hound of the Baskervilles", "author": "Arthur Conan Doyle", "num_pages": "214", "awards": ["Audie Award for Best Audio Drama (2015)"], "places": ["United Kingdom", "Devon, England", "London, England"], "character_names": ["Charles Baskerville", "Henry Baskerville", "Dr. John Watson", "James Mortimer", "John Barrymore", "Eliza Barrymore", "Mr. Perkins", "Mr. Frankland", "Jack Stapleton", "Beryl Stapleton", "James Desmond", "Johna Clayton", "Mr. Selden", "Laura Lyons", "Sherlock Holmes"], "language": "English", "ISBN": "0141195223", "description": ["When the services of famed detective Sherlock Holmes are engaged to ensure the safety of Baskerville heir Sir Henry, Dr Watson is surprised to find his friend dismissive of the matter. Watson is dispatched alone to accompany Sir Henry to Baskerville Hall in Devon while Holmes deals with another case.", "Yet Watson finds the wild moors are a far cry from the orderly streets of London, and in the cold night a savage and bestial howl may be heard ..."]},
{"list": "Sweater Weather", "url": "https://www.goodreads.com/book/show/13158800-the-light-between-oceans", "image": ["https://images.gr-assets.com/books/1336683021l/13158800.jpg"], "avg_ratings": ["\n  4.02\n"], "num_reviews": ["\n  ", "\n  346,449\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Australia", "Historical", "Book Club"], "title": "The Light Between Oceans", "author": "M.L. Stedman", "num_pages": "343", "awards": ["Australian Independent Booksellers Indie Book Award for Book of the Year (2013)", "Australian Book Industry Award (ABIA) for Literary Fiction and Newcomer (2013)", "Women's Prize for Fiction Nominee for Longlist (2013)", "Goodreads Choice Award for Historical Fiction (2012)", "HWA Debut Crown (2013)"], "places": ["Australia"], "character_names": ["Tom Sherbourne", "Isabel Sherbourne", "Lucy / Grace", "Hannah Roennfeldt"], "language": "English", "ISBN": "1451681739", "description": ["A captivating, beautiful, and stunningly accomplished debut novel that opens in 1918 Australia - the story of a lighthouse keeper and his wife who make one devastating choice that forever changes two worlds. ", "Australia, 1926. After four harrowing years fighting on the Western Front, Tom Sherbourne returns home to take a job as the lighthouse keeper on Janus Rock, nearly half a day's journey from the coast. To this isolated island, where the supply boat comes once a season and shore leaves are granted every other year at best, Tom brings a young, bold, and loving wife, Isabel. Years later, after two miscarriages and one stillbirth, the grieving Isabel hears a baby's cries on the wind. A boat has washed up onshore carrying a dead man and a living baby. ", "Tom, whose records as a lighthouse keeper are meticulous and whose moral principles have withstood a horrific war, wants to report the man and infant immediately. But Isabel has taken the tiny baby to her breast. Against Tom's judgment, they claim her as their own and name her Lucy. When she is two, Tom and Isabel return to the mainland and are reminded that there are other people in the world. Their choice has devastated one of them. ", "M. L. Stedman's mesmerizing, beautifully written debut novel seduces us into accommodating Isabel's decision to keep this \"gift from God.\" And we are swept into a story about extraordinarily compelling characters seeking to find their North Star in a world where there is no right answer, where justice for one person is another's tragic loss."]}
]