[
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/47910.Winter_Door", "image": ["https://images.gr-assets.com/books/1320398796l/47910.jpg"], "avg_ratings": ["\n  3.91\n"], "num_reviews": ["\n  ", "\n  472\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction", "Adult"], "title": "Winter Door", "author": "Isobelle Carmody", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0375830189", "description": ["In the midst of the worst winter on record, Rage is beset with worry. Her mother still hasn’t fully recovered from her car accident despite Rage’s successful quest for healing magic. Her stoic uncle seems to be having second thoughts about looking after her. The school bully, Logan, is increasingly malicious. And her only friend, Billy Thunder, is just a dog again. As if that weren’t enough, there’s something wild lurking in the woods around the farm. Do Rage’s dreams hint at a sinister threat to two worlds?"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/317500.The_Lion_the_Witch_and_the_Wardrobe", "image": ["https://images.gr-assets.com/books/1370691890l/317500.jpg"], "avg_ratings": ["\n  4.21\n"], "num_reviews": ["\n  ", "\n  1,836,432\n  ratings\n"], "genres": ["Fantasy", "Classics", "Fiction", "Young Adult", "Childrens"], "title": "The Lion, the Witch and the Wardrobe", "author": "C.S. Lewis", "num_pages": "186", "awards": ["Hugo Award Nominee for Best Novel (1954)", "Lewis Carroll Shelf Award (1962)", "The Keith Barker Millennium Children's Book Awards 'Children's Book of the Century'"], "places": ["London, England", "Narnia"], "character_names": ["Aslan", "Lucy Pevensie", "Edmund Pevensie", "Mr. Tumnus", "Peter Pevensie", "Susan Pevensie", "Jadis", "Mr. & Mrs. Beaver"], "language": "English", "ISBN": "0020442203", "description": ["The Lion, the Witch & the Wardrobe, completed in the winter of 1949 & published in 1950, tells the story of four ordinary children: Peter, Susan, Edmund & Lucy Pevensie. They discover a wardrobe in Prof. Digory Kirke's house that leads to the magical land of Narnia, which is currently under the spell of a witch. The four children fulfill an ancient, mysterious prophecy while in Narnia. The Pevensie children help Aslan (the Turkish word for lion) & his army save Narnia from the evil White Witch, who's reigned over the Narnia in winter for 100 years.", "This edition follows the original numbering scheme. Recent publishers have renumbered the volumes so they are ordered chronologically. This was reportedly the author's preference. Other editions number this book as 2."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/16700472-a-christmas-homecoming", "image": ["https://images.gr-assets.com/books/1356131394l/16700472.jpg"], "avg_ratings": ["\n  3.40\n"], "num_reviews": ["\n  ", "\n  1,270\n  ratings\n"], "genres": ["Mystery", "Holiday", "Christmas", "Fiction", "Historical", "Historical Fiction", "Historical"], "title": "A Christmas Homecoming", "author": "Anne Perry", "num_pages": "176", "awards": [], "places": [], "character_names": ["Caroline Ellison", "Joshua Fielding"], "language": "English", "ISBN": "0755376943", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/29960.Winter_of_Magic_s_Return", "image": ["https://images.gr-assets.com/books/1387745061l/29960.jpg"], "avg_ratings": ["\n  4.25\n"], "num_reviews": ["\n  ", "\n  236\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Childrens", "Mythology", "Arthurian", "Fiction", "Apocalyptic", "Post Apocalyptic"], "title": "Winter of Magic's Return", "author": "Pamela F. Service", "num_pages": "194", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0449702022", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13075323-touch-of-power", "image": ["https://images.gr-assets.com/books/1325117081l/13075323.jpg"], "avg_ratings": ["\n  4.15\n"], "num_reviews": ["\n  ", "\n  39,216\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Romance", "Fantasy", "High Fantasy"], "title": "Touch of Power", "author": "Maria V. Snyder", "num_pages": "390", "awards": [], "places": [], "character_names": ["Avry of Kazan", "Kerrick", "Belen"], "language": "English", "description": ["Laying hands upon the injured and dying, Avry of Kazan assumes their wounds and diseases into herself. But rather than being honoured for her skills, she is hunted. Healers like Avry are accused of spreading the plague that has decimated the Territories, leaving the survivors in a state of chaos.", "Stressed and tired from hiding, Avry is abducted by a band of rogues who, shockingly, value her gift above the golden bounty offered for her capture. Their leader an enigmatic captor-protector with powers of his own is unequivocal in his demands: Avry must heal a plague-stricken prince, the leader of a campaign against her people.", "As they traverse the daunting Nine Mountains, beset by mercenaries and magical dangers, Avry must decide who is worth healing and what is worth dying for."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/11250053-the-snow-child", "image": ["https://images.gr-assets.com/books/1327098624l/11250053.jpg"], "avg_ratings": ["\n  3.97\n"], "num_reviews": ["\n  ", "\n  100,469\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Fantasy", "Magical Realism", "Historical"], "title": "The Snow Child", "author": "Eowyn Ivey", "num_pages": "386", "awards": ["Pulitzer Prize Nominee for Fiction (2013)", "Indies Choice Book Award for Adult Debut (2013)", "Tähtifantasia Award Nominee (2014)", "The Center for Fiction First Novel Prize Nominee (2012)", "Specsavers National Book Award for International Author of the Year (2012)", "Goodreads Choice Award Nominee for Historical Fiction (2012)"], "places": ["Alaska"], "character_names": ["Mabel", "Jack", "Snegurochka"], "language": "English", "ISBN": "0316175676", "description": ["Alaska, 1920: a brutal place to homestead, and especially tough for recent arrivals Jack and Mabel. Childless, they are drifting apart - he breaking under the weight of the work of the farm; she crumbling from loneliness and despair. In a moment of levity during the season's first snowfall, they build a child out of snow. The next morning the snow child is gone - but they glimpse a young, blonde-haired girl running through the trees. ", "This little girl, who calls herself Faina, seems to be a child of the woods. She hunts with a red fox at her side, skims lightly across the snow, and somehow survives alone in the Alaskan wilderness. As Jack and Mabel struggle to understand this child who could have stepped from the pages of a fairy tale, they come to love her as their own daughter. But in this beautiful, violent place, things are rarely as they appear, and what they eventually learn about Faina will transform all of them."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/25040992-a-tundra-tale", "image": ["https://images.gr-assets.com/books/1425145164l/25040992.jpg"], "avg_ratings": ["\n  4.14\n"], "num_reviews": ["\n  ", "\n  14\n  ratings\n"], "genres": ["Fantasy"], "title": "A Tundra Tale", "author": "Lone Alaskan Gypsy", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Inspired by Alaskan folklore, this fairytale story takes Olive, a twenty-year-old resident of a remote psychiatric hospital, on a journey into the tundra, where with the help of her arctic fox companion, a young Athabascan child, and an old trapper she will discover the secrets of the black wolf, the story of the land's ancestors, and the power of the northern lights that could unite them all."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/7114825-cold-magic", "image": ["https://images.gr-assets.com/books/1323994929l/7114825.jpg"], "avg_ratings": ["\n  3.72\n"], "num_reviews": ["\n  ", "\n  8,113\n  ratings\n"], "genres": ["Fantasy", "Science Fiction", "Steampunk", "Young Adult", "Fiction", "Fantasy", "Magic", "Romance"], "title": "Cold Magic", "author": "Kate Elliott", "num_pages": "528", "awards": ["DABWAHA Romance Tournament for Best Novel with Romantic Elements/Crossover (2011)"], "places": [], "character_names": ["Catherine “Cat” Hassi Barahal", "Beatrice Hassi Barahal", "Andevai Diarisso Haranwy"], "language": "English", "ISBN": "1841498815", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/18273407-the-heidelberg-ghost", "image": ["https://images.gr-assets.com/books/1375299161l/18273407.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  70\n  ratings\n"], "genres": ["Fantasy", "Paranormal", "Romance", "Womens Fiction", "Chick Lit", "Fiction"], "title": "The Heidelberg Ghost", "author": "Nickie Cochran", "num_pages": "254", "awards": [], "places": ["Heidelberg", "Germany"], "character_names": [], "language": "English", "description": [" - Even If You Don't.", " Life is good for Andrea - until that fateful night of the annual ball at the Heidelberg castle, when a muck-covered ring lands next to her foot in the courtyard. Attached to this antique ring appears to be a very handsome ghost. Good thing that she isn't looking for love any time soon, because how ridiculous would it be of her to fall in love with a spirit, right?", " After being accused of stealing the princess' heirloom ring and jewelry box, Volker finds himself cursed by a witch and trapped on the castle grounds for over 400 years with no glimmer of hope for his miserable ghostly condition to improve. When he realizes that the pox-covered, yet beautiful, peasant woman standing in the courtyard can see him, he knows that she's the one that can set him free. The only trouble is that he's falling head over heels in love with the one that he can never be with.", " ~ Set in Germany with its rich history, traditions, and beliefs (yeah, Ireland is not the only place with cool castles, ya know!)", " ~ It'll make you laugh... and it'll make you cry...", " ~ A modern day fairy-tale that'll make you forget, you had dinner cooking on the stove...", "- Margaret (Literary Chanteuse) -", "- Jonel Boyko -", "- Sara Wheeldon -"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/6977769-61-hours", "image": ["https://images.gr-assets.com/books/1320512665l/6977769.jpg"], "avg_ratings": ["\n  4.10\n"], "num_reviews": ["\n  ", "\n  60,735\n  ratings\n"], "genres": ["Thriller", "Fiction", "Mystery", "Mystery", "Crime", "Suspense"], "title": "61 Hours", "author": "Lee Child", "num_pages": "383", "awards": ["Goodreads Choice Award Nominee for Mystery and Thriller (2010)", "Theakston Old Peculier Crime Novel of the Year (2011)"], "places": ["South Dakota"], "character_names": ["Major Susan Turner", "Jack Reacher"], "language": "English", "ISBN": "0385340583", "description": ["Jack Reacher is back. ", "The countdown has begun. Get ready for the most exciting 61 hours of your life. #1 \"New York Times\" bestselling author Lee Child's latest thriller is a ticking time bomb of suspense that builds electric tension on every page. ", "Sixty-one hours. Not a minute to spare. ", "A tour bus crashes in a savage snowstorm and lands Jack Reacher in the middle of a deadly confrontation. In nearby Bolton, South Dakota, one brave woman is standing up for justice in a small town threatened by sinister forces. If she's going to live long enough to testify, she'll need help. Because a killer is coming to Bolton, a coldly proficient assassin who never misses. ", "Reacher's original plan was to keep on moving. But the next 61 hours will change everything. The secrets are deadlier and his enemies are stronger than he could have guessed--but so is the woman whose life he'll risk his own to save. ", "In 61 Hours, Lee Child has written a showdown thriller with an explosive ending that readers will talk about for a long time to come."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/12247628-a-killer-s-christmas-in-wales", "image": ["https://images.gr-assets.com/books/1328307847l/12247628.jpg"], "avg_ratings": ["\n  3.66\n"], "num_reviews": ["\n  ", "\n  625\n  ratings\n"], "genres": ["Mystery", "Holiday", "Christmas", "Mystery", "Cozy Mystery", "Holiday"], "title": "A Killer's Christmas in Wales", "author": "Elizabeth J. Duncan", "num_pages": "285", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["As the townsfolk of the Welsh valley town of Llanelen settle in for the snowiest winter in twenty-five years, an American stranger arrives. Harry Saunders charms the ladies, one of them in particular: Evelyn Lloyd, the town's former postmistress, who was left comfortably off after the death of her husband. After Mrs. Lloyd invests a good deal of money with him, Harry goes missing, as does her money. His body is soon discovered outside the walls of Conwy Castle, and Mrs. Lloyd is implicated in the murder.", "Although Penny Brannigan and her business partner, Victoria Hopkirk, are busy overseeing the grand opening of their new spa, that doesn't stop Mrs. Lloyd from desperately seeking Penny's help to prove her innocence. It's quite possible that Harry made other enemies while in Llanelen and Penny's investigation unfolds while she juggles her work at the spa, her growing relationship with Detective Inspector Davies, and the Christmas window competition that she signed up to judge.", "With 'A Killer's Christmas in Wales', Elizabeth J. Duncan delivers a delightful holiday-themed mystery."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/9409469-the-gray-wolf-throne", "image": ["https://images.gr-assets.com/books/1312142235l/9409469.jpg"], "avg_ratings": ["\n  4.39\n"], "num_reviews": ["\n  ", "\n  38,520\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Romance", "Fantasy", "High Fantasy"], "title": "The Gray Wolf Throne", "author": "Cinda Williams Chima", "num_pages": "517", "awards": [], "places": [], "character_names": ["Han Alister", "Princess Raisa ana’Marianna", "Amon Byrne", "Cat Tyburn"], "language": "English", "description": ["Han Alister thought he had already lost everyone he loved. But when he finds his friend Rebecca Morley near death in the Spirit Mountains, Han knows that nothing matters more than saving her. The costs of his efforts are steep, but nothing can prepare him for what he soon discovers: the beautiful, mysterious girl he knew as Rebecca is none other than Raisa ana’Marianna, heir to the Queendom of the Fells. Han is hurt and betrayed. He knows he has no future with a blueblood. And, as far as he’s concerned, the princess’s family as good as killed his own mother and sister. But if Han is to fulfill his end of an old bargain, he must do everything in his power to see Raisa crowned queen. ", "Meanwhile, some people will stop at nothing to prevent Raisa from ascending. With each attempt on her life, she wonders how long it will be before her enemies succeed. Her heart tells her that the thief-turned-wizard Han Alister can be trusted. She wants to believe it—he’s saved her life more than once. But with danger coming at her from every direction, Raisa can only rely on her wits and her iron-hard will to survive—and even that might not be enough.", "The Gray Wolf Throne is an epic tale of fierce loyalty, unbearable sacrifice, and the heartless hand of fate."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/118755.Winter_of_Fire", "image": ["https://images.gr-assets.com/books/1476951995l/118755.jpg"], "avg_ratings": ["\n  4.31\n"], "num_reviews": ["\n  ", "\n  2,057\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction", "Science Fiction", "Dystopia"], "title": "Winter of Fire", "author": "Sherryl Jordan", "num_pages": "321", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0590452894", "description": ["In a grim future world where the sun has vanished from the sky, people glean what warmth and light they can from the firestones mined by an untouchable caste known as the Quelled. Countless taboos are shattered when Elsha, an idealistic and rebellious Quelled girl, is chosen to be handmaid to the Firelord--the man revered by those calling themselves the Chosen. Traveling in the privileged class, Elsha encounters ugly, unthinking prejudice; she also meets a few relatively enlightened Chosen men, who cannot help falling in love with the feisty maid. Spurred on by a hatred of injustice, Elsha battles against sexism, improves life for the Quelled, and even (it seems) hastens the return of the sun to her world."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/11100431-heir-of-novron", "image": ["https://images.gr-assets.com/books/1307960132l/11100431.jpg"], "avg_ratings": ["\n  4.47\n"], "num_reviews": ["\n  ", "\n  34,509\n  ratings\n"], "genres": ["Fantasy", "Fantasy", "Epic Fantasy", "Fiction", "Adventure", "Audiobook"], "title": "Heir of Novron", "author": "Michael J. Sullivan", "num_pages": "932", "awards": [], "places": [], "character_names": ["Royce Melborn", "Hadrian Blackwater", "Alric Essendon", "Myron Lanaklin", "Arista Essendon"], "language": "English", "ISBN": "0316187712", "description": ["The New Empire intends to celebrate its victory over the Nationalists with a day that will never be forgotten. On the high holiday of Wintertide, they plan to execute two traitors (Degan Gaunt and the Witch of Melengar) as well as force the Empress into a marriage of their own design. But they didn’t account for Royce and Hadrian finally locating the Heir of Novron—or the pair’s desire to wreak havoc on the New Empire’s carefully crafted scheme."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/161887.East", "image": ["https://images.gr-assets.com/books/1277997811l/161887.jpg"], "avg_ratings": ["\n  4.15\n"], "num_reviews": ["\n  ", "\n  35,021\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Retellings", "Fiction"], "title": "East", "author": "Edith Pattou", "num_pages": "507", "awards": ["Michigan Library Association Thumbs Up! Award Nominee (2004)", "Rebecca Caudill Young Readers' Book Award Nominee (2008)"], "places": [], "character_names": [], "language": "English", "ISBN": "0152052216", "description": [" ", " ", " "]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/332725.The_Snow_Walker_Trilogy", "image": ["https://images.gr-assets.com/books/1327899999l/332725.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  1,222\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction", "Young Adult", "Young Adult Fantasy", "Fantasy", "Magic", "Adventure", "Childrens", "Fantasy", "High Fantasy", "Young Adult", "Teen", "Fantasy", "Epic Fantasy"], "title": "The Snow-Walker Trilogy", "author": "Catherine Fisher", "num_pages": "480", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0099448068", "description": ["From the swirling mists and icy depths beyond the edge of the world came the snow-walker Gudrun, to rule the Jarl's people with fear and sorcery. But a small band of outlaws are prepared to risk their lives to defeat Gudrun and restore the land to its rightful leader. This trilogy follows them in their quest, from the first terrifying journey to meet the mysterious snow-walker's son, to the final battle in the lands beyond the rainbow bridge. The Snow-walker's Son follows Jessa and Thorkil who, are sent to Thrasirshall in the empty wastelands to live with the mysterious Kari, Gudrun's son. Led to believe Kari is some kind of monster they are shocked to discover he is a snow-walker, just like Gudrun, except with the desire to do good rather than evil. Together they journey back to the Jarshold to defeat Gudrun. In The Empty Hand Gudrun seeks revenge on those who banished her and sends a terrifying, faceless creature to the Jarlshold, and in The Soul Thieves, Kari and his companions must travel to the land of the snow-walkers to claim back the precious souls Gudrun has stolen. Here, Kari and Gudrun, mother and son and ultimate opponents, must fight their final battle."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/17225892-weavers", "image": ["https://images.gr-assets.com/books/1357870615l/17225892.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  1,766\n  ratings\n"], "genres": ["Fantasy", "Science Fiction", "Dystopia", "Young Adult", "Romance"], "title": "Weavers", "author": "Kate Avery Ellison", "num_pages": "290", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "148186386X", "description": ["Every day, life in the Frost grows increasingly perilous for its inhabitants. The Farther occupation continues, and food is becoming scarce. And Lia Weaver’s family is facing increasing perils, too—Jonn pushes his health to the brink as he works to uncover the secrets of Echlos, and Ivy risks everything to get food for the family. And for the second time, the Weaver family is harboring a fugitive, but Lia doesn’t trust her.", "Lia has personally braved many struggles—a Farther occupation, family secrets, a heart torn between two men, and Watcher attacks—as she struggles to keep her family safe. But now she will face her greatest challenge and uncover the Frost’s deepest secrets as she completes her most dangerous mission yet for the Thorns."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13568903-thorns", "image": ["https://images.gr-assets.com/books/1344566541l/13568903.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  2,059\n  ratings\n"], "genres": ["Fantasy", "Science Fiction", "Dystopia", "Young Adult", "Romance"], "title": "Thorns", "author": "Kate Avery Ellison", "num_pages": "266", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1479246360", "description": ["Sequel to \"Frost\".", "Lia Weaver went against everything she’d ever known when she risked her life to help a Farther fugitive named Gabe escape from the Aeralian soldiers, and her life changed forever. And the Frost changed, too—the Farthers have taken over her village, a new group of vigilantes calling themselves the Blackcoats are making plans to overthrow the Farther occupiers, and the Thorns are seeking for her to join them.", "Lia seeks to fight back against the evil and injustice that has swallowed up her home, but danger lurks at every turn. The monsters that dwell in the deepest regions of the Frost are growing bolder and more dangerous every day, a Farther noble takes up residence in the village on a mysterious mission, and Lia discovers that her parents were harboring even more secrets.", "As the frozen world of the Frost grows even more perilous, can Lia survive"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/15702859-the-winter-witch", "image": ["https://images.gr-assets.com/books/1388629796l/15702859.jpg"], "avg_ratings": ["\n  3.64\n"], "num_reviews": ["\n  ", "\n  10,284\n  ratings\n"], "genres": ["Fantasy", "Historical", "Historical Fiction", "Fiction", "Paranormal", "Witches", "Romance", "Fantasy", "Paranormal", "Fantasy", "Magic", "Historical"], "title": "The Winter Witch", "author": "Paula Brackston", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1250001315", "description": ["In her small early nineteenth century Welsh town, there is no one quite like Morgana, who has not spoken since she was a young girl. Her silence is a mystery, as well as her magic. Concerned for her safety, her mother is anxious to see her married, and Cai Jenkins, a widower from the far hills, seems the best choice.", "After her wedding, Morgana is heartbroken at leaving her mother, and wary of this man, whom she does not know, and who will take her away to begin a new life. But she soon falls in love with Cai’s farm and the wild mountains that surround it. Cai works to understand the beautiful, half-tamed creature he has chosen for a bride, and slowly, he begins to win Morgana’s affections. It’s not long, however, before her strangeness begins to be remarked upon in her new village. A dark force is at work there—a person who will stop at nothing to turn the townspeople against Morgana. Forced to defend her home, her man, and herself, Morgana must learn to harness her power, or she will lose everything."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/271295.A_Cold_Day_For_Murder", "image": ["https://images.gr-assets.com/books/1547852532l/271295.jpg"], "avg_ratings": ["\n  3.73\n"], "num_reviews": ["\n  ", "\n  12,139\n  ratings\n"], "genres": ["Mystery", "Fiction", "Mystery", "Crime", "Thriller", "Mystery Thriller"], "title": "A Cold Day For Murder", "author": "Dana Stabenow", "num_pages": "208", "awards": ["Edgar Award for Best Paperback Original (1993)"], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin"], "language": "English", "ISBN": "042513301X", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13642956-cover-of-snow", "image": ["https://images.gr-assets.com/books/1352422836l/13642956.jpg"], "avg_ratings": ["\n  3.36\n"], "num_reviews": ["\n  ", "\n  5,968\n  ratings\n"], "genres": ["Mystery", "Fiction", "Suspense", "Thriller", "Mystery Thriller"], "title": "Cover of Snow", "author": "Jenny Milchman", "num_pages": "320", "awards": ["Mary Higgins Clark Award (2014)"], "places": [], "character_names": [], "language": "English", "ISBN": "0345534212", "description": ["Waking up one wintry morning in her old farmhouse nestled in the Adirondack Mountains of New York, Nora Hamilton instantly knows that something is wrong. When her fog of sleep clears, she finds her world is suddenly, irretrievably shattered: Her husband, Brendan, has committed suicide.", "The first few hours following Nora’s devastating discovery pass for her in a blur of numbness and disbelief. Then, a disturbing awareness slowly settles in: Brendan left no note and gave no indication that he was contemplating taking his own life. Why would a rock-solid police officer with unwavering affection for his wife, job, and quaint hometown suddenly choose to end it all? Having spent a lifetime avoiding hard truths, Nora must now start facing them.", "Unraveling her late husband’s final days, Nora searches for an explanation—but finds a bewildering resistance from Brendan’s best friend and partner, his fellow police officers, and his brittle mother. It quickly becomes clear to Nora that she is asking questions no one wants to answer. For beneath the soft cover of snow lies a powerful conspiracy that will stop at nothing to keep its presence unknown . . . and its darkest secrets hidden."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/271296.A_Cold_Blooded_Business", "image": ["https://images.gr-assets.com/books/1388348007l/271296.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  3,064\n  ratings\n"], "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "A Cold-Blooded Business", "author": "Dana Stabenow", "num_pages": "231", "awards": [], "places": [], "character_names": ["Kate Shugak", "Cindy Sovalik", "Jerry McIsaac"], "language": "English", "ISBN": "0425158497", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13547386-shiver", "image": ["https://images.gr-assets.com/books/1338697580l/13547386.jpg"], "avg_ratings": ["\n  3.71\n"], "num_reviews": ["\n  ", "\n  4,972\n  ratings\n"], "genres": ["Romance", "Romance", "Romantic Suspense", "Mystery", "Suspense", "Thriller", "Fiction"], "title": "Shiver", "author": "Karen Robards", "num_pages": "385", "awards": [], "places": ["East St. Louis, Illinois"], "character_names": ["Tyler Jones", "Ramon Marco, aka Quasimodo, Danny Panterro", "Crittenden, Sanders, Groves, O'Brien"], "language": "English", "ISBN": "1451678673", "description": ["Samantha Jones is the best damn repo woman on the books. The streetwalkers, the drug pushers, the bands of looking-for-trouble punks haunting the mean streets at midnight don’t intimidate her. These are her people. The guy she finds bound and bloodied in the trunk of a flashy new BMW is a different breed entirely.", "Daniel Panterro knows he hasn’t seen the last of the vicious drug runners who kidnapped him from protective custody and left him for dead. His only recourse is to take his pretty savior and her four-year-old son hostage and force her to help him. With ruthless killers stalking their trail, Sam must trust this handsome, menacing stranger. But as she relinquishes control, she feels an unmistakable desire. What is the price of falling in love with a man who operates on the edge of danger—her heart, her life . . . or both?"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/672616.Dead_In_The_Water", "image": ["https://images.gr-assets.com/books/1351456281l/672616.jpg"], "avg_ratings": ["\n  4.15\n"], "num_reviews": ["\n  ", "\n  4,755\n  ratings\n"], "genres": ["Mystery", "Fiction", "Mystery", "Crime"], "title": "Dead In The Water", "author": "Dana Stabenow", "num_pages": "217", "awards": [], "places": [], "character_names": ["Jack Morgan", "Kate Shugak", "Jim Chopin", "Bernie Koslowski", "Andy Pence", "Seth Skinner"], "language": "English", "ISBN": "042513749X", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/17279079-ice-will-reveal", "image": ["https://images.gr-assets.com/books/1358871034l/17279079.jpg"], "avg_ratings": ["\n  4.19\n"], "num_reviews": ["\n  ", "\n  21\n  ratings\n"], "genres": ["Fantasy", "Fiction"], "title": "Ice Will Reveal", "author": "Julia Dvorin", "num_pages": "314", "awards": ["Kindle Book Award Nominee for Sci-Fi/Fantasy (Semi-Finalist) (2013)"], "places": [], "character_names": [], "language": "English", "description": ["Orphaned siblings Jarrod and Whisper Thornn grew up as “mercy kids” at the powerful Holy Temple of the One Goddess. Devout, law-abiding Jarrod became a loyal Temple Guardian, whereas restless, unscrupulous Whisper escaped to an apprenticeship with a rich thief as soon as she came of age. For years, they have barely seen or needed each other.", "Then, Whisper accepts a dangerous mission to steal an arcane artifact wanted by the Temple. Meanwhile, the Temple has named Jarrod as the Foretold, the One who will heal the land and turn the absent Goddess back to Her people. But prophecy is open to interpretation, and the priestesses of the Order of the Sickle have named one of their own as the Foretold. Jarrod’s test: he and his companions must investigate a breach in the magical Boundary that has long protected the land of Caledendria from the apocalyptic influence of the Blight. ", "When Jarrod and Whisper’s paths unexpectedly converge, Whisper joins Jarrod and his companions on a harrowing journey to seal the breach in the Boundary. Together, they must battle life-sucking wraiths and face loss and betrayal as they hurtle toward a fateful encounter at the Boundary."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/293072.The_Winter_Garden_Mystery", "image": ["https://images.gr-assets.com/books/1327886560l/293072.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  4,114\n  ratings\n"], "genres": ["Mystery", "Historical", "Historical Fiction", "Historical", "Fiction", "Mystery", "Historical Mystery", "Mystery", "Cozy Mystery"], "title": "The Winter Garden Mystery", "author": "Carola Dunn", "num_pages": "256", "awards": [], "places": ["England"], "character_names": [], "language": "English", "ISBN": "1575667517", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/8260833-the-path-of-daggers", "image": ["https://images.gr-assets.com/books/1328321540l/8260833.jpg"], "avg_ratings": ["\n  3.91\n"], "num_reviews": ["\n  ", "\n  91,635\n  ratings\n"], "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy"], "title": "The Path of Daggers", "author": "Robert Jordan", "num_pages": "669", "awards": [], "places": [], "character_names": ["Birgitte Silverbow", "Rand (aka Rand al'Thor, Car'a'carn, Dragon Reborn, Chosen One, Coramoor)", "Mat (aka Matrim Cauthon)", "Perrin (aka Perrin t'Bashere Aybara)", "Faile (aka Faile ni Bashere t'Aybara)", "Moiraine (aka Moiraine Damodred)", "Elayne (aka Elayne Trakand)", "Nynaeve (aka Nynaeve ti al'Meara Mandragoran)", "Alise (aka Alise Tenjile)", "Bryne (aka Gareth Bryne)", "Flinn (aka Damer Flinn)", "Maighdin (aka Maighdin Dorlain)", "Dashiva (aka Corlan Dashiva)", "Lini (aka Lini Eltring)", "Aes Sedai Aviendha", "Egwene (aka Egwene al'Vere)", "Reanne (aka Reanne Corly)", "Masema (aka Masema Dagar)", "Romanda (aka Romanda Cassin)", "Weiramon (aka Weiramon Saniago)", "Torval (aka Peral Torval)", "Alanna (aka Alanna Mosvani)", "Seonid (aka Seonid Traighan)", "Lelaine (aka Lelaine Akashi)", "Morr (aka Fedwin Morr, Fedwin)", "Annoura Sedai", "Alliandre (aka Alliandre Maritha Kigarin)", "Gill (aka Basel Gill, Master Gill)", "Cadsuane (aka Cadsuane Melaidhrin)", "Seaine (aka Seaine Herimon)", "Hopwil (aka Eben Hopwil)", "Lews Therin (aka Lews Therin Telamon)", "Gedwyn (aka Charl Gedwyn)", "Gregorin (aka Gregorin Panar de Lushenos)", "Rochaid (aka Manel Rochaid)", "Berelain (aka Berelain sur Paendrag Paeron)", "Pevara (aka Pevara Tazanovni)", "Bashere (aka Davram t'Ghaline Bashere, Davram)", "Masuri (aka Masuri Sokawa)", "Taim (aka Mazrim Taim)", "Merana (aka Merana Ambrey)", "Dobraine (aka Dobraine Taborwin)", "Adeleas (aka Adeleas Namelle)", "Aemin", "Aemlyn (aka Aemlyn Carand)", "Agelmar (aka Agelmar Jagad)", "Aginor", "Ailil (aka Ailil Riatin)", "Aisling (aka Aisling Noon)", "Aledrin", "Alesune (aka Alesune Chulin)", "Alsalam (aka Alsalam Saeed Almadar)", "Alsbet (aka Alsbet Luhhan)", "Alviarin (aka Alviarin Freidhen)", "Amondrid Gueyam", "Amondrid Osiellin", "Anaiyella (aka Anaiyella Narencelona)", "Andaya (aka Andaya Forae)", "Aran'gar", "Arathelle (aka Arathelle Renshar)", "Arilyn (aka Arilyn Dhulaine)", "Arlen (aka Arlen Nalaam)", "Arrela (aka Arrela Shiego, Arella)", "Artur Hawkwing (aka Artur Paendrag Tanreall)", "Arymilla (aka Arymilla Marne)", "Assid Bakuun", "Baldhere", "Beldeine (aka Beldeine Nyram)", "Benly (aka Benly Coplin)", "Beonin (aka Beonin Marinye)", "Bera (aka Bera Harkin)", "Berana", "Bernaile (aka Bernaile Gelbarn)", "Bertain (aka Bertain Gallenne)", "Bertome (aka Bertome Saighan)", "Beslan (aka Beslan Mitsobar)", "Boreane (aka Boreane Carivin)", "Breane (aka Breane Taborwin)", "Caire (aka Caire din Gelyn Running Wave)", "Camaille (aka Camaille Nolaisen)", "Caraline (aka Caraline Damodred)", "Careane (aka Careane Fransi)", "Carelle", "Cemaile (aka Cemaile Sorenthaine)", "Cenn (aka Cenn Buie)", "Chaelin", "Lord Chianmai", "Chilares (aka Chilares Arman)", "Chulein", "Cian (aka Cian do Mehon a'Macansa)", "Cieryl (aka Cieryl Arjuna)", "Coiren (aka Coiren Saeldain)", "Coladara", "Colavaere (aka Colavaere Saighan)", "Colinda", "Corgaide (aka Corgaide Marendevin)", "Culhan (aka Culhan Carand)", "Cyndane", "Daigian (aka Daigian Moseneillin)", "Dalthanes (aka Dalthanes Annallin)", "Dark One", "Darlin (aka Lord Darlin Sisnera)", "Daved (aka Daved Hanlon)", "Daviena", "Deira (aka Deira ni Ghaline t'Bashere)", "Delana (aka Delana Mosalaine)", "Demandred", "Demetre (aka Demetre Marcolin)", "Denharad", "Desora", "Dimana", "Doesine (aka Doesine Alwain)", "Doile", "Donel (aka Donel do Morny a'Lordeine)", "Doressin (aka Doressin Chuliandred)", "Dorile (aka Dorile din Eiran Long Feather)", "Duhara (aka Duhara Basaheen)", "Dyelin (aka Dyelin Taravin)", "Eagan (aka Eagan Padros)", "Easar (aka Easar Togita)", "Einone", "Elaida (aka Elaida do Avriny a'Roihan)", "Eldase", "Elenia (aka Elenia Sarand)", "Ellorien (aka Ellorien Traemane)", "Elyas (aka Elyas Machera)", "Elza (aka Elza Penfell)", "Emerys", "Erian (aka Erian Boroleos)", "Ershin (aka Ershin Netari)", "Escaralde", "Ethenielle (aka Ethenielle Kirukan Materasu)", "Evin (aka Evin Hardlin, Hardlin)", "Faeldrin (aka Faeldrin Harella)", "Fain (aka Padan Fain)", "Faiselle", "Falion (aka Falion Bhoda)", "Falton", "Famelle (aka Famelle Juarde)", "Faolain (aka Faolain Orande)", "Farede", "Ferane (aka Ferane Neheran)", "Flann (aka Flann Barstere)", "Furen (aka Furen Alharra)", "Furyk (aka Furyk Karede, Karede)", "Gaebril (aka Lord Gaebril)", "Garenia (aka Garenia Rosoinde)", "Gawyn (aka Gawyn Trakand)", "Gerra (aka Gerra Kishar)", "Gharadin", "Grady (aka Jur Grady)", "Halima (aka Halima Saranov)", "Harine (aka Harine din Togara Two Winds)", "Herid (aka Herid Fel)", "Ieine", "Illeisien", "Ilyena (aka Ilyena Therin Moerelle)", "Irgain (aka Irgain Fatamed)", "Ishara (aka Ishara Maravaile)", "Ishigari (aka Ishigari Terasian)", "Ismic", "Ispan (aka Ispan Shefar)", "Jadranka", "Jaem", "Jaichim (aka Jaichim Carridin)", "Jak Masond", "Janya (aka Janya Frende)", "Jara (aka Jara Doweel, Doweel)", "Jarid (aka Jarid Sarand)", "Jenare", "Jeordwyn (aka Jeordwyn Semaris)", "Jeraal (aka Jeraal Mordeth, Mordeth)", "Jerasid", "Jillien", "Joline (aka Joline Maza)", "Jonan (aka Jonan Adley, Adley)", "Jondyn (aka Jondyn Barran)", "Jori (aka Jori Congar)", "Juilaine (aka Juilaine Madome)", "Kajima", "Kalyan (aka Kalyan Ramsin)", "Katerine (aka Katerine Alruddin)", "Kinhuin", "Kiril (aka Kiril Drapaneos)", "Kirstian (aka Kirstian Chalwin)", "Kirukan", "Kiruna (aka Kiruna Nachiman)", "Kisman (aka Raefar Kisman)", "Kumira", "Kurin", "Kwamesa", "Kyril (aka Kyril Shianri, Shianri)", "Lacile (aka Lacile Aldorwin)", "Laigin (aka Laigin Arnault)", "Laman (aka Laman Damodred)", "Lamgwin (aka Lamgwin Dorn)", "Lan (aka Lan Mandragoran)", "Leane (aka Leane Sharif)", "Liah", "Lioness", "Lisaine (aka Lisaine Jarath)", "Logain (aka Logain Ablar)", "Losaine", "Loversknot", "Luan (aka Luan Norwelyn)", "Luthair Paendrag (aka Luthair Paendrag Mondwhin)", "Lyrelle", "Macharan", "Magla (aka Magla Daronos)", "Malind (aka Malind Nachenin)", "Marline", "Martine (aka Martine Janata)", "Master Hornwell", "Mattin Stepaneos (aka Mattin Stepaneos den Balgar)", "Megairil", "Memara", "Menuki (aka Menuki Nachiman)", "Meralda", "Merilille (aka Merilille Ceandevin)", "Merya", "Metarra (aka Metarra din Junalle)", "Min (aka Elmindreda Farshaw)", "Miraj (aka Kennar Miraj)", "Mistress Hornwell", "Morgase (aka Morgase Trakand)", "Moria (aka Moria Karentanis)", "Myrelle (aka Myrelle Berengari)", "Myriam (aka Myriam Copan)", "Nadoc", "Naean (aka Naean Arawn)", "Naime", "Naiselle", "Narishma (aka Jahar Narishma)", "Nazelle", "Nazran", "Neald (aka Fager Neald)", "Negara (aka Lady Negara)", "Nerith", "Nesair", "Nesta (aka Nesta din Reas Two Moons)", "Nesune (aka Nesune Bihara)", "Nevarin", "Niall (aka Pedron Niall)", "Nianh", "Nildra", "Nisao (aka Nisao Dachen)", "Norlea", "Norley", "Nurelle (aka Havien Nurelle)", "Ortis", "Osan'gar", "Paitar (aka Paitar Nachiman)", "Paitr (aka Paitr do Fearna a'Conn)", "Parelean", "Pelivar (aka Pelivar Coelan)", "Rafela (aka Rafela Cindal)", "Rainyn", "Reene (aka Reene Harfor)", "Renaile (aka Renaile din Calon Blue Star)", "Rhadam (aka Rhadam Asunawa)", "Rina (aka Rina Hafden)", "Rodel (aka Rodel Ituralde, Ituralde)", "Roedran (aka Roedran Almaric do Arreloa a'Naloy)", "Rovair (aka Rovair Kirklin)", "Rubinde", "Rysael", "Saerin (aka Saerin Asnobar)", "Salita (aka Salita Toranes)", "Samalin", "Sarainya (aka Sarainya Vostovan)", "Sareitha (aka Sareitha Tomares)", "Sarene (aka Sarene Nemdahl)", "Saroiya", "Sedore (aka Sedore Dajenna)", "Segan (aka Segan do Avharin a'Roos)", "Segani", "Selande (aka Selande Darengil)", "Semaradrid (aka Semaradrid Maravin)", "Senine (aka Senine din Ryal)", "Lady Serailla", "Sereille (aka Sereille Bagand)", "Shalon (aka Shalon din Togara Morning Tide)", "Sharina (aka Sharina Melloy)", "Shein (aka Shein Chunla)", "Shevan", "Shiaine (aka Shiaine Avarhin)", "Sibella", "Silviana (aka Silviana Brehon)", "Siuan (aka Siuan Sanche)", "Spiron (aka Spiron Narettin)", "Stayer", "Suana (aka Suana Dragand)", "Sumeko (aka Sumeko Karistovan)", "Sunamon (aka Sunamon Haellin)", "Surasa", "Suroth (aka Suroth Sabelle Meldarath)", "Tai'daishar", "Talaan (aka Talaan din Gelyn)", "Talene (aka Talene Minly)", "Tallanvor (aka Martyn Tallanvor)", "Talmanes (aka Talmanes Delovinde)", "Tam (aka Tamlin al'Thor)", "Tamra (aka Tamra Ospenya)", "Tauan", "Tebreille (aka Tebreille din Gelyn South Wind)", "Lord Telabin", "Tenobia (aka Tenobia si Bashere Kazadi)", "Teryl (aka Teryl Wynter)", "Teslyn (aka Teslyn Baradon)", "The Creator", "Theodrin (aka Theodrin Dabei)", "Thom (aka Thomdril Merrilin)", "Tialin", "Tiam (aka Tiam of Gazar)", "Tiana (aka Tiana Noselle)", "Tihera (aka Rodrivar Tihera)", "Tiras", "Tolmeran", "Toma (aka Toma dur Ahmid)", "Toram (aka Toram Riatin)", "Torean (aka Torean Andiama)", "Toveine (aka Toveine Gazal)", "Tsorovan'm'hael", "Turanna (aka Turanna Norill)", "Tylin (aka Tylin Quintara Mitsobar)", "Uno (aka Uno Nomesta)", "Uren (aka Uren din Jubai Soaring Gull)", "Valda (aka Eamon Valda)", "Vandene (aka Vandene Namelle)", "Vanin (aka Chel Vanin)", "Varek", "Varil (aka Varil Nensen)", "Velina (aka Velina Behar)", "Verin (aka Verin Mathwin)", "Vinchova", "Yukiri", "Yulan (aka Abaldar Yulan)", "Zakai", "Zarya (aka Zarya Alkaese)", "Zerah (aka Zerah Dacan)", "Mistress Maighdin", "Cha Faile", "Lord Dobraine Taborwin", "Mistress Doweel", "Lord Donel", "Nynaeve Sedai", "Siuan Sedai", "Lady Shiaine", "Lord Perrin Aybara", "Tairen dog Weiramon", "Lord Chianmai", "Chilares (aka Chilares Arman)", "Chulein", "Cian (aka Cian do Mehon a'Macansa)", "Cieryl (aka Cieryl Arjuna)", "Coiren (aka Coiren Saeldain)", "Coladara", "Colavaere (aka Colavaere Saighan)", "Colinda", "Corgaide (aka Corgaide Marendevin)", "Culhan (aka Culhan Carand)", "Cyndane", "Daigian (aka Daigian Moseneillin)", "Dalthanes (aka Dalthanes Annallin)", "Dark One", "Darlin (aka Lord Darlin Sisnera)", "Daved (aka Daved Hanlon)", "Daviena", "Deira (aka Deira ni Ghaline t'Bashere)", "Delana (aka Delana Mosalaine)", "Demandred", "Demetre (aka Demetre Marcolin)", "Denharad", "Desora", "Dimana", "Doesine (aka Doesine Alwain)", "Doile", "Donel (aka Donel do Morny a'Lordeine)", "Doressin (aka Doressin Chuliandred)", "Dorile (aka Dorile din Eiran Long Feather)", "Duhara (aka Duhara Basaheen)", "Dyelin (aka Dyelin Taravin)", "Eagan (aka Eagan Padros)", "Easar (aka Easar Togita)", "Einone", "Elaida (aka Elaida do Avriny a'Roihan)", "Eldase", "Elenia (aka Elenia Sarand)", "Ellorien (aka Ellorien Traemane)", "Elyas (aka Elyas Machera)", "Elza (aka Elza Penfell)", "Emerys", "Erian (aka Erian Boroleos)", "Ershin (aka Ershin Netari)", "Escaralde", "Ethenielle (aka Ethenielle Kirukan Materasu)", "Evin (aka Evin Hardlin, Hardlin)", "Faeldrin (aka Faeldrin Harella)", "Fain (aka Padan Fain)", "Faiselle", "Falion (aka Falion Bhoda)", "Falton", "Famelle (aka Famelle Juarde)", "Faolain (aka Faolain Orande)", "Farede", "Ferane (aka Ferane Neheran)", "Flann (aka Flann Barstere)", "Furen (aka Furen Alharra)", "Furyk (aka Furyk Karede, Karede)", "Gaebril (aka Lord Gaebril)", "Garenia (aka Garenia Rosoinde)", "Gawyn (aka Gawyn Trakand)", "Gerra (aka Gerra Kishar)", "Gharadin", "Grady (aka Jur Grady)", "Halima (aka Halima Saranov)", "Harine (aka Harine din Togara Two Winds)", "Herid (aka Herid Fel)", "Ieine", "Illeisien", "Ilyena (aka Ilyena Therin Moerelle)", "Irgain (aka Irgain Fatamed)", "Ishara (aka Ishara Maravaile)", "Ishigari (aka Ishigari Terasian)", "Ismic", "Ispan (aka Ispan Shefar)", "Jadranka", "Jaem", "Jaichim (aka Jaichim Carridin)", "Jak Masond", "Janya (aka Janya Frende)", "Jara (aka Jara Doweel, Doweel)", "Jarid (aka Jarid Sarand)", "Jenare", "Jeordwyn (aka Jeordwyn Semaris)", "Jeraal (aka Jeraal Mordeth, Mordeth)", "Jerasid", "Jillien", "Joline (aka Joline Maza)", "Jonan (aka Jonan Adley, Adley)", "Jondyn (aka Jondyn Barran)", "Jori (aka Jori Congar)", "Juilaine (aka Juilaine Madome)", "Kajima", "Kalyan (aka Kalyan Ramsin)", "Katerine (aka Katerine Alruddin)", "Kinhuin", "Kiril (aka Kiril Drapaneos)", "Kirstian (aka Kirstian Chalwin)", "Kirukan", "Kiruna (aka Kiruna Nachiman)", "Kisman (aka Raefar Kisman)", "Kumira", "Kurin", "Kwamesa", "Kyril (aka Kyril Shianri, Shianri)", "Lacile (aka Lacile Aldorwin)", "Laigin (aka Laigin Arnault)", "Laman (aka Laman Damodred)", "Lamgwin (aka Lamgwin Dorn)", "Lan (aka Lan Mandragoran)", "Leane (aka Leane Sharif)", "Liah", "Lioness", "Lisaine (aka Lisaine Jarath)", "Logain (aka Logain Ablar)", "Losaine", "Loversknot", "Luan (aka Luan Norwelyn)", "Luthair Paendrag (aka Luthair Paendrag Mondwhin)", "Lyrelle", "Macharan", "Magla (aka Magla Daronos)", "Malind (aka Malind Nachenin)", "Marline", "Martine (aka Martine Janata)", "Master Hornwell", "Mattin Stepaneos (aka Mattin Stepaneos den Balgar)", "Megairil", "Memara", "Menuki (aka Menuki Nachiman)", "Meralda", "Merilille (aka Merilille Ceandevin)", "Merya", "Metarra (aka Metarra din Junalle)", "Miraj (aka Kennar Miraj)", "Mistress Hornwell", "Morgase (aka Morgase Trakand)", "Moria (aka Moria Karentanis)", "Myrelle (aka Myrelle Berengari)", "Myriam (aka Myriam Copan)", "Nadoc", "Naean (aka Naean Arawn)", "Naime", "Naiselle", "Narishma (aka Jahar Narishma)", "Nazelle", "Nazran", "Neald (aka Fager Neald)", "Negara (aka Lady Negara)", "Nerith", "Nesair", "Nesta (aka Nesta din Reas Two Moons)", "Nesune (aka Nesune Bihara)", "Nevarin", "Niall (aka Pedron Niall)", "Nianh", "Nildra", "Nisao (aka Nisao Dachen)", "Norlea", "Norley", "Nurelle (aka Havien Nurelle)", "Ortis", "Osan'gar", "Paitar (aka Paitar Nachiman)", "Paitr (aka Paitr do Fearna a'Conn)", "Parelean", "Pelivar (aka Pelivar Coelan)", "Rafela (aka Rafela Cindal)", "Rainyn", "Reene (aka Reene Harfor)", "Renaile (aka Renaile din Calon Blue Star)", "Rhadam (aka Rhadam Asunawa)", "Rina (aka Rina Hafden)", "Rodel (aka Rodel Ituralde, Ituralde)", "Roedran (aka Roedran Almaric do Arreloa a'Naloy)", "Rovair (aka Rovair Kirklin)", "Rubinde", "Rysael", "Saerin (aka Saerin Asnobar)", "Salita (aka Salita Toranes)", "Samalin", "Sarainya (aka Sarainya Vostovan)", "Sareitha (aka Sareitha Tomares)", "Sarene (aka Sarene Nemdahl)", "Saroiya", "Sedore (aka Sedore Dajenna)", "Segan (aka Segan do Avharin a'Roos)", "Segani", "Selande (aka Selande Darengil)", "Semaradrid (aka Semaradrid Maravin)", "Senine (aka Senine din Ryal)", "Lady Serailla", "Sereille (aka Sereille Bagand)", "Shalon (aka Shalon din Togara Morning Tide)", "Sharina (aka Sharina Melloy)", "Shein (aka Shein Chunla)", "Shevan", "Shiaine (aka Shiaine Avarhin)", "Sibella", "Silviana (aka Silviana Brehon)", "Spiron (aka Spiron Narettin)", "Stayer", "Suana (aka Suana Dragand)", "Sumeko (aka Sumeko Karistovan)", "Sunamon (aka Sunamon Haellin)", "Surasa", "Suroth (aka Suroth Sabelle Meldarath)", "Tai'daishar", "Talaan (aka Talaan din Gelyn)", "Talene (aka Talene Minly)", "Tallanvor (aka Martyn Tallanvor)", "Talmanes (aka Talmanes Delovinde)", "Tam (aka Tamlin al'Thor)", "Tamra (aka Tamra Ospenya)", "Tauan", "Tebreille (aka Tebreille din Gelyn South Wind)", "Lord Telabin", "Tenobia (aka Tenobia si Bashere Kazadi)", "Teryl (aka Teryl Wynter)", "Teslyn (aka Teslyn Baradon)", "The Creator", "Theodrin (aka Theodrin Dabei)", "Thom (aka Thomdril Merrilin)", "Tialin", "Tiam (aka Tiam of Gazar)", "Tiana (aka Tiana Noselle)", "Tihera (aka Rodrivar Tihera)", "Tiras", "Tolmeran", "Toma (aka Toma dur Ahmid)", "Toram (aka Toram Riatin)", "Torean (aka Torean Andiama)", "Toveine (aka Toveine Gazal)", "Tsorovan'm'hael", "Turanna (aka Turanna Norill)", "Tylin (aka Tylin Quintara Mitsobar)", "Uno (aka Uno Nomesta)", "Uren (aka Uren din Jubai Soaring Gull)", "Valda (aka Eamon Valda)", "Vandene (aka Vandene Namelle)", "Vanin (aka Chel Vanin)", "Varek", "Varil (aka Varil Nensen)", "Velina (aka Velina Behar)", "Verin (aka Verin Mathwin)", "Vinchova", "Yukiri", "Yulan (aka Abaldar Yulan)", "Zakai", "Zarya (aka Zarya Alkaese)", "Zerah (aka Zerah Dacan)", "Mistress Maighdin", "Cha Faile", "Lord Dobraine Taborwin", "Mistress Doweel", "Lord Donel", "Nynaeve Sedai", "Siuan Sedai", "Lady Shiaine", "Lord Perrin Aybara", "Tairen dog Weiramon"], "language": "English", "description": ["The Seanchan invasion force is in possession of Ebou Dar. Nynaeve, Elayne, and Aviendha head for Caemlyn and Elayne's rightful throne, but on the way they discover an enemy much worse than the Seanchan.", "In Illian, Rand vows to throw the Seanchan back as he did once before. But signs of madness are appearing among the Asha'man.", "In Ghealdan, Perrin faces the intrigues of Whitecloaks, Seanchan invaders, the scattered Shaido Aiel, and the Prophet himself. Perrin's beloved wife, Faile, may pay with her life, and Perrin himself may have to destroy his soul to save her.", "Meanwhile the rebel Aes Sedai under their young Amyrlin, Egwene al'Vere, face an army that intends to keep them away from the White Tower. But Egwene is determined to unseat the usurper Elaida and reunite the Aes Sedai. She does not yet understand the price that others—and she herself—will pay."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/7877549-starcrossed", "image": ["https://images.gr-assets.com/books/1390068383l/7877549.jpg"], "avg_ratings": ["\n  3.79\n"], "num_reviews": ["\n  ", "\n  6,578\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fantasy", "Magic", "Adventure", "Fiction"], "title": "StarCrossed", "author": "Elizabeth C. Bunce", "num_pages": "362", "awards": ["Milwaukee County Teen Book Award Nominee (2012)", "Eliot Rosewater Indiana High School Book Award Nominee (2012)"], "places": [], "character_names": [], "language": "English", "ISBN": "0545136059", "description": ["Digger thrives as a spy and sneak-thief among the feuding religious factions of Gerse, dodging the Greenmen who have banned all magic. But when a routine job goes horribly wrong and her partner and lover Tegen is killed, she has to get out of the city, fast, and hides herself in a merry group of nobles to do so. ", "Accepted as a lady's maid to shy young Merista Nemair, Digger finds new peace and friendship at the Nemair stronghold--as well as plenty of jewels for the taking.", "But after the devious Lord Daul catches her in the act of thievery, he blackmails her into becoming his personal spy in the castle, and Digger soon realizes that her noble hosts aren't as apolitical as she thought... that indeed, she may be at the heart of a magical rebellion."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/1384387.Shoulder_the_Sky", "image": ["https://images.gr-assets.com/books/1358976971l/1384387.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  589\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Cultural", "Scotland", "Romance"], "title": "Shoulder the Sky", "author": "D.E. Stevenson", "num_pages": "407", "awards": [], "places": ["Scotland"], "character_names": [], "language": "English", "ISBN": "1560543434", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/116054.Winter_Solstice", "image": ["https://images.gr-assets.com/books/1347737313l/116054.jpg"], "avg_ratings": ["\n  4.15\n"], "num_reviews": ["\n  ", "\n  19,972\n  ratings\n"], "genres": ["Fiction", "Romance", "Holiday", "Christmas", "Cultural", "Scotland", "Womens Fiction", "Chick Lit"], "title": "Winter Solstice", "author": "Rosamunde Pilcher", "num_pages": "698", "awards": ["Corine Internationaler Buchpreis for Weltbild Leserpreis (2001)"], "places": ["Creagan, Sutherland, Scotland", "Dornoch, Sutherland, Scotland"], "character_names": ["Elfrida Phipps"], "language": "English", "ISBN": "0340752483", "description": ["Her captivating bestseller of loss and the healing power of love now re-issued with a stunning new jacket look. Elfrida Phipps loves her new life in the pretty Hampshire village. She has a tiny cottage, her faithful dog Horace and the friendship of the neighbouring Blundells - particularly Oscar - to ensure that her days include companionship as well as independence. But an unforeseen tragedy upsets Elfrida's tranquillity: Oscar's wife and daughter are killed in a terrible car crash and he finds himself homeless when his stepchildren claim their dead mother's inheritance.", "Oscar and Elfrida take refuge in a rambling house in Scotland which becomes a magnet for various waifs and strays who converge upon it, including an unhappy teenage girl. It could be a recipe for disaster. But somehow the Christmas season weaves its magical spell and for Elfrida and Oscar, in the evening of their lives, the winter solstice brings love and solace."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/4070493-need", "image": ["https://images.gr-assets.com/books/1436293030l/4070493.jpg"], "avg_ratings": ["\n  3.71\n"], "num_reviews": ["\n  ", "\n  57,822\n  ratings\n"], "genres": ["Young Adult", "Fantasy", "Fantasy", "Paranormal", "Romance"], "title": "Need", "author": "Carrie Jones", "num_pages": "306", "awards": [], "places": [], "character_names": ["Nick Colt", "Betty", "Devyn", "Zara White", "Issie"], "language": "English", "ISBN": "1599903385", "description": ["Zara White suspects there's a freaky guy semi-stalking her. She's also obsessed with phobias. And it's true, she hasn't exactly been herself since her stepfather died. But exiling her to shivery Maine to live with her grandmother? That seems a bit extreme. The move is supposed to help her stay sane...but Zara's pretty sure her mom just can't deal with her right now.", "She couldn't be more wrong. Turns out the semi-stalker is not a figment of Zara's overactive imagination. In fact, he's still following her, leaving behind an eerie trail of gold dust. There's something not right - not human - in this sleepy Maine town, and all signs point to Zara.", "In this creepy, compelling breakout novel, Carrie Jones delivers romance, suspense, and a creature you never thought you'd have to fear."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/6599342-the-girl-with-the-dragon-tattoo", "image": ["https://images.gr-assets.com/books/1338358246l/6599342.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  2,227,116\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller", "Mystery", "Crime"], "title": "The Girl with the Dragon Tattoo", "author": "Stieg Larsson", "num_pages": "658", "awards": ["Barry Award for Mystery/Crime Novel Of The Decade (2010)", "Macavity Award for Best First Mystery Novel (2009)", "Anthony Award for Best First Novel (2009)", "Glass Key Award (2006)", "Galaxy British Book Awards for Crime Thriller of the Year (2009)", "Exclusive Books Boeke Prize (2008)", "Strand Critics Award  Nominee for Best First Novel (2008)"], "places": ["Stockholm", "Hedeby Island", "Hedestad, Stockholm"], "character_names": ["Lisbeth Salander", "Mikael Blomkvist", "Erika Berger", "Dragan Armansky", "Henrik Vanger", "Martin Vanger", "Cecilia Vanger", "Hans-Erik Wennerström", "Harriet Vanger", "Holger Palmgren", "Nils Bjurman", "Anita Vanger", "Birger Vanger", "Dirch Frode", "Christer Malm", "Gustaf Morell", "Isabella Vanger", "Gottfried Vanger", "Jan Köbin"], "language": "English", "description": ["Mikael Blomkvist, a once-respected financial journalist, watches his professional life rapidly crumble around him. Prospects appear bleak until an unexpected (and unsettling) offer to resurrect his name is extended by an old-school titan of Swedish industry. The catch—and there’s always a catch—is that Blomkvist must first spend a year researching a mysterious disappearance that has remained unsolved for nearly four decades. With few other options, he accepts and enlists the help of investigator Lisbeth Salander, a misunderstood genius with a cache of authority issues. Little is as it seems in Larsson’s novel, but there is at least one constant: you really ", " want to mess with the girl with the dragon tattoo."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/380452.Winter_Of_Discontent", "image": ["https://images.gr-assets.com/books/1388613339l/380452.jpg"], "avg_ratings": ["\n  3.74\n"], "num_reviews": ["\n  ", "\n  349\n  ratings\n"], "genres": ["Mystery", "Mystery", "Cozy Mystery", "Fiction", "European Literature", "British Literature"], "title": "Winter Of Discontent", "author": "Jeanne M. Dams", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0765308053", "description": ["Dorothy Martin's neighbor and closest friend, Jane Langland, has been having a fling with Bill Fanshawe--or, as much of a fling as two 80-year olds in a small town are allowed. Now there are rumors that Jane and Bill may move in together, and Dorothy needs to know exactly what's happening. What neither woman expects is that Bill is missing, and that within a day his body is going to be discovered in the tunnel under the Sherebury town museum.", "Why would anyone want to harm a harmless old man, a historian who loves the town and the people who live there? Given his age, and the strange letter found in his hand, Dorothy thinks that whatever happened has its roots in WWII. Everyone, including her husband, retired police office Alan, looks askance, but when another old man is murdered--a man who served at the same RAF base as Bill--no one denies Dorothy's suspicions may be right.", "Dorothy investigates, knowing that the best Christmas gift she can give her friend Jane is the truth about what happened to Bill. And Jane has a surprise of her own for Dorothy..."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/853496.A_Cry_In_The_Night", "image": ["https://images.gr-assets.com/books/1341761859l/853496.jpg"], "avg_ratings": ["\n  3.85\n"], "num_reviews": ["\n  ", "\n  14,882\n  ratings\n"], "genres": ["Mystery", "Fiction", "Suspense", "Thriller", "Thriller", "Mystery Thriller"], "title": "A Cry In The Night", "author": "Mary Higgins Clark", "num_pages": "340", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0671886665", "description": ["Mary Higgins Clark, the ", "bestselling \"Queen of Suspense\" shares another story filled with intrigue and mystery.", "When Jenny MacPartland meets the man of her dreams while working in a New York art gallery, she's ecstatic. Painter Erich Krueger -- whose exquisite landscapes are making him a huge success -- is handsome, sensitive...and utterly in love with her. They marry quickly and Jenny plans a loving home on Erich's vast Minnesota farm. But lonely days and eerie nights strain her nerves to the breaking point and test her sanity. Caught in a whirlpool of shattering events, Jenny soon unearths a past more terrifying than she dares imagine...tragic secrets that threaten her marriage, her children, her life."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/2322934.Snowfire", "image": ["https://images.gr-assets.com/books/1316329887l/2322934.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  845\n  ratings\n"], "genres": ["Mystery", "Romance", "Gothic", "Fiction", "Romance", "Romantic Suspense", "Gothic", "Gothic Romance", "Suspense"], "title": "Snowfire", "author": "Phyllis A. Whitney", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0385022646", "description": ["Eager to clear her step-brother of a murder charge, Linda Earle comes to a snow-covered ski resort in the Northeast, where she finds herself in a unique world of icy weather and fiery passions. In this new novel of romantic suspense Phyllis A. Whitney follows her young heroine into the storm of conflicting emotions that surrounds Greystones, a brooding Norman-style mansion with a foreboding past.", "The master of Greystones is Julian McCabe, a champion skier whose career was cut short by a tragic accident. He has been teacher and sponsor to Linda's talented step-brother. But now this promising young athlete is in jail, accused in the bizarre death of Julian's wife.", "Linda soon discovers that this death has cast its shadow over all the residents of Greystones. Julian's ethereal sister is full of tales of reincarnation and visions of more death. And his eight-year-old daughter is haunted by fear and guilt.", "A severe blizzard, a dangerous encounter in a stone tower, and a death on the slopes lead Linda to a discovery she has never expected. These, along with the striking characters that have always marked Phyllis Whitney as a true mistress of the genre, are some of the elements that she weaves into this spellbinding tale of romance and suspense."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/817566.The_Winter_Queen", "image": ["https://images.gr-assets.com/books/1384923542l/817566.jpg"], "avg_ratings": ["\n  3.88\n"], "num_reviews": ["\n  ", "\n  9,144\n  ratings\n"], "genres": ["Mystery", "Fiction", "Historical", "Historical Fiction", "Cultural", "Russia", "Mystery", "Crime", "Historical", "Mystery", "Detective"], "title": "The Winter Queen", "author": "Boris Akunin", "num_pages": "249", "awards": [], "places": ["Maskava"], "character_names": ["Erasts Fandorīns", "Lēdija Estere"], "language": "English", "ISBN": "0812968778", "description": ["Moscow, May 1876. What would cause a talented student from a wealthy family to shoot himself in front of a promenading public? Decadence and boredom, it is presumed. But young sleuth Erast Fandorin is not satisfied with the conclusion that this death is an open-and-shut case, nor with the preliminary detective work the precinct has done–and for good reason: The bizarre and tragic suicide is soon connected to a clear case of murder, witnessed firsthand by Fandorin himself. Relying on his keen intuition, the eager detective plunges into an investigation that leads him across Europe, landing him at the center of a vast conspiracy with the deadliest of implications."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/77364.Winter_Rose", "image": ["https://images.gr-assets.com/books/1386922670l/77364.jpg"], "avg_ratings": ["\n  3.85\n"], "num_reviews": ["\n  ", "\n  6,580\n  ratings\n"], "genres": ["Fantasy", "Fiction", "Fantasy", "Fairy Tales", "Young Adult", "Romance", "Retellings"], "title": "Winter Rose", "author": "Patricia A. McKillip", "num_pages": "262", "awards": ["Mythopoeic Fantasy Award Nominee (1997)"], "places": [], "character_names": ["Rois Melior", "Laurel Melior", "Corbet Lynn"], "language": "English", "ISBN": "0441004385", "description": ["Sorrow and trouble and bitterness will bound you and yours and the children of yours...", "Some said the dying words of Nial Lynn, murdered by his own son, were a wicked curse. To others, it was a winter's tale spun by firelight on cold, dark nights. But when Corbet Lynn came to rebuild his family estate, memories of his grandfather's curse were rekindled by young and old - and rumours filled the heavy air of summer.", "In the woods that border Lynn Hall, free-spirited Rois Melior roams wild and barefooted in search of healing herbs. She is as hopelessly unbridled - and unsuited for marriage - as her betrothed sister Laurel is domestic. In Corbet's pale green eyes, Rois senses a desperate longing. In her restless dreams, mixed with the heady warmth of harvest wine, she hears him beckon. And as autumn gold fades, Rois is consumed with Corbet Lynn, obsessed with his secret past - until, across the frozed countryside and in flight from her own imagination, truth and dreams become inseparable..."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/2374535.The_Quarry", "image": ["https://images.gr-assets.com/books/1347361076l/2374535.jpg"], "avg_ratings": ["\n  3.33\n"], "num_reviews": ["\n  ", "\n  15\n  ratings\n"], "genres": ["Horror", "Mystery", "Suspense"], "title": "The Quarry", "author": "Steve Lockley", "num_pages": "116", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1592240534", "description": ["Losing their father was the worst thing that ould happen to James and Robert Lane. Or so they thought. When their mother takes them to live in isolated Bethesda they find their problems are only just beginning. Terror has gripped the village. Two children have vanished, others will soon follow. Police patrol Bethesda's snow-bound streets, searching for the abductor. James and Robert discover that the answer lies deep in the woods that surround the village, in the old slate quarry abandoned for the winter. But something ancient and evil has seen them. And now it wants them, too. The Quarry is a fast-paced horror thriller for young adult readers. It will chill you to the bone."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/6055694-winter-s-child", "image": ["https://images.gr-assets.com/books/1388683466l/6055694.jpg"], "avg_ratings": ["\n  3.61\n"], "num_reviews": ["\n  ", "\n  3,638\n  ratings\n"], "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Young Adult", "Retellings", "Romance"], "title": "Winter's Child:  A Retelling of The Snow Queen", "author": "Cameron Dokey", "num_pages": "173", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1416975608", "description": ["Free-spirited Grace and serious Kai are the best of friends. They grew up together listening to magical tales spun by Kai's grandmother and sharing in each other's secrets. But when they turn sixteen and Kai declares his love for Grace, everything changes. Grace yearns for freedom and slowly begins to push Kai - and their friendship - away.", "Dejected Kai dreams of a dazzling Snow Queen, who entices him to leave home and wander to faraway lands. When Grace discovers Kai is gone, she learns how much she has lost and sets out on a mystical journey to find Kai...and discover herself."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/18799585-hidden", "image": ["https://images.gr-assets.com/books/1386936783l/18799585.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  18,502\n  ratings\n"], "genres": ["Mystery", "Romance", "Romance", "Romantic Suspense", "Thriller", "Suspense"], "title": "Hidden", "author": "Kendra Elliot", "num_pages": "388", "awards": [], "places": ["Portland, Oregon"], "character_names": ["Mason Callahan", "Lacey Campbell", "Jack Harper", "Ray Lusco", "Michael Brody", "Alex Kinton"], "language": "English", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/7968436-winter-shadows", "image": ["https://images.gr-assets.com/books/1320395518l/7968436.jpg"], "avg_ratings": ["\n  3.77\n"], "num_reviews": ["\n  ", "\n  166\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Young Adult", "Teen", "Fantasy", "Paranormal"], "title": "Winter Shadows", "author": "Margaret Buffie", "num_pages": "327", "awards": ["CLA Book of the Year for Children Award Nominee (2011)"], "places": ["Manitoba", "Ontario"], "character_names": [], "language": "English", "ISBN": "0887769683", "description": ["Cass feels the long winter shadows on her heart. Her mother died of cancer and her father has remarried a woman who has moved into their old Manitoba house with her nasty, babyish daughter and an attitude that's very hard to take. Christmas promises to be a miserable time.", "More than a century earlier, Christmas is proving to be difficult for Beatrice, too, for she has shadows of her own. Some are cast by her circumstances. She sees the growing prejudice against people like her who are of mixed Cree and Scottish backgrounds. And like Cass, she has a stepmother. Her father's new wife is threatened by Beatrice and is driving a wedge into the family. Beatrice can only be sure of her beloved Cree grandmother, relegated to a room upstairs. When a way of escape presents itself to Beatrice by way of an eligible bachelor, she is torn by the choice it offers her. Should she settle for a man she doesn't love or address the problems at home? Through her journal, she explores the answer and, at the same time, inspires Cass to find the strength she needs to face her own situation. Margaret Buffie's great skill as a storyteller creates a splendid, engaging novel that offers readers a rich combination of fine history, suspenseful shifts in time, and unforgettable characters."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/36896898-spinning-silver", "image": ["https://images.gr-assets.com/books/1513872748l/36896898.jpg"], "avg_ratings": ["\n  4.31\n"], "num_reviews": ["\n  ", "\n  25,634\n  ratings\n"], "genres": ["Fantasy", "Fiction", "Retellings", "Fantasy", "Fairy Tales", "Young Adult"], "title": "Spinning Silver", "author": "Naomi Novik", "num_pages": "480", "awards": ["Goodreads Choice Award Nominee for Fantasy (2018)"], "places": [], "character_names": [], "language": "English", "description": ["Miryem is the daughter and granddaughter of moneylenders... but her father isn't a very good one. Free to lend and reluctant to collect, he has loaned out most of his wife's dowry and left the family on the edge of poverty--until Miryem steps in. Hardening her heart against her fellow villagers' pleas, she sets out to collect what is owed--and finds herself more than up to the task. When her grandfather loans her a pouch of silver pennies, she brings it back full of gold.", "But having the reputation of being able to change silver to gold can be more trouble than it's worth--especially when her fate becomes tangled with the cold creatures that haunt the wood, and whose king has learned of her reputation and wants to exploit it for reasons Miryem cannot understand."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/603268.Dragons_of_Winter_Night", "image": ["https://images.gr-assets.com/books/1471472890l/603268.jpg"], "avg_ratings": ["\n  4.14\n"], "num_reviews": ["\n  ", "\n  39,249\n  ratings\n"], "genres": ["Fantasy", "Dungeons and Dragons", "Dragonlance", "Fiction", "Fantasy", "Dragons", "Science Fiction Fantasy"], "title": "Dragons of Winter Night", "author": "Margaret Weis", "num_pages": "395", "awards": [], "places": [], "character_names": ["Tanis Half-Elven", "Sturm Brightblade", "Flint Fireforge", "Tika Waylan", "Caramon Majere", "Raistlin Majere", "Lauralanthalasa", "Kitiara uth Matar", "Tasslehoff Burrfoot", "Alhana Starbreeze", "Riverwind", "Goldmoon", "Skylan Iverson", "Garn", "Aylaen", "Norgaard", "Wulfe", "Raegar", "Gilthanas", "Derek Crownguard"], "language": "English", "ISBN": "0786916095", "description": ["Now the people know that the dragon minions of Takhisis, Queen of Darkness, have returned. The people of all nations prepare to fight to save their homes, their lives, and their freedom. But the races have long been divided by hatred and prejudice. Elven warriors and human knights fight among themselves. It seems the battle has been lost before it begins.", "The companions are separated, torn apart by war. A full season will pass before they meet again—if they meet again. As the darkness deepens, a disgraced knight, a pampered elfmaiden, and a rattle-brained kender stand alone in the pale winter sunlight.", "Not much in the way of heroes."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/28471.Dragons_of_the_Highlord_Skies", "image": ["https://images.gr-assets.com/books/1386920617l/28471.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  4,055\n  ratings\n"], "genres": ["Fantasy", "Dungeons and Dragons", "Dragonlance", "Fiction", "Fantasy", "Dragons", "Fantasy", "High Fantasy"], "title": "Dragons of the Highlord Skies", "author": "Margaret Weis", "num_pages": "456", "awards": [], "places": [], "character_names": ["Sturm Brightblade", "Flint Fireforge", "Lauralanthalasa", "Kitiara uth Matar", "Tasslehoff Burrfoot", "Gilthanas", "Derek Crownguard", "Brian Donner", "Aran Tallbow"], "language": "English", "ISBN": "0786943335", "description": ["The Chronicles retold--from evil's point of view.", "The story starts in Neraka, where Kitiara uth Matar and Emperor Ariakas hatch a plan to retrieve a dragon orb and thereby destroy Solamnia and the Companions in one fell swoop. But the guardian of the dragon orb, Highlord Feal-Thas, disagrees with this plan. Kitiara must go to Ice Wall to force him to accept Ariakas' will, but her journey does not end there. Thrown out of favor, she conceives a daring plan to enlist the aid of the most feared beings on Krynn--Lord Soth and the Dark Queen. Meanwhile, Laurana and the Companions retrieve the dragon orb and take it back to Solamnia--not knowing that they bring their allies' doom with them.", "The second volume of a new trilogy from celebrated authors Margaret Weis and Tracy Hickman, The Lost Chronicles details the famed War of the Lance from the perspective of the evil that menaces Krynn. The books are written in such a way that they will be marvelous complements to the original Chronicles, while at the same time accessible and exciting to new readers"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/355618.The_Box_Of_Delights", "image": ["https://images.gr-assets.com/books/1174042247l/355618.jpg"], "avg_ratings": ["\n  3.95\n"], "num_reviews": ["\n  ", "\n  2,616\n  ratings\n"], "genres": ["Childrens", "Fantasy", "Classics", "Holiday", "Christmas", "Fiction"], "title": "The Box Of Delights", "author": "John Masefield", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1405210117", "description": ["Strange things begin to happen the minute young Kay Harker boards the train to go home for Christmas and finds himself under observation by two very shifty-looking characters. Arriving at his destination, the boy is immediately accosted by a bright-eyed old man with a mysterious message: “The wolves are running.” Soon danger is everywhere, as a gang of criminals headed by the notorious wizard Abner Brown and his witch wife Sylvia Daisy Pouncer gets to work. What does Abner Brown want? The magic box that the old man has entrusted to Kay, which allows him to travel freely not only in space but in time, too. The gang will stop at nothing to carry out their plan, even kidnapping Kay’s friend, the tough little Maria Jones, and threatening to cancel Christmas celebrations altogether. But with the help of his allies, including an intrepid mouse, a squadron of Roman soldiers, the legendary Herne the Hunter, and the inventor of the Box of Delights himself, Kay just may be able rescue his friend, foil Abner Brown’s plot, and save Christmas, too."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13100208-beneath-the-shadows", "image": ["https://images.gr-assets.com/books/1344313294l/13100208.jpg"], "avg_ratings": ["\n  3.62\n"], "num_reviews": ["\n  ", "\n  1,616\n  ratings\n"], "genres": ["Mystery", "Suspense", "Fiction", "Gothic", "Thriller", "Thriller", "Mystery Thriller"], "title": "Beneath the Shadows", "author": "Sara   Foster", "num_pages": "320", "awards": [], "places": ["North Yorkshire, England"], "character_names": [], "language": "English", "ISBN": "0312643365", "description": ["In this thrilling gothic suspense debut by Sara Foster in the tradition of Rosamund Lupton and Sophie Hannah, a young mother searches Yorkshire's windswept moors for the truth behind her husband's mysterious disappearance.", "When Grace's husband, Adam, inherits an isolated North Yorkshire cottage, they leave the bustle of London behind to try a new life. A week later, Adam vanishes without a trace, leaving their baby daughter, Millie, in her stroller on the doorstep. The following year, Grace returns to the tiny village on the untamed heath. Everyone—the police, her parents, even her best friend and younger sister—is convinced that Adam left her. But Grace, unable to let go of her memories of their love and life together, cannot accept this explanation. She is desperate for answers, but the slumbering, deeply superstitious hamlet is unwilling to give up its secrets. As Grace hunts through forgotten corners of the cottage searching for clues, and digs deeper into the lives of the locals, strange dreams begin to haunt her. Are the villagers hiding something, or is she becoming increasingly paranoid? Only as snowfall threatens to cut her and Millie off from the rest of the world does Grace make a terrible discovery. She has been looking in the wrong place for answers all along, and she and her daughter will be in terrible danger if she cannot get them away in time.", "\"A haunting tale of loss and one woman's search for the truth no matter the consequences. This vividly written novel will leave you breathless and as chilled as the starkly beautiful North Yorkshire moors where this compelling story unfolds.\" –Heather Gudenkauf, New York Times bestselling author of These Things Hidden"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/1103116.Snow_Moon", "image": ["https://images.gr-assets.com/books/1309210253l/1103116.jpg"], "avg_ratings": ["\n  3.67\n"], "num_reviews": ["\n  ", "\n  88\n  ratings\n"], "genres": ["Childrens", "Picture Books", "Childrens", "Childrens", "Storytime", "Art"], "title": "Snow Moon", "author": "Brunelle Nicholas", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0670060240", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/15714416-savage-winter", "image": ["https://images.gr-assets.com/books/1340208916l/15714416.jpg"], "avg_ratings": ["\n  3.90\n"], "num_reviews": ["\n  ", "\n  320\n  ratings\n"], "genres": ["Fantasy", "Romance", "Science Fiction", "Dystopia", "Young Adult", "Short Stories"], "title": "Savage Winter", "author": "Rachel Van Dyken", "num_pages": "92", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["If they take you, you don't come back. You either die...or wish you had. The Western Empire was ruthless. The only reason I survived was because he gave his life for me--a life that might as well have been mine, for when they stole his last heartbeats, they silenced my own. They call me princess, an answer to the prophecy, but I’m nothing more than a prisoner...awaiting my lifelong punishment. Marriage. To the Prince of the East. But it’s the Royal Protector who reminds me of what I lost. He threatens something I never thought I'd have again...my heart."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/7747064-the-iron-daughter", "image": ["https://images.gr-assets.com/books/1271790654l/7747064.jpg"], "avg_ratings": ["\n  4.12\n"], "num_reviews": ["\n  ", "\n  104,961\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Romance", "Fantasy", "Paranormal", "Paranormal", "Fairies"], "title": "The Iron Daughter", "author": "Julie Kagawa", "num_pages": "359", "awards": [], "places": ["Nevernever"], "character_names": ["Meghan Chase", "Puck", "Grimalkin", "Ash - Ashallayn' Darkmyr Tallyn", "Queen Mab", "King Oberon", "Ironhorse"], "language": "English", "ISBN": "0373210132", "description": ["Half Summer faery princess, half human, Meghan has never fit in anywhere. Deserted by the Winter prince she thought loved her, she is prisoner to the Winter faery queen. As war looms between Summer and Winter, Meghan knows that the real danger comes from the Iron fey—ironbound faeries that only she and her absent prince have seen. But no one believes her.", "Worse, Meghan's own fey powers have been cut off. She's stuck in Faery with only her wits for help. Trusting anyone would be foolish. Trusting a seeming traitor could be deadly. But even as she grows a backbone of iron, Meghan can't help but hear the whispers of longing in her all-too-human heart."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/9728144-the-snow-queen-s-shadow", "image": ["https://images.gr-assets.com/books/1365195807l/9728144.jpg"], "avg_ratings": ["\n  4.00\n"], "num_reviews": ["\n  ", "\n  1,650\n  ratings\n"], "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Fiction", "Science Fiction Fantasy"], "title": "The Snow Queen's Shadow", "author": "Jim C. Hines", "num_pages": "333", "awards": [], "places": [], "character_names": ["Princess Danielle Whiteshore", "Prince Armand Whiteshore", "Princess Talia Malak-el-Dahshat", "Princess Snow White", "Queen Beatrice Whiteshore", "King Theodore Whiteshore"], "language": "English", "ISBN": "0756406749", "description": ["A broken mirror. A stolen child. A final mission to try to stop an enemy they never dreamed they would face.", "When a spell gone wrong shatters Snow White's enchanted mirror, a demon escapes into the world. The demon's magic distorts the vision of all it touches, showing them only ugliness and hate. It is a power that turns even friends and lovers into mortal foes, one that will threaten humans and fairies alike.", "And the first to fall under the demon's power is the princess, Snow White..."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/11254250-cabin-fever", "image": ["https://images.gr-assets.com/books/1350396037l/11254250.jpg"], "avg_ratings": ["\n  4.22\n"], "num_reviews": ["\n  ", "\n  79,781\n  ratings\n"], "genres": ["Fiction", "Realistic Fiction", "Childrens", "Childrens", "Middle Grade"], "title": "Cabin Fever", "author": "Jeff Kinney", "num_pages": "224", "awards": [], "places": [], "character_names": ["Greg Heffley", "Rodrick Heffley", "Manny Heffley", "Rowley"], "language": "English", "ISBN": "1419702238", "description": ["Greg Heffley is in big trouble. School property has been damaged, and Greg is the prime suspect. But the crazy thing is, he’s innocent. Or at least sort of. The authorities are closing in, but when a surprise blizzard hits, the Heffley family is trapped indoors. Greg knows that when the snow melts he’s going to have to face the music, but could any punishment be worse than being stuck inside with your family for the holidays?"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13573093-frost", "image": ["https://images.gr-assets.com/books/1333333870l/13573093.jpg"], "avg_ratings": ["\n  3.82\n"], "num_reviews": ["\n  ", "\n  3,494\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Science Fiction", "Dystopia", "Romance", "Fantasy", "Paranormal"], "title": "Frost", "author": "Kate Avery Ellison", "num_pages": "195", "awards": [], "places": [], "character_names": ["Gabriel \"Gabe\" Anderson", "Lia Weaver", "Adam Brewer", "Ann Mayor", "Cole Carver", "Ivy Weaver", "Jonn Weaver"], "language": "English", "description": [" ", "In the frozen world of the Frost, only mysterious blue flowers that bloom in the snow keep the monsters at bay. The air is icy cold. It's easy to get lost. One wrong move and a person could end up dead. ", "Lia Weaver knows this better than anyone. ", "After monsters kill her parents, Lia must keep the family farm running in their place. She follows the rules of the village: Don't talk to outsiders. Don't go into the Frost at night. Don't ask too many questions. Rules keep her family alive in this harsh and unforgiving world. ", "But when her sister finds a handsome fugitive bleeding to death in the forest at dusk, Lia surprises herself and does the unthinkable. ", "She saves his life. ", "Giving shelter to the fugitive could get her in trouble. The Elders have always described the advanced society of people beyond the Frost, the “Farthers,” as ruthless and cruel. But Lia is startled to find that Gabe is empathetic and intelligent…and handsome. She might even be falling in love with him. ", "But time is running out. The monsters from the forest circle the farm at night. The village leader is starting to ask questions. Farther soldiers are searching for Gabe. Lia must locate a secret organization called the Thorns to help Gabe escape to safety, but every move she makes puts her in more danger. ", "Is compassion—and love—worth the risk?"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/34896.The_Ice_Dragon", "image": ["https://images.gr-assets.com/books/1436875713l/34896.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  13,260\n  ratings\n"], "genres": ["Fantasy", "Fantasy", "Dragons", "Childrens", "Young Adult", "Fiction", "Short Stories", "Childrens", "Middle Grade", "Fantasy", "High Fantasy", "Adventure", "Science Fiction Fantasy"], "title": "The Ice Dragon", "author": "George R.R. Martin", "num_pages": "112", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0765316315", "description": ["The ice dragon was a creature of legend and fear, for no man had ever tamed one. When it flew overhead, it left in its wake desolate cold and frozen land. But Adara was not afraid. For Adara was a winter child, born during the worst freeze that anyone, even the Old Ones, could remember. ", "Adara could not remember the first time she had seen the ice dragon. It seemed that it had always been in her life, glimpsed from afar as she played in the frigid snow long after the other children had fled the cold. In her fourth year she touched it, and in her fifth year she rode upon its broad, chilled back for the first time. Then, in her seventh year, on a calm summer day, fiery dragons from the North swooped down upon the peaceful farm that was Adara's home. And only a winter child--and the ice dragon who loved her--could save her world from utter destruction. ", "\"The Ice Dragon\" marks the highly anticipated children's book debut of George R.R. Martin, the award-winning author of the \"New York Times\" best-selling series A Song of Ice and Fire and is set in the same world. Illustrated with lush, exquisitely detailed pencil drawings by acclaimed artist Yvonne Gilbert, \"The Ice Dragon\" is an unforgettable tale of courage, love, and sacrifice by one of the most honored fantasists of all time."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/17316.Oath_of_Gold", "image": ["https://images.gr-assets.com/books/1389988874l/17316.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  6,108\n  ratings\n"], "genres": ["Fantasy", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy", "Fiction"], "title": "Oath of Gold", "author": "Elizabeth Moon", "num_pages": "501", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0671697986", "description": ["Paksenarrion-—Paks for short-—was somebody special. Never could she have followed her father's orders and married the pig farmer down the road. Better a soldier's life than a pigfarmer's wife, and so though she knew that she could never go home again, Paks ran away to be a soldier. And so began an adventure destined to transform a simple Sheepfarmer's Daughter into a hero fit to be chosen by the gods."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/8138952-rose-in-a-storm", "image": ["https://images.gr-assets.com/books/1320434692l/8138952.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  1,350\n  ratings\n"], "genres": ["Animals", "Animals", "Dogs", "Fiction"], "title": "Rose in a Storm", "author": "Jon Katz", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0345502655", "description": ["From ", " author Jon Katz comes a moving and powerful novel, the first one inspired by life on his celebrated Bedlam Farm and perceptively told from the point of view of Rose, a dedicated working dog.", "Rose is determined and focused, keeping the sheep out of danger and protecting the other creatures on the farm she calls home. But of all those she’s looked after since coming to the farm as a puppy, it is Sam, the farmer, whom she watches most carefully.", "Awoken one cold midwinter night during lambing season, Rose and Sam struggle into the snowy dark to do their work. The ever observant Rose has seen a change in her master of late, ever since Sam’s wife disappeared one day. She senses something else in the air as well: A storm is coming, but not like any of the ones she’s seen over the years. This storm feels different, bigger, more foreboding.", "When an epic blizzard hits the region, it will take all of Rose’s resolve, resourcefulness, and courage to help Sam save the farm and the creatures who live there.", "Jon Katz consulted with animal behavior scientists to create his unique and convincing vision of the world as seen through the eyes of a dog. Poignant, thrilling, and beautifully wrought, Rose in a Storm is a wonderfully original and powerful tale from a gifted storyteller."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/49824.The_Mammoth_Hunters", "image": ["https://images.gr-assets.com/books/1388257676l/49824.jpg"], "avg_ratings": ["\n  3.89\n"], "num_reviews": ["\n  ", "\n  55,976\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction", "Historical", "Fantasy", "Romance"], "title": "The Mammoth Hunters", "author": "Jean M. Auel", "num_pages": "688", "awards": [], "places": [], "character_names": ["Ayla", "Jondalar", "Ranec"], "language": "English", "ISBN": "0553381644", "description": ["Once again Jean M. Auel opens the door of a time long past to reveal an age of wonder and danger at the dawn of the modern human race. With all the consummate storytelling artistry and vivid authenticity she brought to ", " and its sequel, ", ", Jean M. Auel continues the breathtaking epic journey of the woman called Ayla. ", "Riding Whinney with Jondalar, the man she loves, and followed by the mare’s colt, Ayla ventures into the land of the Mamutoi--the Mammoth Hunters. She has finally found the Others she has been seeking. Though Ayla must learn their different customs and language, she is adopted because of her remarkable hunting ability, singular healing skills, and uncanny fire-making technique. Bringing back the single pup of a lone wolf she has killed, Ayla shows the way she tames animals. She finds women friends and painful memories of the Clan she left behind, and meets Ranec, the dark-skinned, magnetic master carver of ivory, whom she cannot refuse--inciting Jondalar to a fierce jealousy that he tries to control by avoiding her. Unfamiliar with the ways of the Others, Ayla misunderstands, and thinking Jondalar no longer loves her, she turns more to Ranec. Throughout the icy winter the tension mounts, but warming weather will bring the great mammoth hunt and the mating rituals of the Summer Meeting, when Ayla must choose to remain with Ranec and the Mamutoi, or to follow Jondalar on a long journey into an unknown future."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/153792.Cold_Fire", "image": ["https://images.gr-assets.com/books/1328861813l/153792.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  19,605\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Magic"], "title": "Cold Fire", "author": "Tamora Pierce", "num_pages": "355", "awards": [], "places": [], "character_names": ["Daja Kisubo", "Frostpine", "Niamara Bancanor", "Jorality Bancanor"], "language": "English", "ISBN": "0590396560", "description": ["Daja and Frostpine expect to have a peaceful winter's visit with old friends in Kugisko, a port in the vast empire of Namon. But there is no peace when mysterious fires begin to blaze across the vulnerable city. Daja assists Bennat Ladradun, a local firefighter with a tragic past, to fight the flames. The two become fast friends-until they realize the fires have been deliberately set, and their relationship is deeply tested. Daja's magic helps her track down the firestarter, but no magic can protect her or Ben from the effects of madness and betrayal."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/22668547-half-the-world-in-winter", "image": ["https://images.gr-assets.com/books/1408320737l/22668547.jpg"], "avg_ratings": ["\n  3.50\n"], "num_reviews": ["\n  ", "\n  135\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Historical", "Fiction"], "title": "Half the World in Winter", "author": "Maggie Joel", "num_pages": "432", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1743310900", "description": ["A captivating drama of family secrets and tragedies.", "It is London, 1880, and Lucas Jarmyn struggles to make sense of the death of his beloved youngest daughter; his wife, Aurora, seeks solace in rigid social routines; and eighteen-year-old Dinah looks for fulfilment in unusual places. Only the housekeeper, the estimable Mrs Logan, seems able to carry on.", "A train accident in a provincial town on the railway Lucas owns claims the life of nine-year-old Alice Brinklow and, amid the public outcry, Alice's father, Thomas, journeys to London demanding justice. As he arrives in the Capital on a frozen January morning his fate, and that of the entire Jarmyn family, will hinge on such strange things as an ill-fated visit to a spiritualist, an errant chicken bone and a single vote cast at a board room meeting.", "Written with charm, humour and rich period detail, Maggie Joel has created an intriguing novel of a Victorian family adrift in their rapidly changing world."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/11431896-the-bitter-kingdom", "image": ["https://images.gr-assets.com/books/1360281470l/11431896.jpg"], "avg_ratings": ["\n  4.21\n"], "num_reviews": ["\n  ", "\n  31,565\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Young Adult", "Young Adult Fantasy", "Fiction", "Romance"], "title": "The Bitter Kingdom", "author": "Rae Carson", "num_pages": "433", "awards": [], "places": [], "character_names": ["Lucero-Elisa de Riqueza", "Hector of Ventierra"], "language": "English", "ISBN": "0062026542", "description": ["Elisa is a fugitive.", "Her enemies have stolen the man she loves, and they await her at the gate of darkness. Her country is on the brink of civil war, with her own soldiers ordered to kill her on sight.", "Her Royal Majesty, Queen Lucero-Elisa né Riqueza de Vega, bearer of the Godstone, will lead her three loyal companions deep into the enemy's kingdom, a land of ice and snow and brutal magic, to rescue Hector and win back her throne. Her power grows with every step, and the shocking secrets she will uncover on this, her final journey, could change the course of history.", "But that is not all. She has a larger destiny. She must become the champion the world has been waiting for.", "Even of those who hate her most."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/21318.The_Snow_Spider", "image": ["https://images.gr-assets.com/books/1442289520l/21318.jpg"], "avg_ratings": ["\n  3.69\n"], "num_reviews": ["\n  ", "\n  2,878\n  ratings\n"], "genres": ["Fantasy", "Childrens", "Young Adult", "Fantasy", "Magic", "Fiction"], "title": "The Snow Spider", "author": "Jenny Nimmo", "num_pages": "146", "awards": ["Nestlé Smarties Book Prize (1986)"], "places": [], "character_names": [], "language": "English", "ISBN": "0439846757", "description": ["Jenny Nimmo's award-winning SNOW SPIDER TRILOGY is back as an exciting Orchard Books fantasy series! ", "On Gwyn's 9th birthday, his grandmother tells him he may be a magician, like his Welsh ancestors. She gives him five gifts to help him--a brooch, a piece of dried seaweed, a tin whistle, a scarf, and a broken toy horse. One blustery day, unsure what to do with his newfound magic, Gwyn throws the brooch to the wind and receives a silvery snow spider in return. Will he be able to use this special spider to bring his missing sister, Bethan, home? THE SNOW SPIDER spins an icy, sparkly web of mystical intrigue that sets the stage for the next two books in this outstanding trilogy!"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/1920642.Northlander", "image": ["https://images.gr-assets.com/books/1347769505l/1920642.jpg"], "avg_ratings": ["\n  3.77\n"], "num_reviews": ["\n  ", "\n  158\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Young Adult", "Young Adult Fantasy"], "title": "Northlander", "author": "Meg Burden", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0976812681", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/138685.Dissolution", "image": ["https://images.gr-assets.com/books/1329914905l/138685.jpg"], "avg_ratings": ["\n  4.08\n"], "num_reviews": ["\n  ", "\n  32,539\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Mystery", "Fiction", "Historical", "Mystery", "Crime", "Mystery", "Historical Mystery"], "title": "Dissolution", "author": "C.J. Sansom", "num_pages": "456", "awards": [], "places": ["Scarnesea, Sussex, England"], "character_names": ["Matthew Shardlake", "Mark Poer", "Thomas Cromwell", "Abbot Fabian", "Brother Edwig", "Brother Gabriel of Ashford", "Brother Guy of Malton", "Brother Hugh", "Brother Jude", "Brother Mortimus of Kelso", "Joan Woode", "Robin Singleton", "Alice Fewterer", "Simon Whelplay", "Ralph Spenlay", "Master Bugge", "Jerome Wentworth", "Lawrence Goodhaps", "Brother Athelstan", "Gilbert Copynger", "Joan Stumpe", "Orphan Stonegarden", "Thomas Oldknoll", "Master Hodges"], "language": "English", "ISBN": "0330411969", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/140097.An_Ice_Cold_Grave", "image": ["https://images.gr-assets.com/books/1389660134l/140097.jpg"], "avg_ratings": ["\n  3.96\n"], "num_reviews": ["\n  ", "\n  30,573\n  ratings\n"], "genres": ["Mystery", "Fantasy", "Paranormal", "Fantasy", "Fantasy", "Urban Fantasy", "Fiction", "Fantasy", "Supernatural"], "title": "An Ice Cold Grave", "author": "Charlaine Harris", "num_pages": "280", "awards": [], "places": ["Doraville, North Carolina"], "character_names": ["Harper Connelly", "Tolliver Lang"], "language": "English", "ISBN": "0425217299", "description": ["Hired to find a boy gene missing in Doraville, North Carolina, Harper Connelly and her brother Tolliver head there, only to discover that the boy was the only one left of several who had disappeared over the previous five years. All of them teenagers. All unlikely runaways. ", " All calling for Harper. ", " Harper soon finds them—eight victims, buried in the half-frozen ground, all come to an unspeakable end. Afterward, what she most wants to do is collect her fee and get out of town ahead of the media storm that's soon to descend. But when she's attacked and prevented from leaving, she reluctantly becomes a part of the investigation as she learns more than she cares to about the dark mysteries and long-hidden secrets of Doraville—knowledge that makes her the next person likely to rest in an ice-cold grave."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/6321845-ice", "image": ["https://images.gr-assets.com/books/1348533017l/6321845.jpg"], "avg_ratings": ["\n  3.71\n"], "num_reviews": ["\n  ", "\n  6,574\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Retellings", "Fiction"], "title": "Ice", "author": "Sarah Beth Durst", "num_pages": "308", "awards": ["Andre Norton Award Nominee (2009)"], "places": [], "character_names": ["Cassie Dasent", "Bear (The Polar Bear King)"], "language": "English", "ISBN": "141698643X", "description": ["When Cassie was a little girl, her grandmother told her a fairy tale about her mother, who made a deal with the Polar Bear King and was swept away to the ends of the earth. Now that Cassie is older, she knows the story was a nice way of saying her mother had died. Cassie lives with her father at an Arctic research station, is determined to become a scientist, and has no time for make-believe.", "Then, on her eighteenth birthday, Cassie comes face-to-face with a polar bear who speaks to her. He tells her that her mother is alive, imprisoned at the ends of the earth. And he can bring her back — if Cassie will agree to be his bride.", "That is the beginning of Cassie's own real-life fairy tale, one that sends her on an unbelievable journey across the brutal Arctic, through the Canadian boreal forest, and on the back of the North Wind to the land east of the sun and west of the moon. Before it is over, the world she knows will be swept away, and everything she holds dear will be taken from her — until she discovers the true meaning of love and family in the magical realm of ", "."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/8153988-the-eye-of-the-world", "image": ["https://images.gr-assets.com/books/1465920672l/8153988.jpg"], "avg_ratings": ["\n  4.19\n"], "num_reviews": ["\n  ", "\n  318,449\n  ratings\n"], "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy", "Fantasy", "High Fantasy"], "title": "The Eye of the World", "author": "Robert Jordan", "num_pages": "753", "awards": [], "places": [], "character_names": ["Rand al'Thor", "Nynaeve al'Meara", "Egwene al'Vere", "Perrin Aybara", "Al'Lan Mandragoran", "Matrim Cauthon", "Moiraine Damodred"], "language": "English", "description": ["The Wheel of Time turns and Ages come and go, leaving memories that become legend. Legend fades to myth, and even myth is long forgotten when the Age that gave it birth returns again. In the Third Age, an Age of Prophecy, the World and Time themselves hang in the balance. What was, what will be, and what is, may yet fall under the Shadow.", "When The Two Rivers is attacked by Trollocs—a savage tribe of half-men, half-beasts— five villagers flee that night into a world they barely imagined, with new dangers waiting in the shadows and in the light."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/32426.Icebound", "image": ["https://images.gr-assets.com/books/1388203375l/32426.jpg"], "avg_ratings": ["\n  3.76\n"], "num_reviews": ["\n  ", "\n  17,729\n  ratings\n"], "genres": ["Horror", "Fiction", "Thriller", "Suspense"], "title": "Icebound", "author": "Dean Koontz", "num_pages": "408", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0553582909", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/2200913.The_Snow_Queen", "image": ["https://images.gr-assets.com/books/1440196927l/2200913.jpg"], "avg_ratings": ["\n  3.77\n"], "num_reviews": ["\n  ", "\n  7,229\n  ratings\n"], "genres": ["Fantasy", "Fantasy", "Fairy Tales", "Romance", "Fiction"], "title": "The Snow Queen", "author": "Mercedes Lackey", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "037380265X", "description": ["Aleksia, Queen of the Northern Lights, is mysterious, beautiful and widely known to have a heart of ice. No one would seek her wisdom except as a last resort. But when she's falsely accused of unleashing evil on nearby villages, she realizes there's an impostor out there far more heartless than she could ever be."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/13891.Winter_s_Heart", "image": ["https://images.gr-assets.com/books/1480096268l/13891.jpg"], "avg_ratings": ["\n  3.94\n"], "num_reviews": ["\n  ", "\n  87,787\n  ratings\n"], "genres": ["Fantasy", "Fiction", "Fantasy", "Epic Fantasy"], "title": "Winter's Heart", "author": "Robert Jordan", "num_pages": "780", "awards": [], "places": [], "character_names": ["Rand al'Thor", "Nynaeve al'Meara", "Egwene al'Vere", "Perrin Aybara", "Al'Lan Mandragoran", "Matrim Cauthon", "Moiraine Damodred", "Min Farshaw", "Elayne Trakand"], "language": "English", "ISBN": "081257558X", "description": ["Rand is on the run with Min, and in Cairhein, Cadsuane is trying to figure out where he is headed. Rand's destination is, in fact, one she has never considered.", "Mazrim Taim, leader of the Black Tower, is revealed to be a liar. But what is he up to?", "Faile, with the Aiel Maidens, Bain and Chiad, and her companions, Queen Alliandre and Morgase, is prisoner of Savanna's sept.", "Perrin is desperately searching for Faile. With Elyas Machera, Berelain, the Prophet and a very mixed \"army\" of disparate forces, he is moving through country rife with bandits and roving Seanchan. The Forsaken are ever more present, and united, and the man called Slayer stalks Tel'aran'rhiod and the wolfdream.", "In Ebou Dar, the Seanchan princess known as Daughter of the Nine Moons arrives--and Mat, who had been recuperating in the Tarasin Palace, is introduced to her. Will the marriage that has been foretold come about?", "There are neither beginnings or endings to the turning of the Wheel of Time. But it is a beginning...."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/23635100-a-tundra-tale", "image": ["https://images.gr-assets.com/books/1417322106l/23635100.jpg"], "avg_ratings": ["\n  4.14\n"], "num_reviews": ["\n  ", "\n  14\n  ratings\n"], "genres": ["Fantasy"], "title": "A Tundra Tale", "author": "Lone Alaskan Gypsy", "num_pages": "186", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1503171752", "description": ["Inspired by Alaskan folklore, this fairytale story takes Olive, a twenty-year-old resident of a remote psychiatric hospital, on a journey into the tundra, where with the help of her arctic fox companion, a young Athabascan child, and an old trapper she will discover the secrets of the black wolf, the story of the land's ancestors, and the power of the northern lights that could unite them all."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/77770.These_Happy_Golden_Years", "image": ["https://images.gr-assets.com/books/1389579632l/77770.jpg"], "avg_ratings": ["\n  4.18\n"], "num_reviews": ["\n  ", "\n  58,523\n  ratings\n"], "genres": ["Classics", "Historical", "Historical Fiction", "Childrens", "Fiction", "Young Adult"], "title": "These Happy Golden Years", "author": "Laura Ingalls Wilder", "num_pages": "289", "awards": ["Newbery Medal Nominee (1944)"], "places": ["De Smet, South Dakota"], "character_names": ["Laura Ingalls Wilder", "Caroline Quiner Ingalls", "Charles Ingalls", "Mary Ingalls", "Carrie Ingalls", "Grace Ingalls", "Almanzo Wilder", "Nellie Oleson"], "language": "English", "ISBN": "0060264802", "description": ["Fifteen-year-old Laura lives apart from her family for the first time, teaching school in a claim shanty twelve miles from home. She is very homesick, but keeps at it so that she can help pay for her sister Mary's tuition at the college for the blind. During school vacations Laura has fun with her singing lessons, going on sleigh rides, and best of all, helping Almanzo Wilder drive his new buggy. Friendship soon turns to love for Laura and Almanzo in the romantic conclusion of this Little House book.", "Correlates to the Common Core State Standards in English Language Arts"]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/7824322-between-shades-of-gray", "image": ["https://images.gr-assets.com/books/1327873479l/7824322.jpg"], "avg_ratings": ["\n  4.37\n"], "num_reviews": ["\n  ", "\n  126,814\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Young Adult", "Historical", "Fiction", "War"], "title": "Between Shades of Gray", "author": "Ruta Sepetys", "num_pages": "344", "awards": ["Georgia Peach Book Award Nominee for Honor book (2012)", "SCBWI Golden Kite Award for Fiction (2012)", "William C. Morris YA Debut Award Nominee (2012)", "Rhode Island Teen Book Award Nominee (2013)", "Milwaukee County Teen Book Award Nominee (2012)", "Indies Choice Book Award for Young Adult (2012)", "Amelia Elizabeth Walden Award Nominee (2012)", "Lincoln Award Nominee (2016)", "Cybils Award Nominee for Young Adult Fiction (2011)", "Carnegie Medal Nominee (2012)", "Missouri Gateway Readers Award Nominee (2014)"], "places": ["Siberia", "Lithuania"], "character_names": ["Lina", "Jonas", "Elena"], "language": "English", "ISBN": "0399254129", "description": ["Lina is just like any other fifteen-year-old Lithuanian girl in 1941. She paints, she draws, she gets crushes on boys. Until one night when Soviet officers barge into her home, tearing her family from the comfortable life they've known. Separated from her father, forced onto a crowded and dirty train car, Lina, her mother, and her young brother slowly make their way north, crossing the Arctic Circle, to a work camp in the coldest reaches of Siberia. Here they are forced, under Stalin's orders, to dig for beets and fight for their lives under the cruelest of conditions.", " Lina finds solace in her art, meticulously--and at great risk--documenting events by drawing, hoping these messages will make their way to her father's prison camp to let him know they are still alive. It is a long and harrowing journey, spanning years and covering 6,500 miles, but it is through incredible strength, love, and hope that Lina ultimately survives. ", " is a novel that will steal your breath and capture your heart."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/34492.Wintersmith", "image": ["https://images.gr-assets.com/books/1290229201l/34492.jpg"], "avg_ratings": ["\n  4.24\n"], "num_reviews": ["\n  ", "\n  45,518\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction", "Humor"], "title": "Wintersmith", "author": "Terry Pratchett", "num_pages": "325", "awards": ["Locus Award for Best Young Adult Novel (2007)", "Mythopoeic Fantasy Award Nominee for Children's Literature (2007) (2016)", "Carnegie Medal Nominee (2008)"], "places": [], "character_names": ["Tiffany Aching", "Nac Mac Feegle", "Granny Weatherwax", "DEATH"], "language": "English", "ISBN": "0060890312", "description": []},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/23203049-blood-on-the-snow", "image": ["https://images.gr-assets.com/books/1410471604l/23203049.jpg"], "avg_ratings": ["\n  4.41\n"], "num_reviews": ["\n  ", "\n  113\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Fiction"], "title": "Blood on the Snow", "author": "David        Cook", "num_pages": "94", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Winter, 1794, Flanders, and the British are retreating.", "Faced by appalling weather and pursued by an overwhelming enemy, the very survival of the British Army is at stake. ", "With little supplies and ammunition, Lieutenant Jack Hallam of the 28th Regiment must prove himself by leading his company through the full horrors of the withdrawal, where morale is desperately low, and where looting and ill-discipline are rife. ", "The men must endure freezing temperatures, disease and battle if they wish to see home again, and if any officer can accomplish this feat, then that man is Jack Hallam.", "Blood on the Snow is a gripping tale of honour, bravery and self-sacrifice in the darkest of times. ", "This is the third story in The Soldier Chronicles series."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/6068551-shiver", "image": ["https://images.gr-assets.com/books/1409283154l/6068551.jpg"], "avg_ratings": ["\n  3.77\n"], "num_reviews": ["\n  ", "\n  396,867\n  ratings\n"], "genres": ["Young Adult", "Fantasy", "Romance", "Fantasy", "Paranormal", "Shapeshifters", "Werewolves"], "title": "Shiver", "author": "Maggie Stiefvater", "num_pages": "390", "awards": ["Georgia Peach Book Award (2010)", "Pennsylvania Young Readers' Choice Award Nominee (2011)", "Children's Choice Book Award Nominee for Teen Choice Book of the Year (2010)", "Florida Teens Read Nominee (2010)", "Teen Read Award Nominee for Best Read (2010)", "The Inky Awards for Silver Inky (2010)", "Lincoln Award Nominee (2012)", "The Inky Awards Shortlist for Silver Inky (2010)", "Missouri Gateway Readers Award Nominee (2012)"], "places": ["Mercy Falls, Minnesota"], "character_names": ["Grace Brisbane", "Sam  Roth", "Isabel Culpeper", "Jack Culpeper", "Geoffrey Beck", "Olivia Marx", "Rachel", "William Koenig"], "language": "English", "ISBN": "0545123267", "description": ["For years, Grace has watched the wolves in the woods behind her house. One yellow-eyed wolf—her wolf—is a chilling presence she can't seem to live without.", "Meanwhile, Sam has lived two lives: In winter, the frozen woods, the protection of the pack, and the silent company of a fearless girl. In summer, a few precious months of being human… until the cold makes him shift back again.", "Now, Grace meets a yellow-eyed boy whose familiarity takes her breath away. It's her wolf. It has to be. But as winter nears, Sam must fight to stay human—or risk losing himself, and Grace, forever."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/1210754.Sun_and_Moon_Ice_and_Snow", "image": ["https://images.gr-assets.com/books/1317065700l/1210754.jpg"], "avg_ratings": ["\n  3.97\n"], "num_reviews": ["\n  ", "\n  19,118\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fantasy", "Fairy Tales", "Romance", "Retellings", "Fiction"], "title": "Sun and Moon, Ice and Snow", "author": "Jessica Day George", "num_pages": "336", "awards": ["Dorothy Canfield Fisher Children's Book Award Nominee (2010)"], "places": [], "character_names": [], "language": "English", "ISBN": "1599901099", "description": ["\"Blessed\" or \"cursed\" with an ability to understand animals, the Lass (as she's known to her family) has always been an oddball. And when an ", " (polar bear) seeks her out, and promises that her family will become rich if only the Lass will accompany him to his castle, she doesn't hesitate. But the bear is not what he seems, nor is his castle, which is made of ice and inhabited by a silent staff of servants. Only a grueling journey on the backs of the four winds will reveal the truth: the bear is really a prince who's been enchanted by a troll queen, and the Lass must come up with a way to free him before he's forced to marry a troll princess."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/5326.A_Christmas_Carol", "image": ["https://images.gr-assets.com/books/1406512317l/5326.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  520,156\n  ratings\n"], "genres": ["Classics", "Fiction", "Holiday", "Christmas", "Fantasy"], "title": "A Christmas Carol", "author": "Charles Dickens", "num_pages": "104", "awards": ["Audie Award for Classic (2005)"], "places": ["London, England"], "character_names": ["Timothy Cratchit", "Bob Cratchit", "Jacob Marley", "Ebenezer Scrooge"], "language": "English", "ISBN": "1561797464", "description": ["'If I had my way, every idiot who goes around with Merry Christmas on his lips, would be boiled with his own pudding, and buried with a stake of holly through his heart. Merry Christmas? Bah humbug!'", "Introduction and Afterword by Joe Wheeler", "To bitter, miserly Ebenezer Scrooge, Christmas is just another day. But all that changes when the ghost of his long-dead business partner appears, warning Scrooge to change his ways before it's too late. ", "Part of the Focus on the Family Great Stories collection, this edition features an in-depth introduction and discussion questions by Joe Wheeler to provide greater understanding for today's reader. \"A Christmas Carol\" captures the heart of the holidays like no other novel."]},
{"list": "Dead of Winter", "url": "https://www.goodreads.com/book/show/8282.The_Long_Winter", "image": ["https://images.gr-assets.com/books/1266449683l/8282.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  72,019\n  ratings\n"], "genres": ["Historical", "Historical Fiction", "Classics", "Childrens", "Fiction", "Young Adult"], "title": "The Long Winter", "author": "Laura Ingalls Wilder", "num_pages": "422", "awards": ["Newbery Medal Nominee (1941)", "Boston Globe-Horn Book Award (1940)"], "places": ["De Smet, South Dakota"], "character_names": ["Laura Ingalls Wilder", "Caroline Quiner Ingalls", "Charles Ingalls", "Mary Ingalls", "Carrie Ingalls", "Grace Ingalls", "Almanzo Wilder"], "language": "English", "ISBN": "0060885424", "description": ["On the empty winter prairie, gray clouds to the northwest meant only one thing: a blizzard was seconds away. The first blizzard came in October. It snowed almost without stopping until April. The temperature dropped to forty below. Snow reached the roof-tops. And no trains could get through with food and coal. The townspeople began to starve. The Ingalls family barely lived through that winter. And Almanzo Wilder knew he would have to risk his life to save the town."]}
]