[
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/8686650-continuous-delivery", "image": ["https://images.gr-assets.com/books/1347640457l/8686650.jpg"], "avg_ratings": ["\n  4.16\n"], "num_reviews": ["\n  ", "\n  2,507\n  ratings\n"], "genres": ["Computer Science", "Programming", "Science", "Technology", "Computer Science", "Software", "Computer Science", "Technical"], "title": "Continuous Delivery: Reliable Software Releases Through Build, Test, and Deployment Automation", "author": "Jez Humble", "num_pages": "463", "awards": ["Jolt Award (2011)"], "places": [], "character_names": [], "language": "English", "ISBN": "0321601912", "description": ["Getting software released to users is often a painful, risky, and time-consuming process. This groundbreaking new book sets out the principles and technical practices that enable rapid, incremental delivery of high quality, valuable new functionality to users. Through automation of the build, deployment, and testing process, and improved collaboration between developers, testers, and operations, delivery teams can get changes released in a matter of hours-- sometimes even minutes-no matter what the size of a project or the complexity of its code base. Jez Humble and David Farley begin by presenting the foundations of a rapid, reliable, low-risk delivery process. Next, they introduce the \"deployment pipeline,\" an automated process for managing all changes, from check-in to release. Finally, they discuss the \"ecosystem\" needed to support continuous delivery, from infrastructure, data and configuration management to governance. The authors introduce state-of-the-art techniques, including automated infrastructure management and data migration, and the use of virtualization. For each, they review key issues, identify best practices, and demonstrate how to mitigate risks. Coverage includes - Automating all facets of building, integrating, testing, and deploying software - Implementing deployment pipelines at team and organizational levels - Improving collaboration between developers, testers, and operations - Developing features incrementally on large and distributed teams - Implementing an effective configuration management strategy - Automating acceptance testing, from analysis to implementation - Testing capacity and other non-functional requirements - Implementing continuous deployment and zero-downtime releases - Managing infrastructure, data, components and dependencies - Navigating risk management, compliance, and auditing Whether you're a developer, systems administrator, tester, or manager, this book will help your organization move from idea to release faster than ever--so you can deliver value to your business rapidly and reliably."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/11084145-steve-jobs", "image": ["https://images.gr-assets.com/books/1511288482l/11084145.jpg"], "avg_ratings": ["\n  4.12\n"], "num_reviews": ["\n  ", "\n  761,479\n  ratings\n"], "genres": ["Biography", "Nonfiction", "Business", "Science", "Technology"], "title": "Steve Jobs", "author": "Walter Isaacson", "num_pages": "656", "awards": ["Financial Times and McKinsey Business Book of the Year Nominee for Shortlist (2012)", "Premio Know Square (2011)"], "places": [], "character_names": ["Steve Jobs"], "language": "English", "ISBN": "1451648537", "description": ["From best-selling author Walter Isaacson comes the landmark biography of Apple co-founder Steve Jobs.", "In ", ", Isaacson provides an extraordinary account of Jobs' professional and personal life. Drawn from three years of exclusive and unprecedented interviews Isaacson has conducted with Jobs as well as extensive interviews with Jobs' family members and key colleagues from Apple and its competitors, ", " is the definitive portrait of the greatest innovator of his generation."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/566574.Out_of_the_Crisis", "image": ["https://images.gr-assets.com/books/1347485103l/566574.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  3,164\n  ratings\n"], "genres": ["Business", "Business", "Management", "Leadership", "Nonfiction"], "title": "Out of the Crisis", "author": "W. Edwards Deming", "num_pages": "524", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0262541157", "description": ["\"Long-term commitment to new learning and new philosophy is required of any management that seeks transformation. The timid and the fainthearted, and the people that expect quick results, are doomed to disappointment.\"", "According to W. Edwards Deming, American companies require nothing less than a transformation of management style and of governmental relations with industry. In Out of the Crisis, originally published in 1982, Deming offers a theory of management based on his famous 14 Points for Management. Management's failure to plan for the future, he claims, brings about loss of market, which brings about loss of jobs. Management must be judged not only by the quarterly dividend, but by innovative plans to stay in business, protect investment, ensure future dividends, and provide more jobs through improved product and service. In simple, direct language, he explains the principles of management transformation and how to apply them.", "Previously published by MIT-CAES"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/7108725-start-with-why", "image": ["https://images.gr-assets.com/books/1360936414l/7108725.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  67,248\n  ratings\n"], "genres": ["Business", "Leadership", "Nonfiction", "Self Help", "Self Help", "Personal Development", "Business", "Management"], "title": "Start with Why: How Great Leaders Inspire Everyone to Take Action", "author": "Simon Sinek", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1591842808", "description": ["Why are some people and organizations more innovative, more influential, and more profitable than others? Why do some command greater loyalty from customers and employees alike? Even among the successful, why are so few able to repeat their success over and over?", "People like Martin Luther King Jr., Steve Jobs, and the Wright Brothers might have little in common, but they all ", ". It was their natural ability to start with why that enabled them to inspire those around them and to achieve remarkable things.", "In studying the leaders who've had the greatest influence in the world, Simon Sinek discovered that they all think, act, and communicate in the exact same way—and it's the complete opposite of what everyone else does. Sinek calls this powerful idea The Golden Circle, and it provides a framework upon which organizations can be built, movements can be lead, and people can be inspired. And it all starts with WHY.", "Any organization can explain ", " it does; some can explain ", " they do it; but very few can clearly articulate ", ". WHY is not money or profit—those are always results. WHY does your organization exist? WHY does it do the things it does? WHY do customers really buy from one company or another? WHY are people loyal to some leaders, but not others?", "Starting with WHY works in big business and small business, in the nonprofit world and in politics. Those who start with WHY never manipulate, they inspire. And the people who follow them don't do so because they have to; they follow because they want to.", "Drawing on a wide range of real-life stories, Sinek weaves together a clear vision of what it truly takes to lead and inspire. This book is for anyone who wants to inspire others or who wants to find someone to inspire them."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/13530973-antifragile", "image": ["https://images.gr-assets.com/books/1352422827l/13530973.jpg"], "avg_ratings": ["\n  4.08\n"], "num_reviews": ["\n  ", "\n  24,538\n  ratings\n"], "genres": ["Nonfiction", "Philosophy", "Business", "Economics", "Psychology", "Science"], "title": "Antifragile: Things That Gain from Disorder", "author": "Nassim Nicholas Taleb", "num_pages": "426", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1400067820", "description": ["From the bestselling author of The Black Swan and one of the foremost philosophers of our time, Nassim Nicholas Taleb, a book on how some systems actually benefit from disorder.", "In The Black Swan Taleb outlined a problem; in Antifragility he offers a definitive solution: how to gain from disorder and chaos while being protected from fragilities and adverse events. For what he calls the \"antifragile\" is one step beyond robust, as it benefits from adversity, uncertainty and stressors, just as human bones get stronger when subjected to stress and tension.", "Taleb stands uncertainty on its head, making it desirable, and proposing that things be built in an antifragile manner. Extremely ambitious and multidisciplinary, Antifragility provides a blueprint for how to behave-and thrive-in a world we don't understand and which is too uncertain for us to even try to understand. He who is not antifragile will perish. Why is the city state better than the nation state, why is debt bad for you, and why is almost everything modern bound to fail? The book covers innovation, health, biology, medicine, life decisions, politics, foreign policy, urban planning, war, personal finance, and economic systems. Throughout, the voice and recipes of the ancient wisdom from Phoenician, Roman, Greek, and Medieval sources are heard loud and clear."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/26083308-the-devops-handbook", "image": ["https://images.gr-assets.com/books/1473461230l/26083308.jpg"], "avg_ratings": ["\n  4.35\n"], "num_reviews": ["\n  ", "\n  1,401\n  ratings\n"], "genres": ["Science", "Technology", "Business", "Computer Science", "Programming", "Nonfiction", "Computer Science", "Technical"], "title": "The DevOps Handbook: How to Create World-Class Agility, Reliability, and Security in Technology Organizations", "author": "Gene Kim", "num_pages": "437", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1942788002", "description": ["Increase profitability, elevate work culture, and exceed productivity goals through DevOps practices.", "More than ever, the effective management of technology is critical for business competitiveness. For decades, technology leaders have struggled to balance agility, reliability, and security. The consequences of failure have never been greater whether it's the healthcare.gov debacle, cardholder data breaches, or missing the boat with Big Data in the cloud.", "And yet, high performers using DevOps principles, such as Google, Amazon, Facebook, Etsy, and Netflix, are routinely and reliably deploying code into production hundreds, or even thousands, of times per day.", "Following in the footsteps of The Phoenix Project, The DevOps Handbook shows leaders how to replicate these incredible outcomes, by showing how to integrate Product Management, Development, QA, IT Operations, and Information Security to elevate your company and win in the marketplace.\""]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/8772005-unix-and-linux-system-administration-handbook", "image": ["https://images.gr-assets.com/books/1415581344l/8772005.jpg"], "avg_ratings": ["\n  4.39\n"], "num_reviews": ["\n  ", "\n  686\n  ratings\n"], "genres": ["Computer Science", "Programming", "Computer Science", "Technical", "Science", "Technology", "Reference", "Science", "Computer Science"], "title": "UNIX and Linux System Administration Handbook", "author": "Evi Nemeth", "num_pages": "1327", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0132117363", "description": [" -From the Foreword by Tim O'Reilly, founder of O'Reilly Media ", " -Jason A. Nunnelley", " -Pat Parseghian The twentieth anniversary edition of the world's best-selling UNIX system administration book has been made even better by adding coverage of the leading Linux distributions: Ubuntu, openSUSE, and RHEL. This book approaches system administration in a practical way and is an invaluable reference for both new administrators and experienced professionals. It details best practices for every facet of system administration, including storage management, network design and administration, email, web hosting, scripting, software configuration management, performance analysis, Windows interoperability, virtualization, DNS, security, management of IT service organizations, and much more. ", "reflects the current versions of these operating systems: Ubuntu(R) Linux", "openSUSE(R) Linux", "Red Hat(R) Enterprise Linux(R)", "Oracle America(R) Solaris(TM) (", ")", "HP HP-UX(R)", "IBM AIX(R)"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/6732019-rework", "image": ["https://images.gr-assets.com/books/1391275636l/6732019.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  119,238\n  ratings\n"], "genres": ["Business", "Nonfiction", "Business", "Entrepreneurship", "Business", "Management", "Productivity"], "title": "Rework", "author": "Jason Fried", "num_pages": "279", "awards": ["Goodreads Choice Award Nominee for Nonfiction (2010)"], "places": [], "character_names": [], "language": "English", "ISBN": "0307463745", "description": ["Most business books give you the same old advice: Write a business plan, study the competition, seek investors, yadda yadda. If you're looking for a book like that, put this one back on the shelf.", "shows you a better, faster, easier way to succeed in business. Read it and you'll know why plans are actually harmful, why you don't need outside investors, and why you're better off ignoring the competition. The truth is, you need less than you think. You don't need to be a workaholic. You don't need to staff up. You don't need to waste time on paperwork or meetings. You don't even need an office. Those are all just excuses. ", " What you really need to do is stop talking and start working. This book shows you the way. You'll learn how to be more productive, how to get exposure without breaking the bank, and tons more counterintuitive ideas that will inspire and provoke you.", "With its straightforward language and easy-is-better approach, ", "is the perfect playbook for anyone who’s ever dreamed of doing it on their own. Hardcore entrepreneurs, small-business owners, people stuck in day jobs they hate, victims of \"downsizing,\" and artists who don’t want to starve anymore will all find valuable guidance in these pages."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/172800.Beyond_the_Goal", "image": ["https://images.gr-assets.com/books/1387700289l/172800.jpg"], "avg_ratings": ["\n  3.98\n"], "num_reviews": ["\n  ", "\n  265\n  ratings\n"], "genres": ["Business", "Business", "Management", "Nonfiction", "Leadership"], "title": "Beyond the Goal: Eliyahu Goldratt Speaks on the Theory of Constraints", "author": "Eliyahu M. Goldratt", "num_pages": "0", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1596590238", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/4843318-the-art-of-capacity-planning", "image": ["https://images.gr-assets.com/books/1328834813l/4843318.jpg"], "avg_ratings": ["\n  3.76\n"], "num_reviews": ["\n  ", "\n  197\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Technical", "Computer Science", "Programming", "Nonfiction", "Architecture"], "title": "The Art of Capacity Planning: Scaling Web Resources", "author": "John Allspaw", "num_pages": "156", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0596518579", "description": ["Success on the web is measured by usage and growth. Web-based companies live or die by the ability to scale their infrastructure to accommodate increasing demand. This book is a hands-on and practical guide to planning for such growth, with many techniques and considerations to help you plan, deploy, and manage web application infrastructure.", " is written by the manager of data operations for the world-famous photo-sharing site Flickr.com, now owned by Yahoo! John Allspaw combines personal anecdotes from many phases of Flickr's growth with insights from his colleagues in many other industries to give you solid guidelines for measuring your growth, predicting trends, and making cost-effective preparations.", " Topics include:", "Evaluating tools for measurement and deployment Capacity analysis and prediction for storage, database, and application servers Designing architectures to easily add and measure capacity Handling sudden spikes Predicting exponential and explosive growth How cloud services such as EC2 can fit into a capacity strategy In this book, Allspaw draws on years of valuable experience, starting from the days when Flickr was relatively small and had to deal with the typical growth pains and cost/performance trade-offs of a typical company with a Web presence. The advice he offers in ", " will not only help you prepare for explosive growth, it will save you tons of grief."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/3799799-a-sense-of-urgency", "image": ["https://images.gr-assets.com/books/1352795031l/3799799.jpg"], "avg_ratings": ["\n  3.76\n"], "num_reviews": ["\n  ", "\n  1,436\n  ratings\n"], "genres": ["Business", "Leadership", "Nonfiction", "Business", "Management", "Buisness"], "title": "A Sense of Urgency", "author": "John P. Kotter", "num_pages": "208", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1422179710", "description": ["Most organizational change initiatives fail spectacularly (at worst) or deliver lukewarm results (at best). In his international bestseller Leading Change, John Kotter revealed why change is so hard, and provided an actionable, eight-step process for implementing successful transformations. The book became the change bible for managers worldwide.", "Now, in A Sense of Urgency, Kotter shines the spotlight on the crucial first step in his framework: creating a sense of urgency by getting people to actually see and feel the need for change.", "Why focus on urgency? Without it, any change effort is doomed. Kotter reveals the insidious nature of complacency in all its forms and guises.", "In this exciting new book, Kotter explains:", "· How to go beyond \"the business case\" for change to overcome the fear and anger that can suppress urgency", "· Ways to ensure that your actions and behaviors -- not just your words -- communicate the need for change", "· How to keep fanning the flames of urgency even after your transformation effort has scored some early successes", "Written in Kotter's signature no-nonsense style, this concise and authoritative guide helps you set the stage for leading a successful transformation in your company."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/18921679-cultures-and-organizations", "image": ["https://images.gr-assets.com/books/1385264314l/18921679.jpg"], "avg_ratings": ["\n  4.08\n"], "num_reviews": ["\n  ", "\n  857\n  ratings\n"], "genres": ["Business", "Nonfiction", "Cultural", "Psychology", "Business", "Management", "Sociology"], "title": "Cultures and Organizations: Software of the Mind, Third Edition", "author": "Geert Hofstede", "num_pages": "577", "awards": [], "places": [], "character_names": [], "language": "English", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/8472150-behind-human-error", "image": [], "avg_ratings": ["\n  4.12\n"], "num_reviews": ["\n  ", "\n  25\n  ratings\n"], "genres": ["Psychology", "Business"], "title": "Behind human error : cognitive systems, computers, and hindsight", "author": "David D. Woods", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "33159479", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/507952.Empires_of_Light", "image": ["https://images.gr-assets.com/books/1320508996l/507952.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  1,531\n  ratings\n"], "genres": ["History", "Nonfiction", "Science", "Biography", "Business", "Science", "Technology", "North American Hi...", "American History"], "title": "Empires of Light: Edison, Tesla, Westinghouse, and the Race to Electrify the World", "author": "Jill Jonnes", "num_pages": "464", "awards": [], "places": [], "character_names": ["Thomas Edison", "George Westinghouse", "Nikola Tesla"], "language": "English", "ISBN": "0375758844", "description": ["In the final decades of the nineteenth century, three brilliant and visionary titans of America’s Gilded Age—Thomas Edison, Nikola Tesla, and George Westinghouse—battled bitterly as each vied to create a vast and powerful electrical empire. In ", ", historian Jill Jonnes portrays this extraordinary trio and their riveting and ruthless world of cutting-edge science, invention, intrigue, money, death, and hard-eyed Wall Street millionaires. At the heart of the story are Thomas Alva Edison, the nation’s most famous and folksy inventor, creator of the incandescent light bulb and mastermind of the world’s first direct current electrical light networks; the Serbian wizard of invention Nikola Tesla, elegant, highly eccentric, a dreamer who revolutionized the generation and delivery of electricity; and the charismatic George Westinghouse, Pittsburgh inventor and tough corporate entrepreneur, an industrial idealist who in the era of gaslight imagined a world powered by cheap and plentiful electricity and worked heart and soul to create it. ", "Edison struggled to introduce his radical new direct current (DC) technology into the hurly-burly of New York City as Tesla and Westinghouse challenged his dominance with their alternating current (AC), thus setting the stage for one of the eeriest feuds in American corporate history, the War of the Electric Currents. The battlegrounds: Wall Street, the 1893 Chicago World’s Fair, Niagara Falls, and, finally, the death chamber—Jonnes takes us on the tense walk down a prison hallway and into the sunlit room where William Kemmler, convicted ax murderer, became the first man to die in the electric chair. ", " is the gripping history of electricity, the “mysterious fluid,” and how the fateful collision of Edison, Tesla, and Westinghouse left the world utterly transformed."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/18946339-the-5-languages-of-appreciation-in-the-workplace", "image": ["https://images.gr-assets.com/books/1385392140l/18946339.jpg"], "avg_ratings": ["\n  3.68\n"], "num_reviews": ["\n  ", "\n  1,886\n  ratings\n"], "genres": ["Business", "Nonfiction", "Leadership", "Self Help", "Psychology"], "title": "The 5 Languages of Appreciation in the Workplace: Empowering Organizations by Encouraging People", "author": "Gary Chapman", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["The 5 Languages of Appreciation in the Workplace applies the love language concept to the workplace. This book helps supervisors and managers effectively communicate appreciation and encouragement to their employees, resulting in higher levels of job satisfaction, healthier relationships between managers and employees, and decreased cases of burnout. Ideal for both the profit and non-profit sectors, the principles presented in this book have a proven history of success in businesses, schools, medical offices, churches, and industry. Each book contains an access code for the reader to take a comprehensive online MBA Inventory (Motivating By Appreciation) - a $20 value. The inventory is designed to provide a clearer picture of an individual's primary language of appreciation and motivation as experienced in a work-related setting. It identifies individuals' preference in the languages of appreciation. Understanding an individual's primary and secondary languages of appreciation can assist managers and supervisors in communicating effectively to their team members."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/101438.Skunk_Works", "image": ["https://images.gr-assets.com/books/1344267416l/101438.jpg"], "avg_ratings": ["\n  4.40\n"], "num_reviews": ["\n  ", "\n  4,913\n  ratings\n"], "genres": ["History", "Nonfiction", "Biography", "War", "Military Fiction", "Aviation", "Science"], "title": "Skunk Works: A Personal Memoir of My Years at Lockheed", "author": "Ben R. Rich", "num_pages": "382", "awards": [], "places": [], "character_names": ["Francis Gary Powers", "Kelly Johnson", "Benjamin Robert Rich"], "language": "English", "ISBN": "0316743003", "description": ["From the development of the U-2 to the Stealth fighter, the never-before-told story behind the high-stakes quest to dominate the skies Skunk Works is the true story of America's most secret & successful aerospace operation. As recounted by Ben Rich, the operation's brilliant boss for nearly two decades, the chronicle of Lockheed's legendary Skunk Works is a drama of cold war confrontations and Gulf War air combat, of extraordinary feats of engineering & achievement against fantastic odds. Here are up-close portraits of the maverick band of scientists & engineers who made the Skunk Works so renowned. Filled with telling personal anecdotes & high adventure, with narratives from the CIA & from Air Force pilots who flew the many classified, risky missions, this book is a portrait of the most spectacular aviation triumphs of the 20th century."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/7090.The_Soul_of_a_New_Machine", "image": ["https://images.gr-assets.com/books/1441207522l/7090.jpg"], "avg_ratings": ["\n  4.10\n"], "num_reviews": ["\n  ", "\n  5,540\n  ratings\n"], "genres": ["Nonfiction", "Science", "Technology", "History", "Business", "Science", "Computer Science", "Computers"], "title": "The Soul of a New Machine", "author": "Tracy Kidder", "num_pages": "293", "awards": ["Pulitzer Prize for General Nonfiction (1982)", "National Book Award for General Nonfiction (Hardcover) (1982)"], "places": [], "character_names": [], "language": "English", "ISBN": "0316491977", "description": ["The computer revolution brought with it new methods of getting work done—just look at today's news for reports of hard-driven, highly-motivated young software and online commerce developers who sacrifice evenings and weekends to meet impossible deadlines. Tracy Kidder got a preview of this world in the late 1970s when he observed the engineers of Data General design and build a new 32-bit minicomputer in just one year. His thoughtful, prescient book, ", ", tells stories of 35-year-old \"veteran\" engineers hiring recent college graduates and encouraging them to work harder and faster on complex and difficult projects, exploiting the youngsters' ignorance of normal scheduling processes while engendering a new kind of work ethic.", "These days, we are used to the \"total commitment\" philosophy of managing technical creation, but Kidder was surprised and even a little alarmed at the obsessions and compulsions he found. From in-house political struggles to workers being permitted to tease management to marathon 24-hour work sessions, ", " explores concepts that already seem familiar, even old-hat, less than 20 years later. Kidder plainly admires his subjects; while he admits to hopeless confusion about their work, he finds their dedication heroic. The reader wonders, though, what will become of it all, now and in the future. "]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/8125342-the-toyota-way", "image": ["https://images.gr-assets.com/books/1465306788l/8125342.jpg"], "avg_ratings": ["\n  4.05\n"], "num_reviews": ["\n  ", "\n  6,163\n  ratings\n"], "genres": ["Business", "Business", "Management", "Nonfiction", "Leadership"], "title": "The Toyota Way: 14 Management Principles from the World's Greatest Manufacturer", "author": "Jeffrey K. Liker", "num_pages": "330", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["In factories around the world, Toyota consistently makes the highest-quality cars with the fewest defects of any competing manufacturer, while using fewer man-hours, less on-hand inventory, and half the floor space of its competitors. ", " is the first book for a general audience that explains the management principles and business philosophy behind Toyota's worldwide reputation for quality and reliability.", "Complete with profiles of organizations that have successfully adopted Toyota's principles, this book shows managers in every industry how to improve business processes by:", "* Eliminating wasted time and resources", "* Building quality into workplace systems", "* Finding low-cost but reliable alternatives to expensive new technology", "* Producing in small quantities", "* Turning every employee into a quality control inspector"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/68985.The_Power_of_Full_Engagement", "image": ["https://images.gr-assets.com/books/1431760957l/68985.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  10,733\n  ratings\n"], "genres": ["Business", "Self Help", "Nonfiction", "Productivity", "Self Help", "Personal Development", "Psychology"], "title": "The Power of Full Engagement: Managing Energy, Not Time, Is the Key to High Performance and Personal Renewal", "author": "Jim Loehr", "num_pages": "222", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0743226755", "description": ["This groundbreaking", " bestseller has helped hundreds of thousands of people at work and at home balance stress and recovery and sustain high performance despite crushing workloads and 24/7 demands on their time. “Combines the gritty toughmindedness of the best coaches with the gentle-but-insistent inspiration of the most effective spiritual advisers” (", ").", "We live in digital time. Our pace is rushed, rapid-fire, and relentless. Facing crushing workloads, we try to cram as much as possible into every day. We're wired up, but we're melting down. Time management is no longer a viable solution. As bestselling authors Jim Loehr and Tony Schwartz demonstrate in this groundbreaking book, managing energy, not time, is the key to enduring high performance as well as to health, happiness, and life balance. The Power of Full Engagement is a highly practical, scientifically based approach to managing your energy more skillfully both on and off the job by laying out the key training principles and provides a powerful, step-by-step program that will help you to:", "* Mobilize four key sources of energy", " * Balance energy expenditure with intermittent energy renewal", " * Expand capacity in the same systematic way that elite athletes do", " * Create highly specific, positive energy management rituals to make lasting changes", "Above all, this book provides a life-changing road map to becoming more fully engaged on and off the job, meaning physically energized, emotionally connected, mentally focused, and spiritually aligned."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/141499.Failure_is_Not_an_Option", "image": ["https://images.gr-assets.com/books/1442273536l/141499.jpg"], "avg_ratings": ["\n  4.25\n"], "num_reviews": ["\n  ", "\n  5,591\n  ratings\n"], "genres": ["Nonfiction", "Space", "History", "Biography", "Science", "Autobiography", "Memoir"], "title": "Failure is Not an Option: Mission Control From Mercury to Apollo 13 and Beyond", "author": "Gene Kranz", "num_pages": "416", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0425179877", "description": ["This memoir of a veteran NASA flight director tells riveting stories from the early days of the Mercury program through Apollo 11 (the moon landing) and Apollo 13, for both of which Kranz was flight director.", "Gene Kranz was present at the creation of America’s manned space program and was a key player in it for three decades. As a flight director in NASA’s Mission Control, Kranz witnessed firsthand the making of history. He participated in the space program from the early days of the Mercury program to the last Apollo mission, and beyond. He endured the disastrous first years when rockets blew up and the United States seemed to fall further behind the Soviet Union in the space race. He helped to launch Alan Shepard and John Glenn, then assumed the flight director’s role in the Gemini program, which he guided to fruition. With his teammates, he accepted the challenge to carry out President John F. Kennedy’s commitment to land a man on the Moon before the end of the 1960s. ", "Kranz recounts these thrilling historic events and offers new information about the famous flights. What appeared as nearly flawless missions to the Moon were, in fact, a series of hair-raising near misses. When the space technology failed, as it sometimes did, the controllers’ only recourse was to rely on their skills and those of their teammates. He reveals behind-the-scenes details to demonstrate the leadership, discipline, trust, and teamwork that made the space program a success. ", "A fascinating firsthand account by a veteran mission controller of one of America’s greatest achievements, ", " reflects on what has happened to the space program and offers his own bold suggestions about what we ought to be doing in space now."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/141498.Flight", "image": ["https://images.gr-assets.com/books/1437441874l/141498.jpg"], "avg_ratings": ["\n  4.23\n"], "num_reviews": ["\n  ", "\n  922\n  ratings\n"], "genres": ["Space", "Nonfiction", "Biography", "History", "Science", "Autobiography", "Memoir"], "title": "Flight: My Life in Mission Control", "author": "Christopher Kraft", "num_pages": "384", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0452283043", "description": ["In his ", " bestseller, Chris Kraft delivers an unforgettable account of his life in Mission Control. The first NASA flight director, Kraft emerged from boyhood in small-town America to become a visionary who played an integral role in what would become the National Aeronautics and Space Administration. It's all here, from the legendary Mercury missions that first sent Americans into space through the Gemini and Apollo missions that landed them on the moon. The great heroes of space are here, too-Alan Shepard, John Glenn, Neil Armstrong, Jim Lovell, and Buzz Aldrin-leading the space race that would change the course of U.S. history. ", " From NASA's infancy to its greatest triumphs . . . from the calculated gambles to the near disasters to the pure luck that accompanied each mission, Flight relives the spellbinding events that captured the imagination of the world. It is a stirring tribute to the U.S. space program and to the men who risked their lives to take America on a flight into the unknown-from the man who was there for it all. ", " \"A highly readable memoir.\" (", ") ", " \"A rewarding look at the brief, shining moment when space pathfinders held sway over space warriors.\" (", ")"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/11751772-the-rickover-effect", "image": ["https://images.gr-assets.com/books/1348323146l/11751772.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  113\n  ratings\n"], "genres": ["History", "Biography", "Leadership", "Business", "Management", "Nonfiction"], "title": "The Rickover Effect: How One Man Made a Difference", "author": "Theodore Rockwell", "num_pages": "488", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "059574527X", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/12675109-great-by-choice", "image": ["https://images.gr-assets.com/books/1328317436l/12675109.jpg"], "avg_ratings": ["\n  4.09\n"], "num_reviews": ["\n  ", "\n  14,544\n  ratings\n"], "genres": ["Business", "Leadership", "Nonfiction", "Business", "Management", "Self Help"], "title": "Great by Choice: Uncertainty, Chaos, and Luck—Why Some Thrive Despite Them All", "author": "James C. Collins", "num_pages": "183", "awards": [], "places": [], "character_names": [], "language": "English", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/22875447-work-rules", "image": ["https://images.gr-assets.com/books/1420790922l/22875447.jpg"], "avg_ratings": ["\n  4.16\n"], "num_reviews": ["\n  ", "\n  8,599\n  ratings\n"], "genres": ["Business", "Nonfiction", "Leadership", "Business", "Management", "Self Help"], "title": "Work Rules!: Insights from Inside Google That Will Transform How You Live and Lead", "author": "Laszlo Bock", "num_pages": "406", "awards": ["Goodreads Choice Award Nominee for Nonfiction (2015)"], "places": [], "character_names": [], "language": "English", "ISBN": "1455554790", "description": [" \"We spend more time working than doing anything else in life. It's not right that the experience of work should be so demotivating and dehumanizing.\" So says Laszlo Bock, head of People Operations at the company that transformed how the world interacts with knowledge. ", " This insight is the heart of WORK RULES!, a compelling and surprisingly playful manifesto that offers lessons including:", "Take away managers' power over employees", "Learn from your best employees-and your worst", "Hire only people who are smarter than you are, no matter how long it takes to find them", "Pay unfairly (it's more fair!)", "Don't trust your gut: Use data to predict and shape the future", "Default to open-be transparent and welcome feedback", "If you're comfortable with the amount of freedom you've given your employees, you haven't gone far enough.", " Drawing on the latest research in behavioral economics and a profound grasp of human psychology, WORK RULES! also provides teaching examples from a range of industries-including lauded companies that happen to be hideous places to work and little-known companies that achieve spectacular results by valuing and listening to their employees. Bock takes us inside one of history's most explosively successful businesses to reveal why Google is consistently rated one of the best places to work in the world, distilling 15 years of intensive worker R&D into principles that are easy to put into action, whether you're a team of one or a team of thousands.", " WORK RULES! shows how to strike a balance between creativity and structure, leading to success you can measure in quality of life as well as market share. Read it to build a better company from within rather than from above; read it to reawaken your joy in what you do."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/5558.iWoz", "image": ["https://images.gr-assets.com/books/1388599741l/5558.jpg"], "avg_ratings": ["\n  3.85\n"], "num_reviews": ["\n  ", "\n  12,507\n  ratings\n"], "genres": ["Biography", "Nonfiction", "Science", "Technology", "Business", "Biography", "Autobiography", "Autobiography", "Memoir"], "title": "iWoz", "author": "Steve Wozniak", "num_pages": "313", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0393061434", "description": ["The mastermind behind Apple sheds his low profile and steps forward to tell his story for the first time.", "Before cell phones that fit in the palm of your hand and slim laptops that fit snugly into briefcases, computers were like strange, alien vending machines. They had cryptic switches, punch cards and pages of encoded output. But in 1975, a young engineering wizard named Steve Wozniak had an idea: What if you combined computer circuitry with a regular typewriter keyboard and a video screen? The result was the first true personal computer, the Apple I, a widely affordable machine that anyone could understand and figure out how to use.", "Wozniak's life\u0097before and after Apple\u0097is a \"home-brew\" mix of brilliant discovery and adventure, as an engineer, a concert promoter, a fifth-grade teacher, a philanthropist, and an irrepressible prankster. From the invention of the first personal computer to the rise of Apple as an industry giant, ", " presents a no-holds-barred, rollicking, firsthand account of the humanist inventor who ignited the computer revolution."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/6308439-hadoop", "image": ["https://images.gr-assets.com/books/1347649862l/6308439.jpg"], "avg_ratings": ["\n  3.94\n"], "num_reviews": ["\n  ", "\n  693\n  ratings\n"], "genres": ["Computer Science", "Programming", "Science", "Technology", "Computer Science", "Technical", "Nonfiction"], "title": "Hadoop: The Definitive Guide", "author": "Tom  White", "num_pages": "528", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0596521979", "description": [" helps you harness the power of your data. Ideal for processing large datasets, the Apache Hadoop framework is an open source implementation of the MapReduce algorithm on which Google built its empire. This comprehensive resource demonstrates how to use Hadoop to build reliable, scalable, distributed systems: programmers will find details for analyzing large datasets, and administrators will learn how to set up and run Hadoop clusters.", " Complete with case studies that illustrate how Hadoop solves specific problems, this book helps you:", "Use the Hadoop Distributed File System (HDFS) for storing large datasets, and run distributed computations over those datasets using MapReduce Become familiar with Hadoop's data and I/O building blocks for compression, data integrity, serialization, and persistence Discover common pitfalls and advanced features for writing real-world MapReduce programs Design, build, and administer a dedicated Hadoop cluster, or run Hadoop in the cloud Use Pig, a high-level query language for large-scale data processing Take advantage of HBase, Hadoop's database for structured and semi-structured data Learn ZooKeeper, a toolkit of coordination primitives for building distributed systems If you have lots of data -- whether it's gigabytes or petabytes -- Hadoop is the perfect solution. ", " is the most thorough book available on the subject.", " \"Now you have the opportunity to learn about Hadoop from a master-not only of the technology, but also of common sense and plain talk.\" -- Doug Cutting, Hadoop Founder, Yahoo!"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/18905747-building-a-devops-culture", "image": ["https://images.gr-assets.com/books/1387003732l/18905747.jpg"], "avg_ratings": ["\n  3.40\n"], "num_reviews": ["\n  ", "\n  331\n  ratings\n"], "genres": ["Computer Science", "Technical", "Business", "Science", "Technology"], "title": "Building a DevOps Culture", "author": "Mandi Walls", "num_pages": "24", "awards": [], "places": [], "character_names": [], "language": "English", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/447648.Getting_Real", "image": ["https://images.gr-assets.com/books/1384467434l/447648.jpg"], "avg_ratings": ["\n  4.01\n"], "num_reviews": ["\n  ", "\n  7,731\n  ratings\n"], "genres": ["Business", "Nonfiction", "Computer Science", "Programming", "Business", "Entrepreneurship", "Science", "Technology", "Design"], "title": "Getting Real: The Smarter, Faster, Easier Way to Build a Web Application", "author": "37 Signals", "num_pages": "171", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Book report", "Getting Real is the business, design, programming, and marketing philosophies of 37signals — a developer of web-based software used by over 1 million people and businesses in 70 countries.", "Why is the book relevant?", "37signals used the unconventional Getting Real process to launch five successful web-based applications (Basecamp, Campfire, Backpack, Writeboard, Ta-da List), and Ruby on Rails, an open-source web application framework, in just two years with no funding, no debt, and only 7 people.", "What's in it for me?", "Anyone working on a web app — including entrepreneurs, designers, programmers, executives, or marketers — will find value, fresh perspectives, and inspiration in this practical book. At under 200 pages it's quick reading too. Makes a great airplane book."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/29974755-the-leader-s-guide", "image": ["https://images.gr-assets.com/books/1467387718l/29974755.jpg"], "avg_ratings": ["\n  4.06\n"], "num_reviews": ["\n  ", "\n  473\n  ratings\n"], "genres": ["Business", "Leadership", "Nonfiction"], "title": "The Leader's Guide", "author": "Eric Ries", "num_pages": "367", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["The Leader’s Guide is aimed at entrepreneurs, executives, or anyone leading a project or team. It contains stories about how companies both large and small are adopting Lean Startup methods to scale successfully and operate in conditions of extreme uncertainty.", "The Leader’s Guide is for both those who are new to Lean Startup as well as those who love the methodology in principle, but want to know more about how to put it into practice."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/258608.UNIX_Network_Programming_Volume_2", "image": ["https://images.gr-assets.com/books/1388282066l/258608.jpg"], "avg_ratings": ["\n  4.33\n"], "num_reviews": ["\n  ", "\n  168\n  ratings\n"], "genres": ["Computer Science", "Programming", "Reference", "Science", "Technology", "Computer Science", "Computers", "Science", "Computer Science"], "title": "UNIX Network Programming, Volume 2: Interprocess Communications", "author": "W. Richard Stevens", "num_pages": "592", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0130810819", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/848514.Critical_Chain", "image": ["https://images.gr-assets.com/books/1347572652l/848514.jpg"], "avg_ratings": ["\n  3.96\n"], "num_reviews": ["\n  ", "\n  2,476\n  ratings\n"], "genres": ["Business", "Business", "Management", "Nonfiction", "Leadership", "Reference", "Audiobook", "Economics", "Buisness", "Science", "Technology", "Computer Science", "Technical"], "title": "Critical Chain", "author": "Eliyahu M. Goldratt", "num_pages": "246", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0884271536", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/9973202-the-art-of-action", "image": ["https://images.gr-assets.com/books/1387302434l/9973202.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  316\n  ratings\n"], "genres": ["Business", "Leadership", "Business", "Management", "Nonfiction", "War", "Military Fiction", "Business", "Entrepreneurship", "History"], "title": "The Art of Action: How Leaders Close the Gaps between Plans, Actions and Results", "author": "Stephen Bungay", "num_pages": "289", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1857885597", "description": ["What do you want me to do? This question is the enduring management issue, a perennial problem that Stephen Bungay shows has an old solution that is counter-intuitive and yet common sense. ", " is a thought-provoking and fresh look at how managers can turn planning into execution, and execution into results.", "Drawing on his experience as a consultant, senior manager and a highly respected military historian, Stephen Bungay takes a close look at the nineteenth-century Prussian Army, which built its agility on the initiative of its highly empowered junior officers, to show business leaders how they can build more effective, productive organizations. Based on a theoretical framework which has been tested in practice over 150 years, Bungay shows how the approach known as 'mission command' has been applied in businesses as diverse as pharmaceuticals and F1 racing today. ", " is scholarly but engaging, rigorous but pragmatic, and shows how common sense can sometimes be surprising."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/26857472-agile-done-right", "image": ["https://images.gr-assets.com/books/1443877388l/26857472.jpg"], "avg_ratings": ["\n  5.00\n"], "num_reviews": ["\n  ", "\n  2\n  ratings\n"], "genres": [], "title": "Agile Done Right : Miraculous Outcomes Overnight", "author": "Sam  Adams", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Agile Scrum Lean Kanban XP. Are you starting with your agile journey? Is your organisation in the middle of agile transformation? What does it mean to be agile? How do you know if your organisation is agile or not agile? How do you measure success of agile? ", "Agile Done Right explains in detail, agility in today's world. The core Lean principles and philosophy behind it. Milestones and pitfalls on the way. Provides practical advice on how to make your organisation agile in the right way."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/22837751-automation-and-monitoring-with-hubot-for-devops-and-developers", "image": ["https://images.gr-assets.com/books/1406610670l/22837751.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  6\n  ratings\n"], "genres": [], "title": "Automation and Monitoring with Hubot for DevOps and Developers", "author": "Tomas Varaneckas", "num_pages": "107", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "B00URMH4UK", "description": ["This book covers everything you need to start using Hubot in your organization - installation on Linux, production grade deployment and init.d scripts. You will understand how Hubot scripts work, how to deal with dependencies, how to install new scripts and adjust them to suit your needs.", "You will also learn to write and debug your own scripts, ranging from simple ones with just a few lines of code, to advanced ones that integrate several systems together.", "There is a whole chapter for those who use GitHub - Hubot can do many wonderful things using GitHub API and web hooks. The book will show you ways to automate your infrastructure tasks and deployments using Jenkins, ways to integrate with numerous systems and services.", "This knowledge was extracted from real world use and compacted into a single book. You can use it as a cookbook and pick just the things you need, or you can read it cover to cover and learn everything you can about using Hubot to full extent.", "You can get this book at: "]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/20358837-getting-value-out-of-agile-retrospectives---a-toolbox-of-retrospective-e", "image": ["https://images.gr-assets.com/books/1388818507l/20358837.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  122\n  ratings\n"], "genres": ["Nonfiction"], "title": "Getting Value out of Agile Retrospectives - A Toolbox of Retrospective Exercises", "author": "Luis Gonçalves", "num_pages": "76", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["This pocket book contains many exercises that you can use to do retrospectives, supported with the “what” and “why” of retrospectives, the business value and benefits that they can bring you, and advice for introducing and improving retrospectives.", "The book is published on ", " and ", " and in paperback on ", " and ", ".", "Agile retrospectives are a great way to continuously improve your way of working. Getting actions out of a retrospective that are doable, and getting them done helps teams to learn and improve. We hope that this book helps you and your teams to do retrospectives effectively and efficiently to reflect upon your ways of working, and continuously improve them!"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/12808111-pro-website-development-and-operations", "image": ["https://images.gr-assets.com/books/1345683085l/12808111.jpg"], "avg_ratings": ["\n  3.15\n"], "num_reviews": ["\n  ", "\n  13\n  ratings\n"], "genres": ["Computer Science", "Programming"], "title": "Pro Website Development and Operations: Streamlining Devops for Large-Scale Websites", "author": "Matthew Sacks", "num_pages": "124", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1430239697", "description": ["Pro Website Development and Operationsgives you the experience you need to create and operate a large-scale production website. Large-scale websites have their own unique set of problems regarding their designproblems that can get worse when agile methodologies are adopted for rapid results.Managing large-scale websites, deploying applications, and ensuring they are performing well often requires a full scale team involving the development and operations sides of the companytwo departments that don't always see eye to eye. When departments struggle with each other, it adds unnecessary complexity to the work, and that result shows in the customer experience.Pro Website Development and Operationsshows you how to streamline the work of web development and operations - incorporating the latestinsights and methodologies of DevOps - so that your large-scale website is up and running quickly, with little friction and extreme efficiency between divisions. This book provides critical knowledge for any developer engaged in delivering thebusiness and software engineering goals required tocreate and operatea large-scale production website. It addresses how developers can collaborate effectively with business and engineering teams to ensure applications are smoothly transitioned from product inception to implementation, and are properly deployed and managed. Pro Website Development and Operations provides unique insights into how systems, code, and process can all work together to make large-scale website development and operations ultra-efficient. What you'll learn How to tear down efficiency-hampering walls between development and operations How to speed up product launches How to spend less time managing your IT infrastructure, andmore time speeding up team collaboration How to better understand how software engineering and system administration can work together How to improve communications between engineering and operations How to reduce software launch errors Who this book is for", "Software developers and engineers working to create professional, large-scale websites. Table of Contents DevOps Principles for Successful Web Sites Aligning Engineering and Business Operations Web Testing Principles Designing Intelligent Documentation Automating Infrastructure and Application Provisioning Production Launches Mobile Web Integration"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/10758425-scalability-rules", "image": ["https://images.gr-assets.com/books/1348070951l/10758425.jpg"], "avg_ratings": ["\n  4.00\n"], "num_reviews": ["\n  ", "\n  207\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Software", "Computer Science", "Programming", "Computer Science", "Technical", "Computer Science", "Computers"], "title": "Scalability Rules: 50 Principles for Scaling Web Sites", "author": "Martin L. Abbott", "num_pages": "255", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0321753887", "description": ["\"Once again, Abbott and Fisher provide a book that I'll be giving to our engineers. It's an essential read for anyone dealing with scaling an online business.\"--Chris Lalonde, VP, Technical Operations and Infrastructure Architecture, Bullhorn \"Abbott and Fisher again tackle the difficult problem of scalability in their unique and practical manner. Distilling the challenges of operating a fast-growing presence on the Internet into 50 easy-to understand rules, the authors provide a modern cookbook of scalability recipes that guide the reader through the difficulties of fast growth.\"--Geoffrey Weber, Vice President, Internet Operations, Shutterfly \"Abbott and Fisher have distilled years of wisdom into a set of cogent principles to avoid many nonobvious mistakes.\"--Jonathan Heiliger, VP, Technical Operations, Facebook \"In \"The Art of Scalability,\" the AKF team taught us that scale is not just a technology challenge. Scale is obtained only through a combination of people, process, \"and \"technology. With \"Scalability Rules,\" Martin Abbott and Michael Fisher fill our scalability toolbox with easily implemented and time-tested rules that once applied will enable massive scale.\"--Jerome Labat, VP, Product Development IT, Intuit \"When I joined Etsy, I partnered with Mike and Marty to hit the ground running in my new role, and it was one of the best investments of time I have made in my career. The indispensable advice from my experience working with Mike and Marty is fully captured here in this book. Whether you're taking on a role as a technology leader in a new company or you simply want to make great technology decisions, \"Scalability Rules \"will be the go-to resource on your bookshelf.\"--Chad Dickerson, CTO, Etsy \"\"Scalability Rules \"provides an essential set of practical tools and concepts anyone can use when designing, upgrading, or inheriting a technology platform. It's very easy to focus on an immediate problem and overlook issues that will appear in the future. This book ensures strategic design principles are applied to everyday challenges.\"--Robert Guild, Director and Senior Architect, Financial Services \"An insightful, practical guide to designing and building scalable systems. A must-read for both product-building and operations teams, this book offers concise and crisp insights gained from years of practical experience of AKF principals. With the complexity of modern systems, scalability considerations should be an integral part of the architecture and implementation process. Scaling systems for hypergrowth requires an agile, iterative approach that is closely aligned with product features; this book shows you how.\"--Nanda Kishore, Chief Technology Officer, ShareThis \"For organizations looking to scale technology, people, and processes rapidly or effectively, the twin pairing of \"Scalability Rules \"and \"The Art of Scalability \"are unbeatable. The rules-driven approach in \"Scalability Rules \"makes this not only an easy reference companion, but also allows organizations to tailor the Abbott and Fisher approach to their specific needs both immediately and in the future!\"--Jeremy Wright, CEO, BNOTIONS.ca and Founder, b5media 50 Powerful, Easy-to-Use Rules for Supporting Hypergrowth in Any Environment \"Scalability Rules\" is the easy-to-use scalability primer and reference for every architect, developer, web professional, and manager. Authors Martin L. Abbott and Michael T. Fisher have helped scale more than 200 hypergrowth Internet sites through their consulting practice. Now, drawing on their unsurpassed experience, they present 50 clear, proven scalability rules-and practical guidance for applying them. Abbott and Fisher transform scalability from a \"black art\" to a set of realistic, technology-agnostic best practices for supporting hypergrowth in nearly any environment, including both frontend and backend systems. For architects, they offer powerful new insights for creating and evaluating designs. For developers, they share specific techniques for handling everything from databases to state. For managers, they provide invaluable help in goal-setting, decision-making, and interacting with technical teams. Whatever your role, you'll find practical risk/benefit guidance for setting priorities-and getting maximum \"bang for the buck.\" - Simplifying architectures and avoiding \"over-engineering\"- Scaling via cloning, replication, separating functionality, and splitting data sets- Scaling out, not up- Getting more out of databases without compromising scalability- Avoiding unnecessary redirects and redundant double-checking- Using caches and content delivery networks more aggressively, without introducing unacceptable complexity- Designing for fault tolerance, graceful failure, and easy rollback- Striving for statelessness when you can; efficiently handling state when you must- Effectively utilizing asynchronous communication- Learning quickly from mistakes, and much more"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/18167218-lean-enterprise", "image": ["https://images.gr-assets.com/books/1419979426l/18167218.jpg"], "avg_ratings": ["\n  4.25\n"], "num_reviews": ["\n  ", "\n  795\n  ratings\n"], "genres": ["Business", "Business", "Management", "Nonfiction", "Science", "Technology"], "title": "Lean Enterprise: How High Performance Organizations Innovate at Scale", "author": "Jez Humble", "num_pages": "352", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1449368425", "description": ["How well does your organization respond to changing market conditions, customer needs, and emerging technologies when building software-based products? This practical guide presents Lean and Agile principles and patterns to help you move fast at scale—and demonstrates why and how to apply these methodologies throughout your organization, rather than with just one department or team.", "Through case studies, you’ll learn how successful enterprises have rethought everything from governance and financial management to systems architecture and organizational culture in the pursuit of radically improved performance. Adopting Lean will take time and commitment, but it’s vital for harnessing the cultural and technical forces that are accelerating the rate of innovation.", "* Discover how Lean focuses on people and teamwork at every level, in contrast to traditional management practices", "* Approach problem-solving experimentally, by exploring solutions, testing assumptions, and getting feedback from real users", "* Lead and manage large-scale programs in a way that empowers employees, increases the speed and quality of delivery, and lowers costs", "* Learn how to implement ideas from the DevOps and Lean Startup movements even in complex, regulated environments"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/5900276-the-mission-the-men-and-me", "image": ["https://images.gr-assets.com/books/1440826279l/5900276.jpg"], "avg_ratings": ["\n  4.30\n"], "num_reviews": ["\n  ", "\n  2,908\n  ratings\n"], "genres": ["War", "Military Fiction", "Leadership", "Nonfiction", "War", "History", "Military", "Military History", "Biography", "Business", "Self Help", "Autobiography", "Memoir"], "title": "The Mission, the Men, and Me: Lessons from a Former Delta Force Commander", "author": "Pete Blaber", "num_pages": "336", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0425223728", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/638739.The_New_Economics_for_Industry_Government_Education", "image": ["https://images.gr-assets.com/books/1347488441l/638739.jpg"], "avg_ratings": ["\n  4.21\n"], "num_reviews": ["\n  ", "\n  341\n  ratings\n"], "genres": ["Business", "Business", "Management", "Leadership", "Economics", "Nonfiction"], "title": "The New Economics for Industry, Government, Education", "author": "W. Edwards Deming", "num_pages": "266", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0262541165", "description": ["In this book W. Edwards Deming details the system of transformation that underlies the 14 Points for Management presented in Out of the Crisis. The system of profound knowledge, as it is called, consists of four parts: appreciation for a system, knowledge about variation, theory of knowledge, and psychology. Describing prevailing management style as a prison, Deming shows how a style based on cooperation rather than competition can help people develop joy in work and learning at the same time that it brings about long-term success in the market. Indicative of Deming's philosophy is his advice to abolish performance reviews on the job and grades in school.", "Previously published by MIT-CAES"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/910055.Resilience_Engineering", "image": ["https://images.gr-assets.com/books/1348961940l/910055.jpg"], "avg_ratings": ["\n  4.26\n"], "num_reviews": ["\n  ", "\n  19\n  ratings\n"], "genres": ["Science", "Technology", "Design"], "title": "Resilience Engineering: Concepts and Precepts", "author": "Erik Hollnagel", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0754649040", "description": ["For Resilience Engineering, 'failure' is the result of the adaptations necessary to cope with the complexity of the real world, rather than a breakdown or malfunction. The performance of individuals and organizations must continually adjust to current conditions and, because resources and time are finite, such adjustments are always approximate. This definitive new book explores this groundbreaking new development in safety and risk management, where 'success' is based on the ability of organizations, groups and individuals to anticipate the changing shape of risk before failures and harm occur. Featuring contributions from many of the worlds leading figures in the fields of human factors and safety, Resilience Engineering provides thought-provoking insights into system safety as an aggregate of its various components, subsystems, software, organizations, human behaviours, and the way in which they interact. The book provides an introduction to Resilience Engineering of systems, covering both the theoretical and practical aspects. It is written for those responsible for system safety on managerial or operational levels alike, including safety managers and engineers (line and maintenance), security experts, risk and safety consultants, human factors professionals and accident investigators."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/25602743-effective-devops", "image": ["https://images.gr-assets.com/books/1441679000l/25602743.jpg"], "avg_ratings": ["\n  3.39\n"], "num_reviews": ["\n  ", "\n  153\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Programming", "Nonfiction"], "title": "Effective Devops: Building a Culture of Collaboration, Affinity, and Tooling at Scale", "author": "Jennifer       Davis", "num_pages": "410", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1491926309", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/762542.The_Four_Steps_to_the_Epiphany", "image": ["https://images.gr-assets.com/books/1347394098l/762542.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  10,769\n  ratings\n"], "genres": ["Business", "Business", "Entrepreneurship", "Nonfiction"], "title": "The Four Steps to the Epiphany: Successful Strategies for Startups That Win", "author": "Steve Blank", "num_pages": "281", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0976470705", "description": ["The essential book for anyone bringing a product to market, writing a business plan, marketing plan or sales plan. Step-by-step strategy of how to successfully organize sales, marketing and business development for a new product or company. The book offers insight into what makes some startups successful and leaves others selling off their furniture. Packed with concrete examples, the book will leave you with new skills to organize sales, marketing and your business for success."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/239240.UNIX_Network_Programming_Volume_1", "image": ["https://images.gr-assets.com/books/1388282063l/239240.jpg"], "avg_ratings": ["\n  4.34\n"], "num_reviews": ["\n  ", "\n  247\n  ratings\n"], "genres": ["Computer Science", "Programming", "Science", "Computer Science", "Science", "Technology", "Reference"], "title": "UNIX Network Programming, Volume 1: The Sockets Networking API", "author": "W. Richard Stevens", "num_pages": "991", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0131411551", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/10258783-drift-into-failure", "image": ["https://images.gr-assets.com/books/1356476010l/10258783.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  114\n  ratings\n"], "genres": ["Computer Science", "Programming", "Business", "Nonfiction"], "title": "Drift Into Failure: From Hunting Broken Components to Understanding Complex Systems", "author": "Sidney Dekker", "num_pages": "234", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1409422216", "description": ["What does the collapse of sub-prime lending have in common with a broken jackscrew in an airliner's tailplane? Or the oil spill disaster in the Gulf of Mexico with the burn-up of Space Shuttle Columbia? These were systems that drifted into failure. While pursuing success in a dynamic, complex environment with limited resources and multiple goal conflicts, a succession of small, everyday decisions eventually produced breakdowns on a massive scale. We have trouble grasping the complexity and normality that gives rise to such large events. We hunt for broken parts, fixable properties, people we can hold accountable. Our analyses of complex system breakdowns remain depressingly linear, depressingly componential - imprisoned in the space of ideas once defined by Newton and Descartes. The growth of complexity in society has outpaced our understanding of how complex systems work and fail. Our technologies have gotten ahead of our theories. We are able to build things - deep-sea oil rigs, jackscrews, collateralized debt obligations - whose properties we understand in isolation. But in competitive, regulated societies, their connections proliferate, their interactions and interdependencies multiply, their complexities mushroom. This book explores complexity theory and systems thinking to understand better how complex systems drift into failure. It studies sensitive dependence on initial conditions, unruly technology, tipping points, diversity - and finds that failure emerges opportunistically, non-randomly, from the very webs of relationships that breed success and that are supposed to protect organizations from disaster. It develops a vocabulary that allows us to harness complexity and find new ways of managing drift."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/606239._DROP_THE_PINK_ELEPHANT", "image": ["https://images.gr-assets.com/books/1348523896l/606239.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  201\n  ratings\n"], "genres": ["Nonfiction", "Psychology", "Business", "Humanities", "Language", "Self Help", "Language", "Communication"], "title": "(DROP THE PINK ELEPHANT: 15 WAYS TO SAY WHAT YOU MEAN - AND MEAN WHAT YOU SAY) BY Paperback", "author": "Bill McFarlan", "num_pages": "198", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1841126373", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/4865.How_to_Win_Friends_and_Influence_People", "image": ["https://images.gr-assets.com/books/1442726934l/4865.jpg"], "avg_ratings": ["\n  4.17\n"], "num_reviews": ["\n  ", "\n  417,123\n  ratings\n"], "genres": ["Nonfiction", "Self Help", "Business", "Psychology", "Self Help", "Personal Development"], "title": "How to Win Friends and Influence People", "author": "Dale Carnegie", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["You can go after the job you want...and get it! You can take the job you have...and improve it! You can take any situation you're in...and make it work for you!", "Since its release in 1936, ", " has sold more than 15 million copies. Dale Carnegie's first book is a timeless bestseller, packed with rock-solid advice that has carried thousands of now famous people up the ladder of success in their business and personal lives.", "As relevant as ever before, Dale Carnegie's principles endure, and will help you achieve your maximum potential in the complex and competitive modern age.", "Learn the six ways to make people like you, the twelve ways to win people to your way of thinking, and the nine ways to change people without arousing resentment."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/85041.Refactoring_to_Patterns", "image": ["https://images.gr-assets.com/books/1347966206l/85041.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  1,187\n  ratings\n"], "genres": ["Computer Science", "Programming", "Science", "Technology", "Science", "Computer Science", "Computer Science", "Software", "Computer Science", "Technical"], "title": "Refactoring to Patterns", "author": "Joshua Kerievsky", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0321213351", "description": ["In 1994, \"Design Patterns\" changed the landscape of object-oriented development by introducing classic solutions to recurring design problems. In 1999, \"Refactoring\" revolutionized design by introducing an effective process for improving code. With the highly anticipated \" Refactoring to Patterns ,\" Joshua Kerievsky has changed our approach to design by forever uniting patterns with the evolutionary process of refactoring.", "This book introduces the theory and practice of pattern-directed refactorings: sequences of low-level refactorings that allow designers to safely move designs to, towards, or away from pattern implementations. Using code from real-world projects, Kerievsky documents the thinking and steps underlying over two dozen pattern-based design transformations. Along the way he offers insights into pattern differences and how to implement patterns in the simplest possible ways.", "Coverage includes: A catalog of twenty-seven pattern-directed refactorings, featuring real-world code examples Descriptions of twelve design smells that indicate the need for this book s refactorings General information and new insights about patterns and refactoringDetailed implementation mechanics: how low-level refactorings are combined to implement high-level patterns Multiple ways to implement the same pattern and when to use each Practical ways to get started even if you have little experience with patterns or refactoring", "\"Refactoring to Patterns\" reflects three years of refinement and the insights of more than sixty software engineering thought leaders in the global patterns, refactoring, and agile development communities. Whether you re focused on legacy or greenfield development, this book will make you a better software designer by helping you learn how to make important design changes safely and effectively. ", "\""]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/23295849-devops-for-dummies", "image": ["https://images.gr-assets.com/books/1493121537l/23295849.jpg"], "avg_ratings": ["\n  2.96\n"], "num_reviews": ["\n  ", "\n  56\n  ratings\n"], "genres": ["Computer Science", "Programming", "Computer Science", "Technical"], "title": "DevOps for Dummies", "author": "Sanjeev Sharma", "num_pages": "40", "awards": [], "places": [], "character_names": [], "language": "English", "description": []},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/11468377-thinking-fast-and-slow", "image": ["https://images.gr-assets.com/books/1317793965l/11468377.jpg"], "avg_ratings": ["\n  4.12\n"], "num_reviews": ["\n  ", "\n  205,083\n  ratings\n"], "genres": ["Nonfiction", "Psychology", "Science", "Business", "Economics"], "title": "Thinking, Fast and Slow", "author": "Daniel Kahneman", "num_pages": "499", "awards": ["Los Angeles Times Book Prize for Current Interest (2011)", "Best Book of Ideas Prize Nominee (2012)", "Samuel Johnson Prize for Non-Fiction Nominee for Longlist (2012)", "Andrew Carnegie Medal Nominee for Nonfiction (2012)"], "places": [], "character_names": [], "language": "English", "ISBN": "0374275637", "description": ["In the highly anticipated ", ", Kahneman takes us on a groundbreaking tour of the mind and explains the two systems that drive the way we think. System 1 is fast, intuitive, and emotional; System 2 is slower, more deliberative, and more logical. Kahneman exposes the extraordinary capabilities—and also the faults and biases—of fast thinking, and reveals the pervasive influence of intuitive impressions on our thoughts and behavior. The impact of loss aversion and overconfidence on corporate strategies, the difficulties of predicting what will make us happy in the future, the challenges of properly framing risks at work and at home, the profound effect of cognitive biases on everything from playing the stock market to planning the next vacation—each of these can be understood only by knowing how the two systems work together to shape our judgments and decisions.", "Engaging the reader in a lively conversation about how we think, Kahneman reveals where we can and cannot trust our intuitions and how we can tap into the benefits of slow thinking. He offers practical and enlightening insights into how choices are made in both our business and our personal lives—and how we can use different techniques to guard against the mental glitches that often get us into trouble. ", " will transform the way you think about thinking."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/376964.Field_Guide_to_Understanding_Human_Error", "image": ["https://images.gr-assets.com/books/1387736357l/376964.jpg"], "avg_ratings": ["\n  4.15\n"], "num_reviews": ["\n  ", "\n  215\n  ratings\n"], "genres": ["Nonfiction", "Psychology", "Science", "Engineering", "Science", "Science", "Technology"], "title": "Field Guide to Understanding Human Error", "author": "Sidney Dekker", "num_pages": "252", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0754648265", "description": ["When faced with a human error problem, you may be tempted to ask 'Why didn't they watch out better? How could they not have noticed?'. You think you can solve your human error problem by telling people to be more careful, by reprimanding the miscreants, by issuing a new rule or procedure. These are all expressions of 'The Bad Apple Theory', where you believe your system is basically safe if it were not for those few unreliable people in it. This old view of human error is increasingly outdated and will lead you nowhere. The new view, in contrast, understands that a human error problem is actually an organizational problem. Finding a 'human error' by any other name, or by any other human, is only the beginning of your journey, not a convenient conclusion. The new view recognizes that systems are inherent trade-offs between safety and other pressures (for example: production). People need to create safety through practice, at all levels of an organization. Breaking new ground beyond its successful predecessor, The Field Guide to Understanding Human Error guides you through the traps and misconceptions of the old view. It explains how to avoid the hindsight bias, to zoom out from the people closest in time and place to the mishap, and resist the temptation of counterfactual reasoning and judgmental language. But it also helps you look forward. It suggests how to apply the new view in building your safety department, handling questions about accountability, and constructing meaningful countermeasures. It even helps you in getting your organization to adopt the new view and improve its learning from failure. So if you are faced by a human error problem, abandon the fallacy of a quick fix. Read this book."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/69242.Made_to_Stick", "image": ["https://images.gr-assets.com/books/1402600211l/69242.jpg"], "avg_ratings": ["\n  3.95\n"], "num_reviews": ["\n  ", "\n  60,956\n  ratings\n"], "genres": ["Business", "Nonfiction", "Psychology", "Leadership", "Language", "Communication"], "title": "Made to Stick: Why Some Ideas Survive and Others Die", "author": "Chip Heath", "num_pages": "291", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1400064287", "description": ["Mark Twain once observed, \"A lie can get halfway around the world before the truth can even get its boots on.\" His observation rings true: Urban legends, conspiracy theories, and bogus news stories circulate effortlessly. Meanwhile, people with important ideas--entrepreneurs, teachers, politicians, and journalists--struggle to make them \"stick.\"", "In ", ", Chip and Dan Heath reveal the anatomy of ideas that stick and explain ways to make ideas stickier, such as applying the human scale principle, using the Velcro Theory of Memory, and creating curiosity gaps. Along the way, we discover that sticky messages of all kinds--from the infamous \"kidney theft ring\" hoax to a coach's lessons on sportsmanship to a vision for a new product at Sony--draw their power from the same six traits.", " will transform the way you communicate. It's a fast-paced tour of success stories (and failures): the Nobel Prize-winning scientist who drank a glass of bacteria to prove a point about stomach ulcers; the charities who make use of the Mother Teresa Effect; the elementary-school teacher whose simulation actually prevented racial prejudice.", "Provocative, eye-opening, and often surprisingly funny, ", " shows us the vital principles of winning ideas--and tells us how we can apply these rules to making our own messages stick."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/3228917-outliers", "image": ["https://images.gr-assets.com/books/1344266315l/3228917.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  419,874\n  ratings\n"], "genres": ["Nonfiction", "Psychology", "Business", "Self Help", "Sociology", "Science", "Audiobook", "Economics", "Self Help", "Personal Development", "Leadership"], "title": "Outliers: The Story of Success", "author": "Malcolm Gladwell", "num_pages": "309", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0316017922", "description": ["In this stunning new book, Malcolm Gladwell takes us on an intellectual journey through the world of \"outliers\"--the best and the brightest, the most famous and the most successful. He asks the question: what makes high-achievers different?", "His answer is that we pay too much attention to what successful people are like, and too little attention to where they are from: that is, their culture, their family, their generation, and the idiosyncratic experiences of their upbringing. Along the way he explains the secrets of software billionaires, what it takes to be a great soccer player, why Asians are good at math, and what made the Beatles the greatest rock band."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/12609433-the-power-of-habit", "image": ["https://images.gr-assets.com/books/1545854312l/12609433.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  231,036\n  ratings\n"], "genres": ["Nonfiction", "Psychology", "Self Help", "Business", "Self Help", "Personal Development"], "title": "The Power of Habit: Why We Do What We Do in Life and Business", "author": "Charles Duhigg", "num_pages": "375", "awards": ["Financial Times and McKinsey Business Book of the Year Nominee for Longlist (2012)", "Goodreads Choice Award Nominee for Nonfiction (2012)"], "places": [], "character_names": [], "language": "English", "ISBN": "1400069289", "description": ["A young woman walks into a laboratory. Over the past two years, she has transformed almost every aspect of her life. She has quit smoking, run a marathon, and been promoted at work. The patterns inside her brain, neurologists discover, have fundamentally changed.", "Marketers at Procter & Gamble study videos of people making their beds. They are desperately trying to figure out how to sell a new product called Febreze, on track to be one of the biggest flops in company history. Suddenly, one of them detects a nearly imperceptible pattern—and with a slight shift in advertising, Febreze goes on to earn a billion dollars a year.", "An untested CEO takes over one of the largest companies in America. His first order of business is attacking a single pattern among his employees—how they approach worker safety—and soon the firm, Alcoa, becomes the top performer in the Dow Jones.", "What do all these people have in common? They achieved success by focusing on the patterns that shape every aspect of our lives. ", "They succeeded by transforming habits.", "In ", "award-winning ", " business reporter Charles Duhigg takes us to the thrilling edge of scientific discoveries that explain why habits exist and how they can be changed. With penetrating intelligence and an ability to distill vast amounts of information into engrossing narratives, Duhigg brings to life a whole new understanding of human nature and its potential for transformation. ", "Along the way we learn why some people and companies struggle to change, despite years of trying, while others seem to remake themselves overnight. We visit laboratories where neuroscientists explore how habits work and where, exactly, they reside in our brains. We discover how the right habits were crucial to the success of Olympic swimmer Michael Phelps, Starbucks CEO Howard Schultz, and civil-rights hero Martin Luther King, Jr. We go inside Procter & Gamble, Target superstores, Rick Warren’s Saddleback Church, NFL locker rooms, and the nation’s largest hospitals and see how implementing so-called keystone habits can earn billions and mean the difference between failure and success, life and death.", "At its core, ", " contains an exhilarating argument: The key to exercising regularly, losing weight, raising exceptional children, becoming more productive, building revolutionary companies and social movements, and achieving success is understanding how habits work. ", "Habits aren’t destiny. As Charles Duhigg shows, by harnessing this new science, we can transform our businesses, our communities, and our lives."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/505565.TCP_IP_Illustrated_Volumes_1_3_Boxed_Set", "image": ["https://images.gr-assets.com/books/1348515494l/505565.jpg"], "avg_ratings": ["\n  4.70\n"], "num_reviews": ["\n  ", "\n  27\n  ratings\n"], "genres": ["Science", "Technology"], "title": "TCP/IP Illustrated Volumes 1-3 Boxed Set", "author": "W. Richard Stevens", "num_pages": "2152", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0201776316", "description": ["All three volumes of TCP/IP Illustrated in one handsome slipcase -- all at a great price Plus bonus poster -- W. Richard Stevens' classic TCP/IP guides -- all brought together for the first time", "-- Master TCP/IP through clear explanations and actual data captured from live networks.", "-- Added bonus Includes new data structures poster, exclusive with this boxed set.", "Now, for the first time, all three volumes of W. Richard Stevens' classic TCP/IP Illustrated books have been brought together, at one special price. These books have become legends for their clear explanations, well-designed figures, and real-world demonstrations of TCP/IP in action, using actual data collected from real diagnostic programs. This new package also includes an exclusive data structures poster -- and the handsome slipcase makes it an ideal gift for networking professionals, students, and graduates. Volume 1 presents an in-depth introduction to the TCP/IP protocol suite, including the link layer, IP, ARP, RARP, ICMP, Ping, Traceroute, IP routing, dynamic routing protocols such as RIP and OSPF, UDP, broadcasting, multicasting, DNS, BOOTP, SNMP, FTP, NFS, and more. Volume 2 focuses on the implementation of TCP/IP protocols, teaching by example through 500 illustrations and 15,000 lines of real, working code. Volume 3 focuses on four crucial TCP/IP programming topics: T/TCP (TCP for Transactions); HTTP; NNTP; and the UNIX domain protocols."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/7282390-the-art-of-scalability", "image": ["https://images.gr-assets.com/books/1347338584l/7282390.jpg"], "avg_ratings": ["\n  3.96\n"], "num_reviews": ["\n  ", "\n  254\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Programming", "Computer Science", "Software", "Computer Science", "Technical"], "title": "The Art of Scalability: Scalable Web Architecture, Processes, and Organizations for the Modern Enterprise", "author": "Martin L. Abbott", "num_pages": "559", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0137030428", "description": ["A Comprehensive, Proven Approach to IT Scalability from Two Veteran Software, Technology, and Business Executives In \"The Art of Scalability, \" AKF Partners cofounders Martin L. Abbott and Michael T. Fisher cover everything IT and business leaders must know to build technology infrastructures that can scale smoothly to meet any business requirement. Drawing on their unparalleled experience managing some of the world s highest-transaction-volume Web sites, the authors provide detailed models and best-practice approaches available in no other book. Unlike previous books on scalability, \"The Art of Scalability\" doesn t limit its coverage to technology. Writing for both technical and nontechnical decision-makers, this book covers everything that impacts scalability, including architecture, processes, people, and organizations. Throughout, the authors address a broad spectrum of real-world challenges, from performance testing to IT governance. Using their tools and guidance, organizations can systematically overcome obstacles to scalability and achieve unprecedented levels of technical and business performance. Coverage includes Staffing the scalable organization: essential organizational, management, and leadership skills for technical leaders Building processes for scale: process lessons from hyper-growth companies, from technical issue resolution to crisis management Making better build versus buy decisions Architecting scalable solutions: powerful proprietary models for identifying scalability needs and choosing the best approaches to meet them Optimizing performance through caching, application and database splitting, and asynchronous design Scalability techniques for emerging technologies, including clouds and grids Planning for rapid data growth and new data centers Evolving monitoring strategies to tightly align with customer requirements \""]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/16457924-continuous-delivery-and-devops-a-quickstart-guide", "image": ["https://images.gr-assets.com/books/1356013607l/16457924.jpg"], "avg_ratings": ["\n  3.21\n"], "num_reviews": ["\n  ", "\n  75\n  ratings\n"], "genres": ["Computer Science", "Software", "Science", "Technology"], "title": "Continuous delivery and DevOps A Quickstart Guide", "author": "Paul Swartout", "num_pages": "154", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1849693684", "description": ["For a while now, there has been a buzz around the IT industry regarding continuous delivery and DevOps. This book will provide you with some background information into these two new kids on the block and how they can help you to optimize, streamline and improve the way you work and ultimately how you ship quality software.", "\"Continuous delivery and DevOps: A Quickstart guide\" will provide you with a clear and concise insight into what continuous delivery and DevOps are all about, how to go about preparing for and implementing them and what quantifiable business value they bring. Included within are some tricks and trips based upon real world experiences which may help you reduce the time and effort needed if you were to go it alone."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/853963.Scalable_Internet_Architectures", "image": ["https://images.gr-assets.com/books/1348617955l/853963.jpg"], "avg_ratings": ["\n  3.69\n"], "num_reviews": ["\n  ", "\n  154\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Technical", "Nonfiction"], "title": "Scalable Internet Architectures", "author": "Theo Schlossnagle", "num_pages": "262", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "067232699X", "description": ["As a developer, you are aware of the increasing concern amongst developers and site architects that websites be able to handle the vast number of visitors that flood the Internet on a daily basis. ", " addresses these concerns by teaching you both good and bad design methodologies for building new sites and how to scale existing websites to robust, high-availability websites. Primarily example-based, the book discusses major topics in web architectural design, presenting existing solutions and how they work. Technology budget tight? This book will work for you, too, as it introduces new and innovative concepts to solving traditionally expensive problems without a large technology budget. Using open source and proprietary examples, you will be engaged in best practice design methodologies for building new sites, as well as appropriately scaling both growing and shrinking sites. Website development help has arrived in the form of ", "."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/14514115-team-geek", "image": ["https://images.gr-assets.com/books/1341845671l/14514115.jpg"], "avg_ratings": ["\n  3.97\n"], "num_reviews": ["\n  ", "\n  1,012\n  ratings\n"], "genres": ["Business", "Management", "Nonfiction", "Computer Science", "Programming", "Business", "Leadership", "Science", "Technology"], "title": "Team Geek: A Software Developer's Guide to Working Well with Others", "author": "Brian W. Fitzpatrick", "num_pages": "167", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1449302440", "description": ["As a software engineer, you're great with computer languages, compilers, debuggers, and algorithms. And in a perfect world, those who produce the best code are the most successful. But in our perfectly messy world, success also depends on how you work with people to get your job done.", "In this highly entertaining book, Brian Fitzpatrick and Ben Collins-Sussman cover basic patterns and anti-patterns for working with other people, teams, and users while trying to develop software. It's valuable information from two respected software engineers whose popular video series, \"Working with Poisonous People,\" has attracted hundreds of thousands of viewers.", "You'll learn how to deal with imperfect people--those irrational and unpredictable beings--in the course of your work. And you'll discover why playing well with others is at least as important as having great technical skills. By internalizing the techniques in this book, you'll get more software written, be more influential, be happier in your career."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/1635.Execution", "image": ["https://images.gr-assets.com/books/1350857284l/1635.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  21,430\n  ratings\n"], "genres": ["Business", "Leadership", "Business", "Management", "Nonfiction", "Productivity", "Self Help", "Personal Development", "Buisness"], "title": "Execution: The Discipline of Getting Things Done", "author": "Larry Bossidy", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0609610570", "description": [" --Ralph S. Larsen, chairman and CEO, Johnson & Johnson"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/26043127-the-stream-tone", "image": ["https://images.gr-assets.com/books/1440404004l/26043127.jpg"], "avg_ratings": ["\n  3.28\n"], "num_reviews": ["\n  ", "\n  18\n  ratings\n"], "genres": ["Science", "Computer Science", "Nonfiction", "Science", "Science", "Technology"], "title": "The STREAM TONE: The Future of Personal Computing?", "author": "T. Gilling", "num_pages": "408", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1784620815", "description": ["Imagine... a world where your next personal computing device is the last one that you would ever need to buy. Where you would never need to worry about operating systems, software patches, or viruses. Where you always had enough processing power, memory, storage, and top-of-the-line graphics. Where you could access all of the very best software applications, regardless of their platform. Where you had a constant connection to all your favourite digital services, and your battery lasted for days, perhaps even weeks, of full-on use. Sounds good, doesn't it? Well, this is the world of the Stream Tone. A world that does not exist in some far off future; this could be, figuratively speaking, our world a mere five minutes from now. All that is needed to make it a reality is the creative convergence of certain technologies that are already available and in use today.", "Personal computing is changing from an old world of local services, provided by local devices, to a new world of remote Web-based services, provided by cloud computing-based data centres. The STREAM TONE: The Future of Personal Computing? is a 408-page academically-oriented non-fiction book that explores, in some technical detail, what might be required to make a comprehensive move to this exciting new world, and the many benefits that move could bring. This book not only attempts to make a thorough evaluation of the technology ecosystem that will be required to create this future but also considers many of the implications of such a move. Along the way, it also discusses a wide range of currently-available technologies and how they could possibly be used to enable this future."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/40102.Blink", "image": ["https://images.gr-assets.com/books/1440763417l/40102.jpg"], "avg_ratings": ["\n  3.91\n"], "num_reviews": ["\n  ", "\n  415,255\n  ratings\n"], "genres": ["Nonfiction", "Psychology", "Business", "Science", "Self Help"], "title": "Blink: The Power of Thinking Without Thinking", "author": "Malcolm Gladwell", "num_pages": "296", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0316010669", "description": ["Drawing on cutting-edge neuroscience and psychology and displaying all of the brilliance that made ", " a classic, ", " changes the way you'll understand every decision you make. Never again will you think about thinking the same way.", "Malcolm Gladwell redefined how we understand the world around us. Now, in Blink, he revolutionizes the way we understand the world within. Blink is a book about how we think without thinking, about choices that seem to be made in an instant - in the blink of an eye - that actually aren't as simple as they seem. Why are some people brilliant decision makers, while others are consistently inept? Why do some people follow their instincts and win, while others end up stumbling into error? How do our brains really work - in the office, in the classroom, in the kitchen, and in the bedroom? And why are the best decisions often those that are impossible to explain to others? ", "In ", " we meet the psychologist who has learned to predict whether a marriage will last, based on a few minutes of observing a couple; the tennis coach who knows when a player will double-fault before the racket even makes contact with the ball; the antiquities experts who recognize a fake at a glance. Here, too, are great failures of \"blink\": the election of Warren Harding; \"New Coke\"; and the shooting of Amadou Diallo by police. Blink reveals that great decision makers aren't those who process the most information or spend the most time deliberating, but those who have perfected the art of \"thin-slicing\" - filtering the very few factors that matter from an overwhelming number of variables."]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/27968891-site-reliability-engineering", "image": ["https://images.gr-assets.com/books/1459115220l/27968891.jpg"], "avg_ratings": ["\n  4.23\n"], "num_reviews": ["\n  ", "\n  1,069\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Programming", "Computer Science", "Technical", "Science", "Computer Science", "Nonfiction"], "title": "Site Reliability Engineering: How Google Runs Production Systems", "author": "Betsy Beyer", "num_pages": "552", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "149192912X", "description": ["The overwhelming majority of a software system's lifespan is spent in use, not in design or implementation. So, why does conventional wisdom insist that software engineers focus primarily on the design and development of large-scale computing systems?", "In this collection of essays and articles, key members of Google's Site Reliability Team explain how and why their commitment to the entire lifecycle has enabled the company to successfully build, deploy, monitor, and maintain some of the largest software systems in the world. You'll learn the principles and practices that enable Google engineers to make systems more scalable, reliable, and efficient--lessons directly applicable to your organization.", "This book is divided into four sections: Introduction--Learn what site reliability engineering is and why it differs from conventional IT industry practicesPrinciples--Examine the patterns, behaviors, and areas of concern that influence the work of a site reliability engineer (SRE)Practices--Understand the theory and practice of an SRE's day-to-day work: building and operating large distributed computing systemsManagement--Explore Google's best practices for training, communication, and meetings that your organization can use"]},
{"list": "DevOps", "url": "https://www.goodreads.com/book/show/13228655-high-performance-mysql", "image": ["https://images.gr-assets.com/books/1344720640l/13228655.jpg"], "avg_ratings": ["\n  4.40\n"], "num_reviews": ["\n  ", "\n  189\n  ratings\n"], "genres": ["Science", "Technology", "Computer Science", "Programming", "Science", "Computer Science", "Computer Science", "Technical", "Nonfiction", "Reference", "Computer Science", "Computers", "Computer Science", "Software"], "title": "High Performance MySQL: Optimization, Backups, and Replication", "author": "Baron Schwartz", "num_pages": "828", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1449314287", "description": ["How can you bring out MySQL’s full power? With ", ", you’ll learn advanced techniques for everything from designing schemas, indexes, and queries to tuning your MySQL server, operating system, and hardware to their fullest potential. This guide also teaches you safe and practical ways to scale applications through replication, load balancing, high availability, and failover.", "Updated to reflect recent advances in MySQL and InnoDB performance, features, and tools, this third edition not only offers specific examples of how MySQL works, it also teaches you ", " this system works as it does, with illustrative stories and case studies that demonstrate MySQL’s principles in action. With this book, you’ll learn ", " in MySQL.", "Learn the effects of new features in MySQL 5.5, including stored procedures, partitioned databases, triggers, and views", "Implement improvements in replication, high availability, and clustering", "Achieve high performance when running MySQL in the cloud", "Optimize advanced querying features, such as full-text searches", "Take advantage of modern multi-core CPUs and solid-state disks", "Explore backup and recovery strategies—including new tools for hot online backups"]}
]