[
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1845.Into_the_Wild", "image": ["https://images.gr-assets.com/books/1403173986l/1845.jpg"], "avg_ratings": ["\n  3.97\n"], "num_reviews": ["\n  ", "\n  762,129\n  ratings\n"], "genres": ["Nonfiction", "Biography", "Adventure", "Travel"], "title": "Into the Wild", "author": "Jon Krakauer", "num_pages": "207", "awards": ["Washington State Book Award (1997)"], "places": ["Alaska", "Mexico", "Virginia", "The Slabs, Mojave Desert, California"], "character_names": ["Christopher McCandless"], "language": "English", "ISBN": "0385486804", "description": ["In April 1992 a young man from a well-to-do family hitchhiked to Alaska and walked alone into the wilderness north of Mt. McKinley. His name was Christopher Johnson McCandless. He had given $25,000 in savings to charity, abandoned his car and most of his possessions, burned all the cash in his wallet, and invented a new life for himself. Four months later, a party of moose hunters found his decomposed body. How McCandless came to die is the unforgettable story of ", ".", "Immediately after graduating from college in 1991, McCandless had roamed through the West and Southwest on a vision quest like those made by his heroes Jack London and John Muir. In the Mojave Desert he abandoned his car, stripped it of its license plates, and burned all of his cash. He would give himself a new name, Alexander Supertramp, and, unencumbered by money and belongings, he would be free to wallow in the raw, unfiltered experiences that nature presented. Craving a blank spot on the map, McCandless simply threw away the maps. Leaving behind his desperate parents and sister, he vanished into the wild."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/22085174-the-carer", "image": ["https://images.gr-assets.com/books/1400057877l/22085174.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  82\n  ratings\n"], "genres": ["Drama"], "title": "The Carer", "author": "Scott  Nelson", "num_pages": "106", "awards": [], "places": ["London, England"], "character_names": [], "language": "English", "description": ["Sometimes, less is more...", "After mistakenly maxing out his credit card in a San Francisco clip joint, Kiwi backpacker Malcolm McDonald lands at London Heathrow homeless, friendless, unemployed – and flat broke to bat. ", "Out of options in the middle of a bitter British winter, Mal takes on a live-in job looking after Florence Days, an octogenarian who talks to her wallpaper and can’t fathom why her late husband is always late for dinner.", "Part social commentary and part gritty psychological thriller, The Carer is a dark tale of patricide by proxy, the corrosive effects of unbridled power - and of what happens when you outsource your loved ones to people who don’t love them...", "Advance reviews for The Carer", "\"A wake up call for anyone facing a dementia diagnosis - or who has elderly relatives requiring care.”", "Georgia Howley, best selling author of In the Garden and Switcher", "“With elder abuse increasingly in the news, and against a backdrop of a rapidly aging population, this book calls time on our culture’s drive to prolong life at all costs – providing the strongest argument yet for quitting while you’re still ahead.”", "James Whitehead, author of Exit Zero", "\"The Carer contributes to the current – and increasingly intense and high profile – debates about our right-to-die and how we will cover the cost of our aging population’s healthcare.\"", "Dave Rider, author of Distant Sons"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/18296619-liquid-comfort---a-surf-story", "image": ["https://images.gr-assets.com/books/1376280599l/18296619.jpg"], "avg_ratings": ["\n  4.00\n"], "num_reviews": ["\n  ", "\n  62\n  ratings\n"], "genres": ["Young Adult", "Fiction", "Sports and Games", "Sports"], "title": "Liquid Comfort - A Surf Story", "author": "Cheryl Lee Petro", "num_pages": "420", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "146621631X", "description": ["Sometimes the ocean hands you an unexpected wave.", "Travis Kelly wants nothing more than to win the world surfing championship and show up his rival, Kane, but when a horrible accident leaves him disabled, he finds himself floating in a world of misery. Surfing was his life. How will he cope? By drowning his sorrows in alcohol, he runs the risk of following in his dead-beat brother’s footsteps—a path of addiction he despises, yet seems drawn toward.", "Adrift in a sea of self-destruction, Travis struggles between what makes the pain disappear, and what the surfer really wants—the ocean, the girl, and the union of his family.", "With a touch of Hawaiian culture, Liquid Comfort is a stirring tale of surf, addiction, determination and unconditional love. Hang on for a gnarly ride!", "“There are many forms of comfort. Some will drown you. Others will keep you afloat.”"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/960.Angels_Demons", "image": ["https://images.gr-assets.com/books/1527091700l/960.jpg"], "avg_ratings": ["\n  3.88\n"], "num_reviews": ["\n  ", "\n  2,332,606\n  ratings\n"], "genres": ["Fiction", "Mystery", "Thriller", "Suspense"], "title": "Angels & Demons", "author": "Dan Brown", "num_pages": "736", "awards": ["Humo's Gouden Bladwijzer (2005)"], "places": ["Rome", "Vatican City", "Italy"], "character_names": ["Vittoria Vetra", "Robert Langdon", "Leonardo Vetra", "Gunther Glick", "Maximilian Kohler", "Camerlengo Carlo Ventresca"], "language": "English", "ISBN": "1416524797", "description": ["An ancient secret brotherhood.", "A devastating new weapon of destruction.", "An unthinkable target... ", "When world-renowned Harvard symbologist Robert Langdon is summoned to a Swiss research facility to analyze a mysterious symbol -- seared into the chest of a murdered physicist -- he discovers evidence of the unimaginable: the resurgence of an ancient secret brotherhood known as the Illuminati... the most powerful underground organization ever to walk the earth. The Illuminati has surfaced from the shadows to carry out the final phase of its legendary vendetta against its most hated enemy... the Catholic Church. ", "Langdon's worst fears are confirmed on the eve of the Vatican's holy conclave, when a messenger of the Illuminati announces he has hidden an unstoppable time bomb at the very heart of Vatican City. With the countdown under way, Langdon jets to Rome to join forces with Vittoria Vetra, a beautiful and mysterious Italian scientist, to assist the Vatican in a desperate bid for survival. ", "Embarking on a frantic hunt through sealed crypts, dangerous catacombs, deserted cathedrals, and even to the heart of the most secretive vault on earth, Langdon and Vetra follow a 400-year old trail of ancient symbols that snakes across Rome toward the long-forgotten Illuminati lair... a secret location that contains the only hope for Vatican salvation. ", "An explosive international thriller, Angels & Demons careens from enlightening epiphanies to dark truths as the battle between science and religion turns to war."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/6334.Never_Let_Me_Go", "image": ["https://images.gr-assets.com/books/1353048590l/6334.jpg"], "avg_ratings": ["\n  3.81\n"], "num_reviews": ["\n  ", "\n  387,342\n  ratings\n"], "genres": ["Fiction", "Science Fiction", "Science Fiction", "Dystopia"], "title": "Never Let Me Go", "author": "Kazuo Ishiguro", "num_pages": "288", "awards": ["Man Booker Prize Nominee (2005)", "Locus Award Nominee for Best SF Novel (2006)", "Arthur C. Clarke Award Nominee (2006)", "James Tait Black Memorial Prize Nominee for Fiction (2005)", "ALA Alex Award (2006)", "National Book Critics Circle Award Nominee for Fiction (2005)", "International DUBLIN Literary Award Nominee (2007)", "Corine Internationaler Buchpreis for Belletristik (2006)"], "places": ["Hailsham"], "character_names": ["Kathy H.", "Ruth", "Tommy"], "language": "English", "ISBN": "1400078776", "description": ["From the Booker Prize-winning author of ", " and ", ", comes an unforgettable edge-of-your-seat mystery that is at once heartbreakingly tender and morally courageous about what it means to be human.", "Hailsham seems like a pleasant English boarding school, far from the influences of the city. Its students are well tended and supported, trained in art and literature, and become just the sort of people the world wants them to be. But, curiously, they are taught nothing of the outside world and are allowed little contact with it.", "Within the grounds of Hailsham, Kathy grows from schoolgirl to young woman, but it’s only when she and her friends Ruth and Tommy leave the safe grounds of the school (as they always knew they would) that they realize the full truth of what Hailsham is.", " breaks through the boundaries of the literary novel. It is a gripping mystery, a beautiful love story, and also a scathing critique of human arrogance and a moral examination of how we treat the vulnerable and different in our society. In exploring the themes of memory and the impact of the past, Ishiguro takes on the idea of a possible future to create his most moving and powerful book to date."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/7074717-the-lost-girls", "image": ["https://images.gr-assets.com/books/1348964417l/7074717.jpg"], "avg_ratings": ["\n  3.72\n"], "num_reviews": ["\n  ", "\n  7,007\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Womens Fiction", "Chick Lit", "Adventure"], "title": "The Lost Girls: Three Friends. Four Continents. One Unconventional Detour Around the World.", "author": "Jennifer Baggett", "num_pages": "542", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0061689068", "description": ["“Brave, funny, and deeply moving.” ", "— Cathy Alter, author of ", "“Three cheers to ", " for showing us, with good humor and graceful prose, the beauty and importance of leading life astray.” ", "— Franz Wisner, ", " Bestselling author of ", "Three friends, each on the brink of a quarter-life crisis, make a pact to quit their high pressure New York City media jobs and leave behind their friends, boyfriends, and everything familiar to embark on a year-long backpacking adventure around the world in ", "."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/3858.Holy_Cow", "image": ["https://images.gr-assets.com/books/1388290849l/3858.jpg"], "avg_ratings": ["\n  3.53\n"], "num_reviews": ["\n  ", "\n  15,458\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Cultural", "India", "Autobiography", "Memoir", "Biography"], "title": "Holy Cow: An Indian Adventure", "author": "Sarah Macdonald", "num_pages": "304", "awards": [], "places": ["India"], "character_names": [], "language": "English", "ISBN": "0767915747", "description": ["In her twenties, journalist Sarah Macdonald backpacked around India and came away with a lasting impression of heat, pollution and poverty. So when an airport beggar read her palm and told her she would return to India—and for love—she screamed, “Never!” and gave the country, and him, the finger.", "But eleven years later, the prophecy comes true. When the love of Sarah’s life is posted to India, she quits her dream job to move to the most polluted city on earth, New Delhi. For Sarah this seems like the ultimate sacrifice for love, and it almost kills her, literally. Just settled, she falls dangerously ill with double pneumonia, an experience that compels her to face some serious questions about her own fragile mortality and inner spiritual void. “I must find peace in the only place possible in India,” she concludes. “Within.” Thus begins her journey of discovery through India in search of the meaning of life and death.", " is Macdonald’s often hilarious chronicle of her adventures in a land of chaos and contradiction, of encounters with Hinduism, Islam and Jainism, Sufis, Sikhs, Parsis and Christians and a kaleidoscope of yogis, swamis and Bollywood stars. From spiritual retreats and crumbling nirvanas to war zones and New Delhi nightclubs, it is a journey that only a woman on a mission to save her soul, her love life—and her sanity—can survive."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/4447653-china", "image": ["https://images.gr-assets.com/books/1330815622l/4447653.jpg"], "avg_ratings": ["\n  4.31\n"], "num_reviews": ["\n  ", "\n  146\n  ratings\n"], "genres": ["Cultural", "China", "Travel", "Nonfiction", "Art", "Photography", "History"], "title": "China: Portrait of a People", "author": "Tom  Carter", "num_pages": "637", "awards": [], "places": ["China", "Beijing", "Shanghai", "Tibet", "Hong Kong"], "character_names": [], "language": "English", "ISBN": "9889979942", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/78895.Tracks", "image": ["https://images.gr-assets.com/books/1391414939l/78895.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  10,059\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Cultural", "Australia", "Adventure", "Biography"], "title": "Tracks: A Woman's Solo Trek Across 1700 Miles of Australian Outback", "author": "Robyn Davidson", "num_pages": "288", "awards": ["Thomas Cook Travel Book Award (1980)"], "places": ["Australia"], "character_names": [], "language": "English", "ISBN": "0679762876", "description": ["Robyn Davidson's opens the memoir of her perilous journey across 1,700 miles of hostile Australian desert to the sea with only four camels and a dog for company with the following words: “I experienced that sinking feeling you get when you know you have conned yourself into doing something difficult and there's no going back.\" ", "Enduring sweltering heat, fending off poisonous snakes and lecherous men, chasing her camels when they get skittish and nursing them when they are injured, Davidson emerges as an extraordinarily courageous heroine driven by a love of Australia's landscape, an empathy for its indigenous people, and a willingness to cast away the trappings of her former identity. ", " is the compelling, candid story of her odyssey of discovery and transformation. ", "“An unforgettably powerful book.”—Cheryl Strayed, author of ", "Now with a new postscript by Robyn Davidson."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/22874450-the-sorrows-of-young-mike", "image": ["https://images.gr-assets.com/books/1407218127l/22874450.jpg"], "avg_ratings": ["\n  3.70\n"], "num_reviews": ["\n  ", "\n  57\n  ratings\n"], "genres": ["Fiction", "Novels", "Literature", "Contemporary"], "title": "The Sorrows of Young Mike", "author": "John Zelazny", "num_pages": "211", "awards": [], "places": ["College"], "character_names": [], "language": "English", "ISBN": "0990405206", "description": ["“‘The Sorrows of Young Mike’ is a deeply human story that explores one man’s struggle to find balance between his intellect and his libido, his compassion and his selfishness.”", "\t-The Aspen Daily News", "Thoughtful yet spontaneous, self-aggrandizing and hopelessly philosophical, Mike would like to find out if the earth really is round. During his four-month voyage around the planet, Mike’s past loves, current romances and vision of himself are on a collision course. His mind becomes increasingly abstract as he navigates the continents and struggles with morality in a dream world of his own making, a universe where spring break happens weekly at a dart’s throw on a world map.", "Mike’s story is told through his journal which is interlaced with various documents — essays, instant message conversations and an email. These documents tell a story that parodies Goethe, in both his behavior as a writer and his apparent views on love, nature and the world. These views were described in Goethe's seventeenth-century novel, ", "."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/17344493-watershed", "image": ["https://images.gr-assets.com/books/1398387593l/17344493.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  55\n  ratings\n"], "genres": ["Romance", "Contemporary", "New Adult", "Travel"], "title": "Watershed", "author": "C.D.  Brennan", "num_pages": "126", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["She left home to find herself...and found love along the way.", "Maggie isn’t looking for love on her backpacking trip through Australia. She’s got enough man troubles back in Ireland. Australia is her escape, a place of adventure where she can create memories to last a lifetime.", "But some memories won’t be left behind.", "Gray is ready to quit hiring backpackers to help with the work on his remote Queensland cattle station when Maggie turns up. She’s just passing through, but the connection they forge during the long nights herding cattle won’t be so easily cast aside.", "CONTENT WARNING: A strong-willed Irish heroine, a stubborn Australian hero, and oceans of difference to bridge for love.", "A Lyrical Press Contemporary Romance", "Buy links", "Amazon", "B&N", "iTunes", "Lyrical Press", "Kobo"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/4757303-undress-me-in-the-temple-of-heaven", "image": ["https://images.gr-assets.com/books/1344264501l/4757303.jpg"], "avg_ratings": ["\n  3.79\n"], "num_reviews": ["\n  ", "\n  7,402\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Cultural", "China"], "title": "Undress Me in the Temple of Heaven", "author": "Susan Jane Gilman", "num_pages": "306", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0446578924", "description": ["They were young, brilliant, and bold. They set out to conquer the world. But the world had other plans for them.", "Bestselling author Susan Jane Gilman's new memoir is a hilarious and harrowing journey, a modern heart of darkness filled with Communist operatives, backpackers, and pancakes. ", "In 1986, fresh out of college, Gilman and her friend Claire yearned to do something daring and original that did not involve getting a job. Inspired by a place mat at the International House of Pancakes, they decided to embark on an ambitious trip around the globe, starting in the People's Republic of China. At that point, China had been open to independent travelers for roughly ten minutes.", "Armed only with the collected works of Nietzsche, an astrological love guide, and an arsenal of bravado, the two friends plunged into the dusty streets of Shanghai. Unsurprisingly, they quickly found themselves in over their heads. As they ventured off the map deep into Chinese territory, they were stripped of everything familiar and forced to confront their limitations amid culture shock and government surveillance. What began as a journey full of humor, eroticism, and enlightenment grew increasingly sinister-becoming a real-life international thriller that transformed them forever.", " is a flat-out page-turner, an astonishing true story of hubris and redemption told with Gilman's trademark compassion, lyricism, and wit."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/18308768-somewhere-upriver", "image": ["https://images.gr-assets.com/books/1376281533l/18308768.jpg"], "avg_ratings": ["\n  4.20\n"], "num_reviews": ["\n  ", "\n  56\n  ratings\n"], "genres": ["Fiction", "Humor"], "title": "Somewhere Upriver", "author": "Patrick Loafman", "num_pages": "300", "awards": [], "places": ["Washington (the state)"], "character_names": [], "language": "English", "ISBN": "1492163333", "description": ["Can a grown man be toppled with a straw and a newt? ", "Has evolution made humans into big babies? ", "Is salamander spit the newest weapon of mass destruction?", "The answers lie \"Somewhere Upriver.\"", "Douglas Mortimer, just beginning graduate school, is on his way to fulfilling his lifelong dream – becoming a great scientist. But when he hires an eccentric old herpetologist as a research assistant, his plans for a successful future are de-railed. Douglas enters a world of toxic salamanders, quirky characters and government conspiracies, where the becomes believable."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1656001.The_Host", "image": ["https://images.gr-assets.com/books/1318009171l/1656001.jpg"], "avg_ratings": ["\n  3.84\n"], "num_reviews": ["\n  ", "\n  817,191\n  ratings\n"], "genres": ["Young Adult", "Science Fiction", "Fantasy", "Romance", "Fiction"], "title": "The Host", "author": "Stephenie Meyer", "num_pages": "620", "awards": [], "places": ["Arizona"], "character_names": ["Melanie Stryder", "Ian O'Shea", "Wanderer", "Jamie Stryder", "Jebediah Stryder", "Kyle O'Shea", "Jared Howe"], "language": "English", "ISBN": "0316068047", "description": ["Melanie Stryder refuses to fade away. The earth has been invaded by a species that take over the minds of human hosts while leaving their bodies intact. Wanderer, the invading \"soul\" who has been given Melanie's body, didn't expect to find its former tenant refusing to relinquish possession of her mind.", "As Melanie fills Wanderer's thoughts with visions of Jared, a human who still lives in hiding, Wanderer begins to yearn for a man she's never met. Reluctant allies, Wanderer and Melanie set off to search for the man they both love.", " ", " - "]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/3.Harry_Potter_and_the_Sorcerer_s_Stone", "image": ["https://images.gr-assets.com/books/1474154022l/3.jpg"], "avg_ratings": ["\n  4.46\n"], "num_reviews": ["\n  ", "\n  5,732,796\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction"], "title": "Harry Potter and the Sorcerer's Stone", "author": "J.K. Rowling", "num_pages": "320", "awards": ["Mythopoeic Fantasy Award for Children's Literature (2008)", "British Book Award for Children's Book of the Year (1998)", "Prijs van de Nederlandse Kinderjury for 6-9 jaar en 10-12 jaar (2002)", "American Booksellers Book Of The Year  Award for Children (1999)", "West Australian Young Readers' Book Award (WAYRBA) for Younger Readers (2000)", "South Carolina Book Award for Junior Book Award (2001)", "Grand Canyon Reader Award for Teen Book (2000)", "Charlotte Award (2000)", "Nene Award (2000)", "Massachusetts Children's Book Award (2000)", "Colorado Blue Spruce Young Adult Book Award (2001)", "Blue Hen Book Award for Chapter Book (2001)", "Nevada Young Readers' Award for Young Reader Category (2000)", "Golden Archer Award for Middle/Junior High (2000)", "Indian Paintbrush Book Award (2000)", "Hotze de Roosprijs (2002)", "Nestlé Smarties Book Prize for 9–11 years (1997)", "Kinderboekwinkelprijs (1999)", "Parenting Book of the Year Award (1998)", "North East Teenage Book Award (1999)", "Specsavers National Book Award for Children's Book of the Year (1998)", "Washington State Sasquatch Award (2000)", "Literaturpreis der Jury der jungen Leser for Kinderbuch (1999)", "Carnegie Medal Nominee (1997)", "Rebecca Caudill Young Readers' Book Award (2001)"], "places": ["London, England", "Hogwarts School of Witchcraft and Wizardry", "Hogwarts School of Witchcraft and Wizardry"], "character_names": ["Draco Malfoy", "Ron Weasley", "Petunia Dursley", "Vernon Dursley", "Dudley Dursley", "Albus Dumbledore", "Severus Snape", "Quirinus Quirrell", "Rubeus Hagrid", "Lord Voldemort", "Minerva McGonagall", "Neville Longbottom", "Fred Weasley", "George Weasley", "Percy Weasley", "Filius Flitwick", "Pomona Sprout", "Molly Weasley", "Poppy Pomfrey", "Oliver Wood", "Parvati Patil", "Lavender Brown", "Dean Thomas", "James Potter", "Lily Potter", "Seamus Finnigan", "Garrick Ollivander", "Rolanda Hooch", "Katie Bell", "Dedalus Diggle", "Harry Potter", "Hermione Granger"], "language": "English", "ISBN": "0439554934", "description": ["Harry Potter's life is miserable. His parents are dead and he's stuck with his heartless relatives, who force him to live in a tiny closet under the stairs. But his fortune changes when he receives a letter that tells him the truth about himself: he's a wizard. A mysterious visitor rescues him from his relatives and takes him to his new home, Hogwarts School of Witchcraft and Wizardry.", "After a lifetime of bottling up his magical powers, Harry finally feels like a normal kid. But even within the Wizarding community, he is special. He is the boy who lived: the only person to have ever survived a killing curse inflicted by the evil Lord Voldemort, who launched a brutal takeover of the Wizarding world, only to vanish after failing to kill Harry.", "Though Harry's first year at Hogwarts is the best of his life, not everything is perfect. There is a dangerous secret object hidden within the castle walls, and Harry believes it's his responsibility to prevent it from falling into evil hands. But doing so will bring him into contact with forces more terrifying than he ever could have imagined.", "Full of sympathetic characters, wildly imaginative situations, and countless exciting details, the first installment in the series assembles an unforgettable magical world and sets the stage for many high-stakes adventures to come."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/15754791-13-years-in-america", "image": ["https://images.gr-assets.com/books/1342453561l/15754791.jpg"], "avg_ratings": ["\n  3.97\n"], "num_reviews": ["\n  ", "\n  136\n  ratings\n"], "genres": ["Travel", "Autobiography", "Memoir", "Nonfiction"], "title": "13 Years in America", "author": "Melanie Steele", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1475215665", "description": ["13 Years in America is a story of hope, sacrifice, and the modern search for happiness that is at once a moving personal journey and a sharp, hard look at the American Dream. ", "After moving to the United States from Canada, a free-spirited young woman rejects the status quo and embarks on a journey to discover what it means to be truly happy and fulfilled in the Land of Opportunity. ", "Her 13-year search spans half a dozen states, a bunch of fearless adventures, and ever-increasing crises, divisions, turmoil, and discontent. Through it all, she holds on to her fearless pursuit of happiness and fulfillment against ever-decreasing odds.", "Read free ebook by clicking \"read book\" or purchase a paperback copy to support the author."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/6288.The_Road", "image": ["https://images.gr-assets.com/books/1439197219l/6288.jpg"], "avg_ratings": ["\n  3.96\n"], "num_reviews": ["\n  ", "\n  622,931\n  ratings\n"], "genres": ["Fiction", "Science Fiction", "Science Fiction", "Dystopia", "Apocalyptic", "Post Apocalyptic"], "title": "The Road", "author": "Cormac McCarthy", "num_pages": "241", "awards": ["Pulitzer Prize for Fiction (2007)", "Locus Award Nominee for Best SF Novel (2007)", "James Tait Black Memorial Prize for Fiction (2006)", "The Quill Award for General Fiction (2007)", "Puddly Award for Fiction (2010)", "National Book Critics Circle Award Nominee for Fiction (2006)", "Believer Book Award (2006)", "The Rooster - The Morning News Tournament of Books (2007)", "Tähtivaeltaja Award (2009)", "Cena Akademie SFFH for Kniha roku (Book of the Year) (2008)", "Prix des libraires du Québec for Lauréats hors Québec (2009)", "International DUBLIN Literary Award Nominee (2008)"], "places": ["United States of America"], "character_names": ["The man", "The boy"], "language": "English", "ISBN": "0307265439", "description": ["A searing, post apocalyptic novel destined to become Cormac McCarthy’s masterpiece.", "A father and his son walk alone through burned America. Nothing moves in the ravaged landscape save the ash on the wind. It is cold enough to crack stones, and when the snow falls it is gray. The sky is dark. Their destination is the coast, although they don’t know what, if anything, awaits them there. They have nothing; just a pistol to defend themselves against the lawless bands that stalk the road, the clothes they are wearing, a cart of scavenged food—and each other."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1666903.As_Far_as_the_Eye_Can_See", "image": ["https://images.gr-assets.com/books/1186588061l/1666903.jpg"], "avg_ratings": ["\n  4.04\n"], "num_reviews": ["\n  ", "\n  337\n  ratings\n"], "genres": ["Nonfiction", "Travel", "Adventure", "Nature", "Outdoors", "Autobiography", "Memoir", "Environment", "Nature"], "title": "As Far as the Eye Can See: Reflections of an Appalachian Trail Hiker", "author": "David Brill", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1889386448", "description": ["Many an armchair hiker has dreamed of traversing the Appalachian Trail in its entirety. In 1979, David Brill became one of the first of a new generation to complete the Georgia-to-Maine hike. As Far as the Eye Can See chronicles his six-month, 2,100-mile walk, a quest to grow, to breathe, to change, to discover what really mattered to him. This book is for anyone interested in getting beyond the day-to-day slog of the hike to explore the emotional and spiritual dimensions of a long journey on foot."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/9460487-miss-peregrine-s-home-for-peculiar-children", "image": ["https://images.gr-assets.com/books/1546430481l/9460487.jpg"], "avg_ratings": ["\n  3.91\n"], "num_reviews": ["\n  ", "\n  822,452\n  ratings\n"], "genres": ["Fantasy", "Young Adult", "Fiction", "Fantasy", "Paranormal"], "title": "Miss Peregrine's Home for Peculiar Children", "author": "Ransom Riggs", "num_pages": "352", "awards": ["Grand Prix de l'Imaginaire for Roman jeunesse étranger (2015)", "Pennsylvania Young Readers' Choice Award for Young Adults (2014)", "California Young Readers Medal Nominee for Young Adult (2016)", "The Kitschies Nominee for Golden Tentacle (Debut) (2011)"], "places": ["Englewood, Florida", "Wales"], "character_names": ["Olive Abroholos Elephanta", "Fiona Waters", "Horace Somnusson", "Millard Nullings", "Jacob Portman", "Emma Bloom", "Alma Lefay Peregrine", "Abraham Portman", "Bronwyn Bruntley", "Enoch O'Connor", "Ferdinand Portman", "Hugh Apiston", "Claire Densmore", "Miss Avocet"], "language": "English", "description": ["A mysterious island. An abandoned orphanage. A strange collection of very curious photographs. It all waits to be discovered in Miss Peregrine's Home for Peculiar Children, an unforgettable novel that mixes fiction and photography in a thrilling reading experience. As our story opens, a horrific family tragedy sets sixteen-year-old Jacob journeying to a remote island off the coast of Wales, where he discovers the crumbling ruins of Miss Peregrine's Home for Peculiar Children. As Jacob explores its abandoned bedrooms and hallways, it becomes clear that the children were more than just peculiar. They may have been dangerous. They may have been quarantined on a deserted island for good reason. And somehow-impossible though it seems-they may still be alive. A spine-tingling fantasy illustrated with haunting vintage photography, Miss Peregrine's Home for Peculiar Children will delight adults, teens, and anyone who relishes an adventure in the shadows."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1535592.The_Gringo_Trail", "image": ["https://images.gr-assets.com/books/1184868827l/1535592.jpg"], "avg_ratings": ["\n  3.47\n"], "num_reviews": ["\n  ", "\n  680\n  ratings\n"], "genres": ["Travel", "Nonfiction"], "title": "The Gringo Trail", "author": "Mark Mann", "num_pages": "280", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1931160104", "description": ["With little more than backpacks and desire for adventure, Mark Mann and two friends set out on an expedition through Ecuador, Bolivia, and Colombia, submerging themselves in Latin culture. Through dense forests, daunting mountains, and pristine beaches, the trio makes its way — in a drug-induced haze. Soon the drugs become an all-consuming addiction that changes the lives of Mann and his friends forever. This is an engaging travelogue and frank memoir evokes the magical realism of South American literature. “Darkly comic, ultimately shocking, and packed with astute observations.” — Geographical"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/16058685-angels-and-arrows", "image": ["https://images.gr-assets.com/books/1349109174l/16058685.jpg"], "avg_ratings": ["\n  4.37\n"], "num_reviews": ["\n  ", "\n  27\n  ratings\n"], "genres": ["Fantasy"], "title": "Angels and Arrows", "author": "Reyna Hawk", "num_pages": "368", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1479385247", "description": ["Maria Ridge was born a special child having gifts that allowed her to see and speak into the spirit world. As Maria aged she found these gifts to be more of a curse than a blessing. At the age of 17 Maria escaped the taunting of her family and set out on a journey that led her to discover others like herself. Ultimately this journey forces Maria to confront her past and the evil attached to her. With the help of her new friend, Allie, Maria feels she has finally found her place in this world. The destined meeting of Ash awakens the two girls to the fine line between this world and the next. Can Maria survive the haunting evil that threatens her very existence? Is she strong enough to face the past that lurks in the shadows? Will Maria embrace the truth or run from it? ", "This book is based on true paranormal events. ", "June of 2013 this book was revised and an additional 12000 words was added. The narrative was also changed to first person. ", "Available in paperback and eBook"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/17342312-revealing-visions", "image": ["https://images.gr-assets.com/books/1362813778l/17342312.jpg"], "avg_ratings": ["\n  3.46\n"], "num_reviews": ["\n  ", "\n  26\n  ratings\n"], "genres": ["Thriller", "Mystery Thriller"], "title": "Revealing Visions (Valentine/Petrilo #4)", "author": "Reyna Hawk", "num_pages": "185", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["From the beginning Janie's life was in turmoil; brought up in a home with abuse and lies. ", "Daniel always did what he felt was in the best interest of his sister, Janie.", "Rico's love for Janie was never ending; from the first moment he laid eyes on the woman she had become. ", "Malachi was no stranger to heart break. Janie's arrival brought him hope for the future and a hurt he wouldn't soon forget.", "This is the back story to the Valentine/Petrilo Series characters. See where they came from and what was going on \"behind the scenes\". ", "This novella will tell all the dirty little secrets that have been left untold... until now."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/3398625-the-lost-city-of-z", "image": ["https://images.gr-assets.com/books/1320487318l/3398625.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  61,969\n  ratings\n"], "genres": ["Nonfiction", "History", "Adventure", "Travel", "Biography"], "title": "The Lost City of Z: A Tale of Deadly Obsession in the Amazon", "author": "David Grann", "num_pages": "352", "awards": ["Indies Choice Book Award for Adult Nonfiction (2010)", "Samuel Johnson Prize for Non-Fiction Nominee (2009)", "Goodreads Choice Award Nominee for Nonfiction (2009)"], "places": ["Brazil", "Trincomalee"], "character_names": [], "language": "English", "ISBN": "0385513534", "description": ["A grand mystery reaching back centuries. A sensational disappearance that made headlines around the world. A quest for truth that leads to death, madness or disappearance for those who seek to solve it. ", " is a blockbuster adventure narrative about what lies beneath the impenetrable jungle canopy of the Amazon.", "After stumbling upon a hidden trove of diaries, New Yorker writer David Grann set out to solve \"the greatest exploration mystery of the 20th century\": What happened to the British explorer Percy Fawcett & his quest for the Lost City of Z?", "In 1925, Fawcett ventured into the Amazon to find an ancient civilization, hoping to make one of the most important discoveries in history. For centuries Europeans believed the world's largest jungle concealed the glittering kingdom of El Dorado. Thousands had died looking for it, leaving many scientists convinced that the Amazon was truly inimical to humans. But Fawcett, whose daring expeditions inspired Conan Doyle's ", ", had spent years building his scientific case. Captivating the imagination of millions round the globe, Fawcett embarked with his 21-year-old son, determined to prove that this ancient civilisation--which he dubbed Z--existed. Then his expedition vanished. Fawcett's fate, & the tantalizing clues he left behind about Z, became an obsession for hundreds who followed him into the uncharted wilderness. ", "For decades scientists & adventurers have searched for evidence of Fawcett's party & the lost City of Z. Countless have perished, been captured by tribes or gone mad. As Grann delved ever deeper into the mystery surrounding Fawcett's quest, & the greater mystery of what lies within the Amazon, he found himself, like the generations who preceded him, being irresistibly drawn into the jungle's green hell. His quest for the truth & discoveries about Fawcett's fate & Z form the heart of this complexly enthralling narrative."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1777804.Planetwalker", "image": ["https://images.gr-assets.com/books/1320442404l/1777804.jpg"], "avg_ratings": ["\n  3.78\n"], "num_reviews": ["\n  ", "\n  682\n  ratings\n"], "genres": ["Nonfiction", "Travel", "Autobiography", "Memoir", "Environment", "Biography", "Philosophy"], "title": "Planetwalker: 22 Years of Walking. 17 Years of Silence.", "author": "John Francis", "num_pages": "288", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "ISBN": "142620275X", "description": ["When the struggle to save oil-soaked birds and restore blackened beaches left him feeling frustrated and helpless, John Francis decided to take a more fundamental and personal stand--he stopped using all forms of motorized transportation. Soon after embarking on this quest that would span two decades and two continents, the young man took a vow of silence that endured for 17 years. It began as a silent environmental protest, but as a young African-American man, walking across the country in the early 1970s, his idea of \"the environment\" expanded beyond concern about pollution and loss of habitat to include how we humans treat each other and how we can better communicate and work together to benefit the earth.", "Through his silence and walking, he learned to listen, and along the way, earned college and graduate degrees in science and environmental studies. The United Nations appointed him goodwill ambassador to the world's grassroots communities and the U.S. government recruited him to help address the Exxon Valdez disaster.", "Was he crazy? How did he live and earn all those degrees without talking? An amazing human-interest story, with a vital message, ", " is also a deeply personal and engaging coming-of-age odyssey--the positive experiences, the challenging times, the characters encountered, and the learning gained along the way."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/36194849-the-road-less-travelled", "image": ["https://images.gr-assets.com/books/1508108897l/36194849.jpg"], "avg_ratings": ["\n  4.46\n"], "num_reviews": ["\n  ", "\n  13\n  ratings\n"], "genres": [], "title": "The Road Less Travelled", "author": "Elise K. Ackers", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Dana Ryan is a nomad. Her address is the world and the world has been good to her, but a short-notice invitation to her kid sister’s wedding suddenly shifts this very world on its axis. ", "Chelsea Ryan is eighteen. Fresh out of high school and still living in the same tiny town Dana fled three years ago, she’s been nowhere and done little. She doesn’t know what the world has to offer, and she intends to marry her first and only boyfriend. Enter Dana: the voice of reason and experience.", "But their reunion is fraught with secrets and surprises. Dana’s parents are welcoming but distant, the groom-to-be is no longer the boy Dana remembers, and the best man is the boy she almost gave up the world for but left behind.", "It turns out life back home has gone on without her - infinitely more complex than she could have imagined - and as the wedding approaches, Dana realises her nomad ways have cost her a lot more than just foreign currency."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/36486213-one-for-the-road", "image": ["https://images.gr-assets.com/books/1509365741l/36486213.jpg"], "avg_ratings": ["\n  4.71\n"], "num_reviews": ["\n  ", "\n  14\n  ratings\n"], "genres": ["Travel"], "title": "One for the Road", "author": "Elise K. Ackers", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Adaline Sharp has crossed the world to be anonymous. She's put thousands of kilometres between herself and those who need her, and joined forty-seven others on a group tour through Europe. Freedom is bliss. Acting her age is a novelty and the world away from home is wonderful. But her low profile is not to last.", "Intrigued by the wide-eyed girl who can't seem to get enough of the world, fellow tour mate Rory Frost adjusts his priorities. He's going to see everything, but he's going to see it with her.", "Except Adaline didn't come here to make friends - friends equal obligations and expectations, and Adaline's learned that to need someone is to bind them. Rory must show Adaline that the right relationships can empower her if he is to have any hope of seeing her again after the international departure terminal."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/131107.Video_Night_in_Kathmandu_and_Other_Reports_from_the_Not_So_Far_East", "image": ["https://images.gr-assets.com/books/1320403832l/131107.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  2,647\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Cultural", "Asia", "Writing", "Essays"], "title": "Video Night in Kathmandu and Other Reports from the Not-So-Far East", "author": "Pico Iyer", "num_pages": "400", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0679722165", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/6131779-boardfree", "image": ["https://images.gr-assets.com/books/1328693607l/6131779.jpg"], "avg_ratings": ["\n  3.84\n"], "num_reviews": ["\n  ", "\n  19\n  ratings\n"], "genres": [], "title": "BoardFree: The Story of an Incredible Skateboard Journey Across Australia", "author": "Dave Cornthwaite", "num_pages": "288", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "190603219X", "description": ["As featured in the ", ", this is the thrilling, inspiring story of Dave Cornthwaite's epic journey down under with a most unusual form of transport. Tired of the nine-to-five, Dave decided one day that he needed a change—a big change. He jumped on his Rollsrolls longboard (the Land Rover of skateboards) and broke a world record, skating the length of Great Britain. Not content with such glories, he decided to up the ante. During the second half of 2006, he skated from Perth to Brisbane, a distance of 4,500 miles, raising money for three childrens' charities in the process and earning an adventurous reputation. This is the story of Dave's motivation, his stamina, and his enduring good spirit in the face of a challenge."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/12038734-the-shores-we-walk", "image": ["https://images.gr-assets.com/books/1348168443l/12038734.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  59\n  ratings\n"], "genres": ["Fiction"], "title": "The Shores We Walk", "author": "Gabriel Rheaume", "num_pages": "156", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "145644431X", "description": ["A sumptuous banquet of life. - Author, Robynn GabelThe author has an eye for beauty, even in the midst of death and garbage... it hints of hope, it hints of sunshine, it is inspiring - Dawn Graves, Outsider WritersThe truth about heroin.In The Shores We Walk, Francis, based on a postmodern St. Francis of Assisi, tells the story of four young people as they slowly self-destruct while battling addiction, homelessness, and poverty. He and his friends tell the story before and after their demise. When Francis' girlfriend commits suicide, he starts to drink heavily and use heroin instead of grieving, falling into psychosis. Francis leads a double life as a working student during the day and a sordid junkie by night. It doesn't take long until he can no longer keep these lifestyles apart. It is written through a veil of drugs and visits from beyond the grave. The reader experiences the effects of hallucinations, desperation, and dope sickness with the comfort of being able to walk away from it in the end.It is a love story, a tragedy, a struggle of faith, with brief moments of hope. The shore is a metaphor for eternity and the walk is the exploration of the human condition, using the word we is to say that we all share the same human struggle. It is a fast-paced story written in surreal prose from multiple points of view in a non-linear fashion. Will Francis find any closure and defeat his demons, or will he too find himself in the same position as his loved ones, dead?"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/16008816-shattered-visions-haunted-memories", "image": ["https://images.gr-assets.com/books/1362813728l/16008816.jpg"], "avg_ratings": ["\n  4.67\n"], "num_reviews": ["\n  ", "\n  27\n  ratings\n"], "genres": ["Thriller", "Mystery Thriller", "Horror", "Romance", "Romantic Suspense"], "title": "Shattered Visions Haunted Memories (Valentine/Petrilo #3)", "author": "Reyna Hawk", "num_pages": "410", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1479316555", "description": ["Just when Janie thought she had all she ever dreamt, the powers that be would suddenly change her course; throwing Janie head long into a world of uncertainty and casting a puzzling shadow on all this life she’d grown to love. Janie would soon discover nothing in her world was what it appeared. Leaving her confused, broken, and determined to find the answers in a new but familiar realm filled with secrets and deception. Memories and turbulence lead Janie on her quest to discover the truth concerning herself, her past, the Petrilo crime family, and her brother’s murder. ", "Is Rico's unfinished business in Cherokee to finish the hit the Petrilos put on her? Is Malachi willing to take a bullet for his new love; or will he walk away from the danger and free himself of the drama Janie has brought to his once peaceful life? Love and deceit will lead them all to the truth. ", "Shattered Visions Haunted Memories is the third book of the Valentine/Petrilo series. Book one is Looking Through Blind Eyes; book two is Reflection of Secrets."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/112295.Young_Female_Traveling_Alone", "image": ["https://images.gr-assets.com/books/1347291889l/112295.jpg"], "avg_ratings": ["\n  2.75\n"], "num_reviews": ["\n  ", "\n  8\n  ratings\n"], "genres": ["Travel"], "title": "Young Female, Traveling Alone", "author": "Anne-Marie M. Pop", "num_pages": "160", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0595360246", "description": ["\"Young Female, Traveling Alone\" tells the story of a successful western female in her late twenties, who is on the verge of serious depression and leaves her comfort zone behind, embarking on a backpacking journey throughout Southeast Asia and India. On her journey, Anna discovers herself in different towns, beaches and mountains. She experiments with spirituality, drugs and rave parties. Following the loss of a close friend and the failure of a romantic relationship, in the underground rave scene of Goa, Anna roams around aloof, from one Indian town to another. Ultimately, she discovers that conversations with the locals bring insight to the search for her own identity in the world.", "In the end, she learns that life is a long hard lesson, but a great gift worth living, despite the bumps along the way."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/9850443-the-sisters-brothers", "image": ["https://images.gr-assets.com/books/1291999900l/9850443.jpg"], "avg_ratings": ["\n  3.84\n"], "num_reviews": ["\n  ", "\n  69,112\n  ratings\n"], "genres": ["Fiction", "Westerns", "Historical", "Historical Fiction", "Historical", "Cultural", "Canada"], "title": "The Sisters Brothers", "author": "Patrick deWitt", "num_pages": "328", "awards": ["Man Booker Prize Nominee (2011)", "Oregon Book Award for Fiction (2012)", "Stephen Leacock Memorial Medal (2012)", "Scotiabank Giller Prize Nominee (2011)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général for Fiction (2011)", "Canadian Booksellers Association Libris Award for Fiction Book (2012)", "The Rooster - The Morning News Tournament of Books (2012)", "Canadian Authors Association Award for Fiction (2012)", "Prix des libraires du Québec for Lauréats hors Québec (2013)", "Rogers Writers' Trust Fiction Prize (2011)", "Andrew Carnegie Medal Nominee for Fiction (2012)", "Walter Scott Prize Nominee (2012)"], "places": ["Oregon", "California"], "character_names": ["Eli Sisters", "Charlie Sisters", "Hermann Kermit Warm"], "language": "English", "ISBN": "0062041266", "description": ["Hermann Kermit Warm is going to die. The enigmatic and powerful man known only as the Commodore has ordered it, and his henchmen, Eli and Charlie Sisters, will make sure of it. Though Eli doesn't share his brother's appetite for whiskey and killing, he's never known anything else. But their prey isn't an easy mark, and on the road from Oregon City to Warm's gold-mining claim outside Sacramento, Eli begins to question what he does for a living - and whom he does it for.", "With ", ", Patrick deWitt pays homage to the classic Western, transforming it into an unforgettable comic tour de force. Filled with a remarkable cast of characters - losers, cheaters, and ne'er-do-wells from all stripes of life - and told by a complex and compelling narrator, it is a violent, lustful odyssey through the underworld of the 1850s frontier that beautifully captures the humor, melancholy, and grit of the Old West and two brothers bound by blood, violence, and love."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/7735333-matched", "image": ["https://images.gr-assets.com/books/1367706191l/7735333.jpg"], "avg_ratings": ["\n  3.67\n"], "num_reviews": ["\n  ", "\n  585,888\n  ratings\n"], "genres": ["Young Adult", "Science Fiction", "Dystopia", "Romance"], "title": "Matched", "author": "Ally Condie", "num_pages": "369", "awards": ["South Carolina Book Award for Young Adult (2013)", "Teen Buckeye Book Award (2012)", "Pennsylvania Young Readers' Choice Award for Young Adults (2012)", "Rhode Island Teen Book Award (2012)", "California Young Readers Medal for Young Adult (2013)", "Lincoln Award Nominee (2013)", "Literaturpreis der Jury der jungen Leser for Jugendbuch (2011)", "Carnegie Medal Nominee (2012)", "Missouri Gateway Readers Award Nominee (2013)"], "places": [], "character_names": ["Cassia Reyes", "Ky Markham", "Xander Carrow"], "language": "English", "ISBN": "0525423648", "description": ["In the Society, officials decide. Who you love. Where you work. When you die.", "Cassia has always trusted their choices. It’s hardly any price to pay for a long life, the perfect job, the ideal mate. So when her best friend appears on the Matching screen, Cassia knows with complete certainty that he is the one…until she sees another face flash for an instant before the screen fades to black. Now Cassia is faced with impossible choices: between Xander and Ky, between the only life she’s known and a path no one else has ever dared follow—between perfection and passion.", " is a story for right now and storytelling with the resonance of a classic."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/145249.Beyond_the_Sky_and_the_Earth", "image": ["https://images.gr-assets.com/books/1309283944l/145249.jpg"], "avg_ratings": ["\n  4.14\n"], "num_reviews": ["\n  ", "\n  3,069\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Cultural", "Asia"], "title": "Beyond the Sky and the Earth: A Journey Into Bhutan", "author": "Jamie Zeppa", "num_pages": "303", "awards": [], "places": ["Bhutan"], "character_names": [], "language": "English", "ISBN": "157322815X", "description": ["At age 24 Jamie Zeppa, a Canadian who had never been outside of North America, said goodbye to her fiancé and her plans for graduate school and moved to Bhutan, a remote Buddhist kingdom in the Himalayas. ", " is an autobiographical work that details her experiences and transformations after spending three years in Bhutan. It is as much a book about Zeppa's day-to-day life in Bhutan as it is about the personal awakenings and realizations that she had while living there. ", "Visitors to Bhutan, an increasingly hot tourist destination, are still few and far between, largely because of tight government restrictions on entry, visa requirements, and a law requiring tourists to spend at least $200 a day there. There aren't many books on Bhutan, and even fewer first-hand accounts of life there. ", " stands out as both an informative introduction to the people and culture of Bhutan and as a beautiful piece of travel literature set against the backdrop of one of the most remote and unspoiled places on earth. ", "Zeppa recounts her experiences living abroad, such as learning to live without electricity and carrying on a forbidden affair with one of her students, in such a compelling way that even someone who has never left home will become entranced by her story and captivated by her unique experiences. ", "Naturally, Zeppa experienced culture shock when she arrived in Bhutan. The hardships she encountered seemed insurmountable, and at first she thought she couldn't bear it and fantasized about returning to Canada. She had to learn a new language in order to communicate with her students, she had to learn to live on her own, and she had to learn to deal with homesickness. Perhaps her biggest challenge was learning how to reconcile her growing love for Bhutan with her nostalgia for her life in Canada, her family, and her fiancé. But after living among Bhutan's Himalayan peaks, lush valleys, colorful villages, and friendly people, and after gaining an appreciation for life in a place frozen in time, Zeppa realizes that she feels at home in Bhutan and wants to stay.", "Although to Zeppa Bhutan is a magical land, she cautions herself and the reader not to deem it \"the last Shangri-La,\" as is often done by the lucky travelers who make their way through the red tape required for entry into the kingdom. Bhutan is not without its problems: it is an underdeveloped country plagued by the problems that affect many places cut off from modernity. There is infant mortality, illness, and poverty. There are also domestic and international tensions that stem from the government's stringent regulations intended to preserve the national culture. Among them are the prohibition of foreign television and a requirement that people wear the national dress, a kira for women and a gho for men.", "Few of us will ever get to see the place that was Zeppa's home. But her narrative is so clear and insightful that you easily feel as though you are sharing this portion of her life with her. Even if you haven't had the experience of living abroad, or if the prospect of a trip to the furthest reaches of Asia is not in your cards, Zeppa's book is a worthy read on many levels. ", "From her powerful use of language to describe the superb beauty of Bhutan's landscape to her passionate description of her spellbinding relationship with her future husband, ", " draws readers in and takes them on her rocky ride to self-realization. ", "When trying to explain to a friend what she finds appealing about Bhutan, Zeppa writes: \"It takes a long time to find the true words, to put them in order, to tell the whole story. It is not just this or that, the mountains, the people, it is me and the way I can be here, the freedom to walk unafraid into the great dark night. It is a hundred thousand things and I could never trace or tell all the connections and reflections, the shadows and echoes and secret relations between them.\"", "But, in fact, Zeppa does tell the reader about these connections and reflections in a lyrical way. After reading the book, you will have a deep understanding, appreciation, and respect for Zeppa's strength of character and for the wonders of Bhutan.", " is a delight to read in every way. Zeppa's beautiful prose, peppered alternately with funny observations and profound soul-searching, is a truly special and unique work that will leave you craving an adventure of your own."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1170964.Woodswoman_I", "image": ["https://images.gr-assets.com/books/1388243126l/1170964.jpg"], "avg_ratings": ["\n  4.16\n"], "num_reviews": ["\n  ", "\n  1,767\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Environment", "Nature", "Biography", "Adventure"], "title": "Woodswoman I: Living Alone in the Adirondack Wilderness", "author": "Anne LaBastille", "num_pages": "288", "awards": [], "places": ["United States of America"], "character_names": [], "language": "English", "ISBN": "0140153349", "description": ["Many have dreamed of building a cabin in the wilderness and living there alone in the solitude of a region that is far from civilization. Here is the unusual story of a young wildlife ecologist who has done just that. When her marriage ended in divorce, Anne LaBastille bought twenty-two acres of virgin forest on a lonely lake in New York State's vast Adirondack Park, and there built the log cabin that has been her home ever since."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/8680.Fierce_Invalids_Home_from_Hot_Climates", "image": ["https://images.gr-assets.com/books/1327866336l/8680.jpg"], "avg_ratings": ["\n  4.02\n"], "num_reviews": ["\n  ", "\n  24,983\n  ratings\n"], "genres": ["Fiction", "Humor", "Novels", "Literature"], "title": "Fierce Invalids Home from Hot Climates", "author": "Tom Robbins", "num_pages": "445", "awards": ["Audie Award for Fiction, Unabridged (2001)"], "places": [], "character_names": ["Switters"], "language": "English", "ISBN": "055337933X", "description": ["Switters is a contradiction for all seasons: an anarchist who works for the government; a pacifist who carries a gun; a vegetarian who sops up ham gravy; a cyberwhiz who hates computers; a man who, though obsessed with the preservation of innocence, is aching to deflower his high-school-age stepsister (only to become equally enamored of a nun ten years his senior). Yet there is nothing remotely wishy-washy about Switters. He doesn't merely pack a pistol. He ", " a pistol. And as we dog Switters's strangely elevated heels across four continents, in and out of love and danger, discovering in the process the \"true\" Third Secret of Fatima, we experience Tom Robbins--that fearless storyteller, spiritual renegade, and verbal break dancer--at the top of his game. On one level this is a fast-paced CIA adventure story with comic overtones; on another it's a serious novel of ideas that brings the Big Picture into unexpected focus; but perhaps more than anything else, Fierce Invalids is a sexy celebration of language and life."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/319480.Eucalyptus", "image": ["https://images.gr-assets.com/books/1173733973l/319480.jpg"], "avg_ratings": ["\n  3.54\n"], "num_reviews": ["\n  ", "\n  4,306\n  ratings\n"], "genres": ["Fiction", "Cultural", "Australia", "Romance", "Contemporary", "Literature"], "title": "Eucalyptus", "author": "Murray Bail", "num_pages": "264", "awards": ["Miles Franklin Literary Award (1999)", "Australian Literature Society Gold Medal (1999)", "Commonwealth Writers' Prize for Best Book Overall (1999)", "ALS Gold Medal (1999)"], "places": ["Australia", "New South Wales"], "character_names": [], "language": "English", "ISBN": "0156007819", "description": ["The gruff widower Holland has two possessions he cherishes above all others: ", "his sprawling property of eucalyptus trees and his ravishingly beautiful daughter, Ellen. ", "When Ellen turns nineteen Holland makes an announcement: she may marry only the man who can correctly name the species of each of the hundreds of gum trees on his property. ", "Ellen is uninterested in the many suitors who arrive from around the world, until one afternoon she chances on a strange, handsome young man resting under a Coolibah tree. In the days that follow, he spins dozens of tales set in cities, deserts, and faraway countries. As the contest draws to a close, Ellen and the stranger's meetings become more erotic, the stories more urgent. Murray Bail's rich narrative is filled with unexpected wisdom about art, feminine beauty, landscape, and language.", " is a shimmering love story that affirms the beguiling power of storytelling itself."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/14059591-looking-through-blind-eyes", "image": ["https://images.gr-assets.com/books/1362813533l/14059591.jpg"], "avg_ratings": ["\n  4.00\n"], "num_reviews": ["\n  ", "\n  69\n  ratings\n"], "genres": ["Drama", "Romance", "Romantic Suspense"], "title": "Looking Through Blind Eyes (Valentine/Petrilo #1)", "author": "Reyna Hawk", "num_pages": "232", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1432793608", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/15761010-reflection-of-secrets", "image": ["https://images.gr-assets.com/books/1362813630l/15761010.jpg"], "avg_ratings": ["\n  4.38\n"], "num_reviews": ["\n  ", "\n  32\n  ratings\n"], "genres": ["Thriller", "Mystery Thriller", "Romance", "Romantic Suspense"], "title": "Reflection of Secrets (Valentine/Petrilo #2)", "author": "Reyna Hawk", "num_pages": "200", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Janie had high hopes of getting her life on the right path and freedom from the Petrilo Crime Family, but more tragedies and startling revelations send her plans right out the window. Janie's past trouble and sadness lurk back from the shadows. The beautiful life Janie has come to love takes a turn leading her right back to where she started in the clutches of the Petrilos. Will Janie survive another go around with the organized crime family?"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/41865.Twilight", "image": ["https://images.gr-assets.com/books/1361039443l/41865.jpg"], "avg_ratings": ["\n  3.58\n"], "num_reviews": ["\n  ", "\n  4,339,142\n  ratings\n"], "genres": ["Young Adult", "Fantasy", "Romance", "Paranormal", "Vampires", "Fiction", "Fantasy", "Paranormal"], "title": "Twilight", "author": "Stephenie Meyer", "num_pages": "498", "awards": ["Georgia Peach Book Award (2007)", "Buxtehuder Bulle (2006)", "Kentucky Bluegrass Award for 9-12 (2007)", "Prijs van de Kinder- en Jeugdjury Vlaanderen (2008)", "Books I Loved Best Yearly (BILBY) Awards for Older Readers (2009)", "West Australian Young Readers' Book Award (WAYRBA) for Older Readers (2008)", "Garden State Book Award for Fiction (Grades 9-12) (2008)", "South Carolina Book Award for Young Adult Book Award (2008)", "Grand Canyon Reader Award for Teen Book (2008)", "Maryland Black-Eyed Susan Book Award for High School (2008)", "Golden Sower Award for Young Adult (2009)", "Nevada Young Readers' Award for Young Adult Category  (2007)", "The Flume: New Hampshire Teen Reader's Choice Award (2007)", "Pennsylvania Young Readers' Choice Award for Young Adult (2009)", "Rhode Island Teen Book Award (2007)", "Evergreen Teen Book Award (2008)", "Michigan Library Association Thumbs Up! Award Nominee (2006)", "Teen Read Award Nominee for Best All-Time-Fave (2010)", "Deutscher Jugendliteraturpreis Nominee for Preis der Jugendjury (2007)", "Iowa High School Book Award (2008)", "Lincoln Award (2008)", "Literaturpreis der Jury der jungen Leser for Cover (2007)", "Prix Et-lisez-moi (2008)", "Missouri Gateway Readers Award (2008)"], "places": ["Forks, Washington", "Phoenix, Arizona", "Washington (the state)"], "character_names": ["Edward Cullen", "Jacob Black", "Laurent", "Renee", "Bella Swan", "Billy Black", "Esme Cullen", "Alice Cullen", "Jasper Hale", "Carlisle Cullen", "Emmett Cullen", "Rosalie Hale", "Charlie Swan", "Mike Newton", "Jessica Stanley", "Angela Weber", "Tyler Crowley"], "language": "English", "ISBN": "0316015849", "description": ["In the first book of the Twilight Saga, internationally bestselling author Stephenie Meyer introduces Bella Swan and Edward Cullen, a pair of star-crossed lovers whose forbidden relationship ripens against the backdrop of small-town suspicion and a mysterious coven of vampires. This is a love story with bite."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/210404.A_Sand_County_Almanac_and_Sketches_Here_and_There", "image": ["https://images.gr-assets.com/books/1283195046l/210404.jpg"], "avg_ratings": ["\n  4.25\n"], "num_reviews": ["\n  ", "\n  21,236\n  ratings\n"], "genres": ["Nonfiction", "Environment", "Nature", "Science", "Environment", "Philosophy", "Classics"], "title": "A Sand County Almanac and Sketches Here and There", "author": "Aldo Leopold", "num_pages": "269", "awards": ["John Burroughs Medal (1977)", "National Outdoor Book Award for Classic (2000)"], "places": [], "character_names": [], "language": "English", "ISBN": "0195007778", "description": ["First published in 1949, ", " combines some of the finest nature writing since Thoreau with an outspoken and highly ethical regard for America's relationship to the land.", "Written with an unparalleled understanding of the ways of nature, the book includes a section on the monthly changes of the Wisconsin countryside; another part that gathers informal pieces written by Leopold over a forty-year period as he traveled through the woodlands of Wisconsin, Iowa, Arizona, Sonora, Oregon, Manitoba, and elsewhere; and a final section in which Leopold addresses the philosophical issues involved in wildlife conservation. As the forerunner of such important books as Annie Dillard's ", ", Edward Abbey's ", ", and Robert Finch's ", ", this classic work remains as relevant today as it was sixty-five years ago."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/122574.Getting_Stoned_with_Savages", "image": ["https://images.gr-assets.com/books/1320524119l/122574.jpg"], "avg_ratings": ["\n  3.86\n"], "num_reviews": ["\n  ", "\n  11,568\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Humor", "Autobiography", "Memoir"], "title": "Getting Stoned with Savages: A Trip Through the Islands of Fiji and Vanuatu", "author": "J. Maarten Troost", "num_pages": "239", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0767921992", "description": ["With ", ", Maarten Troost established himself as one of the most engaging and original travel writers around. ", " again reveals his wry wit and infectious joy of discovery in a side-splittingly funny account of life in the farthest reaches of the world. After two grueling years on the island of Tarawa, battling feral dogs, machete-wielding neighbors, and a lack of beer on a daily basis, Maarten Troost was in no hurry to return to the South Pacific. But as time went on, he realized he felt remarkably out of place among the trappings of twenty-first-century America. When he found himself holding down a job—one that might possibly lead to a career—he knew it was time for him and his wife, Sylvia, to repack their bags and set off for parts unknown.", " tells the hilarious story of Troost’s time on Vanuatu—a rugged cluster of islands where the natives gorge themselves on kava and are still known to “eat the man.” Falling into one amusing misadventure after another, Troost struggles against typhoons, earthquakes, and giant centipedes and soon finds himself swept up in the laid-back, clothing-optional lifestyle of the islanders. When Sylvia gets pregnant, they decamp for slightly-more-civilized Fiji, a fallen paradise where the local chiefs can be found watching rugby in the house next door. And as they contend with new parenthood in a country rife with prostitutes and government coups, their son begins to take quite naturally to island living—in complete contrast to his dad."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/3526793-marco-polo-didn-t-go-there", "image": ["https://images.gr-assets.com/books/1328690684l/3526793.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  476\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Language", "Writing", "Writing", "Essays", "Autobiography", "Memoir", "Writing", "Journalism"], "title": "Marco Polo Didn't Go There: Stories and Revelations from One Decade as a Postmodern Travel Writer: 0 (Travelers' Tales Guides)", "author": "Rolf Potts", "num_pages": "321", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1932361618", "description": [" is a collection of rollicking travel tales from a young writer ", " has called “Jack Kerouac for the Internet Age.” For the past ten years, Rolf Potts has taken his keen postmodern travel sensibility into the far fringes of five continents for such prestigious publications as ", " and ", ". This book documents his boldest, funniest, and most revealing journeys—from getting stranded without water in the Libyan desert, to crashing the set of a Leonardo DiCaprio movie in Thailand, to learning the secrets of Tantric sex in a dubious Indian ashram.", " is more than just an entertaining journey into fascinating corners of the world. The book is a unique window into travel writing, with each chapter containing a “commentary track”—endnotes that reveal the ragged edges behind the experience and creation of each tale. Offbeat and insightful, this book is an engrossing read for students of travel writing as well as armchair wanderers."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/4338.Dispatches_from_the_Edge", "image": ["https://images.gr-assets.com/books/1442613572l/4338.jpg"], "avg_ratings": ["\n  3.96\n"], "num_reviews": ["\n  ", "\n  7,834\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Biography", "Writing", "Journalism", "Biography", "Autobiography"], "title": "Dispatches from the Edge: A Memoir of War, Disasters, and Survival", "author": "Anderson Cooper", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0061132381", "description": [" In 2005, two tragedies--the Asian tsunami and Hurricane Katrina--turned CNN reporter Anderson Cooper into a media celebrity. ", ", Cooper's memoir of \"war, disasters and survival,\" is a brief but powerful chronicle of Cooper's ascent to stardom and his struggle with his own tragedies and demons. Cooper was 10 years old when his father, Wyatt Cooper, died during heart bypass surgery. He was 20 when his beloved older brother, Carter, committed suicide by jumping off his mother's penthouse balcony (his mother, by the way, being Gloria Vanderbilt). The losses profoundly affected Cooper, who fled home after college to work as a freelance journalist for Channel One, the classroom news service. Covering tragedies in far-flung places like Burma, Vietnam, and Somalia, Cooper quickly learned that \"as a journalist, no matter ... how respectful you are, part of your brain remains focused on how to capture the horror you see, how to package it, present it to others.\" Cooper's description of these horrors, from war-ravaged Baghdad to famine-wracked Niger, is poignant but surprisingly unsentimental. In Niger, Cooper writes, he is chagrined, then resigned, when he catches himself looking for the \"worst cases\" to commit to film. \"They die, I live. It's the way of the world,\" he writes. In the final section of ", ", Cooper describes covering Hurricane Katrina, the story that made him famous. The transcript of his showdown with Louisiana Sen. Mary Landrieu (in which Cooper tells Landrieu people in New Orleans are \"ashamed of what is happening in this country right now\") is worth the price of admission on its own. Cooper's memoir leaves some questions unanswered--there's frustratingly little about his personal life, for example--but remains a vivid, modest self-portrait by a man who is proving himself to be an admirable, courageous leader in a medium that could use more like him. --"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/4370.Catfish_and_Mandala", "image": ["https://images.gr-assets.com/books/1442923690l/4370.jpg"], "avg_ratings": ["\n  3.95\n"], "num_reviews": ["\n  ", "\n  4,762\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Cultural", "Asia"], "title": "Catfish and Mandala: A Two-Wheeled Voyage Through the Landscape and Memory of Vietnam", "author": "Andrew X. Pham", "num_pages": "344", "awards": ["Guardian First Book Award Nominee (2000)", "Oregon Book Award Nominee for Nonfiction (Finalist) (2000)", "Kiriyama Prize for Nonfiction (1999)"], "places": ["San Jose, California", "San Francisco, California", "Tokyo", "Phan Thiet", "Saigon", "Vung Tau", "Jakarta", "Rach Gia", "Mui Ne", "Hanoi", "Ninh Binh", "Hue", "Hoi An", "Qui Nhan", "Nha Trang"], "character_names": [], "language": "English", "ISBN": "0312267177", "description": [" is the story of an American odyssey—a solo bicycle voyage around the Pacific Rim to Vietnam—made by a young Vietnamese-American man in pursuit of both his adopted homeland and his forsaken fatherland. ", "Andrew X. Pham was born in Vietnam and raised in California. His father had been a POW of the Vietcong; his family came to America as \"boat people.\" Following the suicide of his sister, Pham quit his job, sold all of his possessions, and embarked on a year-long bicycle journey that took him through the Mexican desert, around a thousand-mile loop from Narita to Kyoto in Japan; and, after five months and 2,357 miles, to Saigon, where he finds \"nothing familiar in the bombed-out darkness.\" In Vietnam, he's taken for Japanese or Korean by his countrymen, except, of course, by his relatives, who doubt that as a Vietnamese he has the stamina to complete his journey (\"Only Westerners can do it\"); and in the United States he's considered anything but American. A vibrant, picaresque memoir written with narrative flair and an eye-opening sense of adventure, ", " is an unforgettable search for cultural identity."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/6135044-chasing-dreams", "image": ["https://images.gr-assets.com/books/1347520633l/6135044.jpg"], "avg_ratings": ["\n  3.22\n"], "num_reviews": ["\n  ", "\n  32\n  ratings\n"], "genres": ["Travel", "Fiction"], "title": "Chasing Dreams", "author": "Aaron Jennings", "num_pages": "176", "awards": [], "places": ["Thailand", "Australia"], "character_names": [], "language": "English", "ISBN": "1849231354", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1392687.The_Backpacker", "image": ["https://images.gr-assets.com/books/1183234971l/1392687.jpg"], "avg_ratings": ["\n  3.62\n"], "num_reviews": ["\n  ", "\n  740\n  ratings\n"], "genres": ["Travel", "Fiction", "Cultural", "Asia"], "title": "The Backpacker", "author": "John                   Harris", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "1840241616", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/22748948-railonama", "image": ["https://images.gr-assets.com/books/1405883706l/22748948.jpg"], "avg_ratings": ["\n  4.20\n"], "num_reviews": ["\n  ", "\n  76\n  ratings\n"], "genres": ["Cultural", "India", "Travel", "Nonfiction", "Short Stories", "Humor", "Funny"], "title": "Railonama", "author": "Anupama Sharma", "num_pages": "240", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "9380619790", "description": ["Interested in funny, heart-warming, and inspiring real life travel stories? You will love reading Railonama. ", "Railonama is a compilation of short stories and poems inspired by travel via the Indian Railways. The book features enriching and highly entertaining stories selected from a pool of submissions from people all around the world who have traveled in trains in India. This book will make for an engaging and riveting read for those who enjoy traveling and exploring.", "The book contains stories from authors: Ajay Mankotia, Ambika Jindal, Anindita Deo, Anupama Sharma, Asiem Sanyal, Atul Sharma, Bala Parthasarathy, Chandrashekhr B. Kulkarni, Diane Caldwell, Dilshad Sanyal, Dr K.C. Jindal, ", ", Elayne Clift, Francois Juneau, Frank Joussen, ", ", K.H.D. Karr, Ken Haigh, Kshitij Bisen, Lalita Bhatia, Malini Mathi Vathanan, Mary McCormack, Michael Clifton, Monali Ghatge, Nikhil Narayanan, Pat Hale, Pradeep Chaswal, Raminder Rayar, ", ", Rohit Khanduri, Savita Mudgal, Shailender Arya, Sharada Balasubramanian, Sheela Jaywant, Sheila Kumar, Sijeesh V Balakrishnan, Snigdha Khurana, Sukanya Mohan, Sumedha Sengupta, Susmita Bhattacharya, Tessy Koshy, Varsha Halabe,", ", Yogesh B Sharma."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/626550.The_Man_Who_Walked_Through_Time", "image": ["https://images.gr-assets.com/books/1320511637l/626550.jpg"], "avg_ratings": ["\n  4.01\n"], "num_reviews": ["\n  ", "\n  1,935\n  ratings\n"], "genres": ["Nonfiction", "Travel", "Environment", "Nature", "Adventure", "Biography"], "title": "The Man Who Walked Through Time", "author": "Colin Fletcher", "num_pages": "239", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0394718526", "description": ["Colin Fletcher is a self-described \"compulsive walker.\" It is not unusual for him to pick up a map, drive to an area that intrigues him, and then start walking. It should come as no surprise then that a detour from U.S. 66 to visit the Grand Canyon on a June morning in 1963 inspired Fletcher to walk the length of the Canyon below the rim. In ", " Fletcher recounts his amazing journey. For two months Fletcher struggled against heat and cold, lack of water and dwindling supplies. The terrain was, at times, nearly impassible, yet despite the physical hardships, Fletcher came away from his experience with a new awareness of how humans fit into the vast scheme of things. He writes, for example, of meeting a rattlesnake on Beaver Sand Bar: \"Now I am no rattlesnake ", ". The first rattler I met scared me purple, and killing it seemed a human duty.... Yet by the end of that California summer I no longer felt an unreasoning fear of rattlers.... Instead, I accepted them as organisms with a niche in the web of life. Accepted them, that is, as fellow creatures.\""]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/122781.A_Walk_Across_America", "image": ["https://images.gr-assets.com/books/1442192805l/122781.jpg"], "avg_ratings": ["\n  4.03\n"], "num_reviews": ["\n  ", "\n  10,072\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Adventure", "Biography"], "title": "A Walk Across America", "author": "Peter Jenkins", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "006095955X", "description": ["Twenty-five years ago, a disillusioned young man set out on a walk across America. This is the book he wrote about that journey -- a classic account of the reawakening of his faith in himself and his country.", "\"I started out searching for myself and my country,\" Peter Jenkins writes, \"and found both.\" In this timeless classic, Jenkins describes how disillusionment with society in the 1970s drove him out onto the road on a walk across America. His experiences remain as sharp and telling today as they were twenty-five years ago -- from the timeless secrets of life, learned from a mountain-dwelling hermit, to the stir he caused by staying with a black family in North Carolina, to his hours of intense labor in Southern mills. Many, many miles later, he learned lessons about his country and himself that resonate to this day -- and will inspire a new generation to get out, hit the road and explore."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1175991.Smile_When_You_re_Lying", "image": ["https://images.gr-assets.com/books/1317066134l/1175991.jpg"], "avg_ratings": ["\n  3.49\n"], "num_reviews": ["\n  ", "\n  2,033\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Writing", "Essays", "Humor", "Adventure"], "title": "Smile When You're Lying: Confessions of a Rogue Travel Writer", "author": "Chuck Thompson", "num_pages": "324", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0805082093", "description": ["Travel writer, editor, and photographer Chuck Thompson has spent more than a decade traipsing through thirty-five (and counting) countries across the globe, and he's had enough. Enough of the half-truths demanded by magazine editors, enough of the endlessly recycled clichés regarded as good travel writing, and enough of the ugly secrets fiercely guarded by the travel industry. But mostly, he's had enough of returning home from assignments and leaving the most interesting stories and the most provocative insights on the editing-room floor. From getting swindled in Thailand to running afoul of customs inspectors in Belarus, from defusing hostile Swedish rockers backstage in Germany to a closed-door meeting with travel execs telling him why he's about to be fired once again, Thompson's no-holds-barred style is refreshing, invigorating, and all those other adjectives travel writers use to describe spa vacations where the main attraction is a daily colonic.", " takes readers on an irresistible series of adventures in Europe, Asia, the Caribbean, Latin America, and beyond; details the effects of globalization on the casual traveler and ponders the future of travel as we know it; and offers up a treasure trove of travel-industry secrets collected throughout a decidedly speckled career."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/13638968-undying", "image": ["https://images.gr-assets.com/books/1343012352l/13638968.jpg"], "avg_ratings": ["\n  4.09\n"], "num_reviews": ["\n  ", "\n  45\n  ratings\n"], "genres": ["Magical Realism", "Fantasy"], "title": "Undying", "author": "Bernadette Azizi", "num_pages": "244", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["Breaking all the rules of life, love and death.", "Prepare yourself to be engulfed in two worlds.", "One within Catherine’s dreams, the other the life she is living. Catherine will be left to navigate her way through an eerie sequence of events that threaten her both emotionally and physically in pursuit of the mystery that surrounds her love for James.", "Can she figure it out before it’s too late?", "Or will history repeat itself…"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/15721800-the-devil-s-road-to-kathmandu", "image": ["https://images.gr-assets.com/books/1340892904l/15721800.jpg"], "avg_ratings": ["\n  3.48\n"], "num_reviews": ["\n  ", "\n  44\n  ratings\n"], "genres": ["Travel", "Suspense"], "title": "The Devil's Road To Kathmandu", "author": "Tom Vater", "num_pages": "277", "awards": [], "places": ["Nepal"], "character_names": [], "language": "English", "description": ["A brand new edition of The Devil's Road to Kathmandu from Crime Wave Press (", "), initially for all Kindle devices. ", "‘The Devil’s Road To Kathmandu’ by Tom Vater is a tense, fast paced and kaleidoscopic pulp thriller, following the lives of two generations of drifters who become embroiled in a saga of sex, drugs and murder on the road between London and the Indian subcontinent.", "In 1976, four friends, Dan, Fred, Tim and Thierry, drive a bus along the hippie trail from London to Kathmandu. En Route in Pakistan, a drug deal goes badly wrong, yet the boys escape with their lives and the narcotics. Thousands of kilometers, numerous acid trips, accidents, nightclubs and a pair of beautiful Siamese twins later, as they finally reach the counter-culture capital of the world, Kathmandu, Fred disappears with the drug money.", "A quarter century later, after receiving mysterious emails inviting them to pick up their share of the money, Dan, Tim and Thierry are back in Kathmandu. The Nepalese capital is not the blissful mountain backwater they remember. Soon a trail of kidnapping and murder leads across the Roof of the World. With the help of Dan’s backpacking son, a tattooed lady and a Buddhist angel, the ageing hippies try to solve a 25-year old mystery that leads them amongst Himalayan peaks for a dramatic showdown with their past."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/79909.In_Patagonia", "image": ["https://images.gr-assets.com/books/1386924798l/79909.jpg"], "avg_ratings": ["\n  3.73\n"], "num_reviews": ["\n  ", "\n  10,818\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Adventure", "History"], "title": "In Patagonia", "author": "Bruce Chatwin", "num_pages": "199", "awards": ["Hawthornden Prize (1977)"], "places": ["Patagonia"], "character_names": [], "language": "English", "ISBN": "0142437190", "description": ["An exhilarating look at a place that still retains the exotic mystery of a far-off, unseen land, Bruce Chatwin’s exquisite account of his journey through Patagonia teems with evocative descriptions, remarkable bits of history, and unforgettable anecdotes. Fueled by an unmistakable lust for life and adventure and a singular gift for storytelling, Chatwin treks through “the uttermost part of the earth”— that stretch of land at the southern tip of South America, where bandits were once made welcome—in search of almost forgotten legends, the descendants of Welsh immigrants, and the log cabin built by Butch Cassidy. An instant classic upon publication in 1977, In Patagonia is a masterpiece that has cast a long shadow upon the literary world."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/11077.The_Sex_Lives_of_Cannibals", "image": ["https://images.gr-assets.com/books/1386924418l/11077.jpg"], "avg_ratings": ["\n  3.87\n"], "num_reviews": ["\n  ", "\n  19,398\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Humor", "Autobiography", "Memoir"], "title": "The Sex Lives of Cannibals: Adrift in the Equatorial Pacific", "author": "J. Maarten Troost", "num_pages": "272", "awards": [], "places": ["Kiribati"], "character_names": [], "language": "English", "ISBN": "0767915305", "description": ["At the age of twenty-six, Maarten Troost who had been pushing the snooze button on the alarm clock of life by racking up useless graduate degrees and muddling through a series of temp jobs decided to pack up his flip-flops and move to Tarawa, a remote South Pacific island in the Republic of Kiribati. He was restless and lacked direction, and the idea of dropping everything and moving to the ends of the Earth was irresistibly romantic. He should have known better. ", " tells the hilarious story of what happens when Troost discovers that Tarawa is not the island paradise he dreamed of. Falling into one amusing misadventure after another, Troost struggles through relentless, stifling heat, a variety of deadly bacteria, polluted seas, toxic fish, and worst of all, no television or coffee. And that's just the first day. Sunburned, emaciated, and stinging with sea lice, Troost spends the next two years battling incompetent government officials, alarmingly large critters, erratic electricity, and a paucity of food options. He contends with a cast of bizarre local characters, including \"Half-Dead Fred\" and the self-proclaimed Poet Laureate of Tarawa (a British drunkard who's never written a poem in his life), and eventually settles into the ebb and flow of island life, just before his return to the culture shock of civilization. With the rollicking wit of Bill Bryson, the brilliant travel exposition of Paul Theroux, and a hipster edge that is entirely Troost's own, ", " is the ultimate vicarious adventure. Readers may never long to set foot on Tarawa, but they'll want to travel with Troost time and time again."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/4373.First_They_Killed_My_Father", "image": ["https://images.gr-assets.com/books/1407105580l/4373.jpg"], "avg_ratings": ["\n  4.33\n"], "num_reviews": ["\n  ", "\n  25,794\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "History", "Biography", "Cultural", "Asia"], "title": "First They Killed My Father: A Daughter of Cambodia Remembers", "author": "Loung Ung", "num_pages": "238", "awards": ["Rhode Island Teen Book Award Nominee (2002)"], "places": ["Cambodia"], "character_names": [], "language": "English", "ISBN": "0060856262", "description": ["One of seven children of a high-ranking government official, Loung Ung lived a privileged life in the Cambodian capital of Phnom Penh until the age of five. Then, in April 1975, Pol Pot's Khmer Rouge army stormed into the city, forcing Ung's family to flee and, eventually, to disperse. Loung was trained as a child soldier in a work camp for orphans, her siblings were sent to labor camps, and those who survived the horrors would not be reunited until the Khmer Rouge was destroyed.", "Harrowing yet hopeful, Loung's powerful story is an unforgettable account of a family shaken and shattered, yet miraculously sustained by courage and love in the face of unspeakable brutality."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/43081.Marching_Powder", "image": ["https://images.gr-assets.com/books/1388245700l/43081.jpg"], "avg_ratings": ["\n  4.24\n"], "num_reviews": ["\n  ", "\n  15,588\n  ratings\n"], "genres": ["Nonfiction", "Travel", "Biography", "Mystery", "Crime", "Autobiography", "Memoir"], "title": "Marching Powder: A True Story of Friendship, Cocaine, and South America's Strangest Jail", "author": "Rusty Young", "num_pages": "400", "awards": [], "places": ["Bolivia"], "character_names": [], "language": "English", "ISBN": "0312330340", "description": ["Rusty Young was backpacking in South America when he heard about Thomas McFadden, a convicted English drug trafficker who ran tours inside Bolivia's notorious San Pedro prison. Intrigued, the young Australian journalisted went to La Paz and joined one of Thomas's illegal tours. They formed an instant friendship and then became partners in an attempt to record Thomas's experiences in the jail. Rusty bribed the guards to allow him to stay and for the next three months he lived inside the prison, sharing a cell with Thomas and recording one of the strangest and most compelling prison stories of all time. The result is ", ".", "This book establishes that San Pedro is not your average prison. Inmates are expected to buy their cells from real estate agents. Others run shops and restaurants. Women and children live with imprisoned family members. It is a place where corrupt politicians and drug lords live in luxury apartments, while the poorest prisoners are subjected to squalor and deprivation. Violence is a constant threat, and sections of San Pedro that echo with the sound of children by day house some of Bolivia's busiest cocaine laboratories by night. In San Pedro, cocaine--\"Bolivian marching powder\"--makes life bearable. Even the prison cat is addicted.", "Yet ", " is also the tale of friendship, a place where horror is countered by humor and cruelty and compassion can inhabit the same cell. This is cutting-edge travel-writing and a fascinating account of infiltration into the South American drug culture."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/12279098-the-god-complex", "image": ["https://images.gr-assets.com/books/1327139102l/12279098.jpg"], "avg_ratings": ["\n  3.48\n"], "num_reviews": ["\n  ", "\n  225\n  ratings\n"], "genres": ["Thriller", "Fiction", "Mystery", "Thriller", "Mystery Thriller", "Religion", "Medical", "Contemporary"], "title": "The God Complex", "author": "Chris Titus", "num_pages": "278", "awards": [], "places": ["Prague (Praha)", "Boston, Massachusetts", "Santorini"], "character_names": [], "language": "English", "ISBN": "1453717021", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/270032.Seven_Years_in_Tibet", "image": ["https://images.gr-assets.com/books/1388251499l/270032.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  15,201\n  ratings\n"], "genres": ["Travel", "Nonfiction", "History", "Biography", "Adventure", "Autobiography", "Memoir"], "title": "Seven Years in Tibet", "author": "Heinrich Harrer", "num_pages": "330", "awards": [], "places": ["Tibet"], "character_names": [], "language": "English", "ISBN": "0874778883", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/371033.Backpack", "image": ["https://images.gr-assets.com/books/1434896961l/371033.jpg"], "avg_ratings": ["\n  3.50\n"], "num_reviews": ["\n  ", "\n  1,446\n  ratings\n"], "genres": ["Fiction", "Travel", "Womens Fiction", "Chick Lit", "Cultural", "Asia"], "title": "Backpack", "author": "Emily Barr", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0452282934", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/24506419-the-dust", "image": ["https://images.gr-assets.com/books/1421300501l/24506419.jpg"], "avg_ratings": ["\n  4.07\n"], "num_reviews": ["\n  ", "\n  43\n  ratings\n"], "genres": ["Horror", "Horror", "Zombies", "Fiction", "European Literature", "Irish Literature"], "title": "The Dust: The zombie apocalypse in Ireland", "author": "Jonathan Lynch", "num_pages": "235", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["All over Ireland people begin to drop dead around a young mechanic named Eric Ward. At first Eric believes it to be just a lethal virus, but all that changes when the dead start to come back to life and the giant man-eating-rats appear with a voracious appetite for human flesh. Eric's pregnant girlfriend and ailing grandmother need to be brought to hospital to be inoculated and protected from the virus. But getting there will be nearly impossible as the streets are now overrun by the giant vermin and psychotic creatures that were once his neighbours and friends. Eric finds himself in a battle to stay alive long enough to save his loved ones. ", "The Dust is the second novel by award winning author Jonathan Lynch"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/11470922-the-shadows-of-shigatse", "image": ["https://images.gr-assets.com/books/1350984982l/11470922.jpg"], "avg_ratings": ["\n  3.82\n"], "num_reviews": ["\n  ", "\n  17\n  ratings\n"], "genres": ["Cultural", "China", "Mystery"], "title": "The Shadows of Shigatse", "author": "D.L. Kung", "num_pages": "250", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["This is Part III of the Handover Mysteries in which American journalist Claire Raymond is caught in the undertow of China's emergence to regional dominance at the turn of the 20th century.", " Vol I The Wardens of Punyu: ", "\tClaire Raymond's naive new Business World colleague disappears without trace across the Hong Kong-China border on assignment in one of the mainland's \"special economic zones.\" Claire's futile search to rescue him leads her through the free-for-all landscape of Guangdong's coastal export boom into the murky use of Communist prison labor camps to feed its illegal organ transplant trade. Only more years to go before Beijing reclaims control of the British colony and already China's transition to power reveals its dark, lawless side. And Claire's career may be reaching a crossroad now that she has met the dashing Swiss UN delegate on assignment from Geneva to set up operations based in Hong Kong. ", "Vol II The End of May Road (previously published as Left in the Care Of: Claire finds herself uncomfortably sidelined at home on maternity leave. A neighbor's son, Petey, is found dead along the Midlevels district’s May Road during Christmas week only six months before the official handover of Hong Kong from Britain to China. A neurotic uncertainty pervades the colonial middle-class and mixes with a mounting religious hysteria among the mistreated Filipina housekeepers who slave for Chinese and western households. ", "Claire fears for the safety of her own newborn, Caspar. The visit to Hong Kong of Xavier's ex-lover Fabienne adds to her tensions as she investigates Petey's suspicious death.", "Vol III The Shadows of Shigatse:", "China now has the upper hand and in the wake of 9/11, even enjoys an anti-terrorist alliance with the U.S. Swiss UN worker Xavier Vonalp takes his wife, the journalist Claire Raymond to Tibet on his quest to locate an informer in his medical training project betraying Tibetans fleeing to Nepal. Pinpointing which of four suspects might be the deadly turncoat is hard enough, but on the eve of their departure from Hong Kong, Claire's ex-lover Jim returns from the ether to beg a sensitive and secret favor. ", "\tJim's father ran Khampa agents in a secret CIA campaign against the Communist army incursion during the 50's and 60's. His plane crashed in the Himalayas but no body was ever found at the site. Against her better judgment, Claire pursues this mystery behind Xavier's back while in Lhasa. Before she knows it, she's smuggling a fugitive Tibetan freedom fighter to safety from Jim's deadly \"discipline,\" and at the same time fighting to help Xavier, trapped by the informer on espionage charges, escape a ten-year sentence in Chinese prison. In a moving culmination to The Handover trilogy, Claire locates Jim's father—a symbolic finale to the end of American influence for and against the now-confident Beijing regime."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/764165.The_Snow_Leopard", "image": ["https://images.gr-assets.com/books/1309211772l/764165.jpg"], "avg_ratings": ["\n  4.12\n"], "num_reviews": ["\n  ", "\n  11,045\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Environment", "Nature", "Autobiography", "Memoir", "Adventure", "Philosophy"], "title": "The Snow Leopard", "author": "Peter Matthiessen", "num_pages": "352", "awards": ["National Book Award for Contemporary Thought (1979) & General Nonfiction (Paperback) (1980)", "National Book Critics Circle Award Nominee for General Nonfiction (1978)"], "places": ["Nepal"], "character_names": [], "language": "English", "ISBN": "0140255087", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/613890.Long_Way_Round", "image": ["https://images.gr-assets.com/books/1388350896l/613890.jpg"], "avg_ratings": ["\n  3.94\n"], "num_reviews": ["\n  ", "\n  8,792\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Adventure", "Autobiography", "Memoir", "Biography"], "title": "Long Way Round: Chasing Shadows Across the World", "author": "Ewan McGregor", "num_pages": "320", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0743499336", "description": ["It started as a daydream. Poring over a map of the world at home one quiet Saturday afternoon, Ewan McGregor - actor and self-confessed bike nut - noticed that it was possible to ride all the way round the world, with just one short hop across the Bering Strait from Russia to Alaska. It was a revelation he couldn't get out of his head. So he picked up the phone and called Charley Boorman, his best friend, fellow actor and bike enthusiast. 'Charley, ' he said. 'I think you ought to come over for dinner...'From London to New York, Ewan and Charley chased their shadows through Europe, the Ukraine, Kazakhstan, Mongolia and Russia, across the Pacific to Alaska, then down through Canada and America. But as the miles slipped beneath the tyres of their big BMWs, their troubles started. Exhaustion, injury and accidents tested their strength. Treacherous roads, unpredictable weather and turbulent politics challenged their stamina. They were chased by paparazzi in Kazakhstan, courted by men with very large guns in the Ukraine, hassled by the police, and given bulls' testicles for supper by Mongolian nomads.", "And yet despite all these obstacles they managed to ride over 20,000 miles in four months, changing their lives forever in the process. As they travelled they documented their trip, taking photographs, and writing diaries by the campfire. \"Long Way Round\" is the result of their adventures - a fascinating, frank and highly entertaining travel book about two friends riding round the world together and, against all the odds, realising their dream."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/18864.The_Rum_Diary", "image": ["https://images.gr-assets.com/books/1430534762l/18864.jpg"], "avg_ratings": ["\n  3.83\n"], "num_reviews": ["\n  ", "\n  47,141\n  ratings\n"], "genres": ["Fiction", "Classics", "Novels", "Literature"], "title": "The Rum Diary", "author": "Hunter S. Thompson", "num_pages": "224", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0684856476", "description": ["Made into a major motion picture starring Johnny Depp,", "—a national bestseller and ", "Notable Book—is Hunter S. Thompson’s brilliant love story of jealousy, treachery, and violent lust in the Caribbean.", "Begun in 1959 by a twenty-two-year-old Hunter S. Thompson,", " is a brilliantly tangled love story of jealousy, treachery, and violent alcoholic lust in the Caribbean boomtown that was San Juan, Puerto Rico, in the late 1950s. The narrator, freelance journalist Paul Kemp, irresistibly drawn to a sexy, mysterious woman, is soon thrust into a world where corruption and get-rich-quick schemes rule and anything (including murder) is permissible. Exuberant and mad, youthful and energetic, this dazzling comedic romp provides a fictional excursion as riveting and outrageous as Thompson’s Fear and Loathing books."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/24640125-the-world-at-large", "image": ["https://images.gr-assets.com/books/1421933497l/24640125.jpg"], "avg_ratings": ["\n  4.13\n"], "num_reviews": ["\n  ", "\n  90\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Travel", "Travelogue"], "title": "The World At Large (Carpe Diem, book 1)", "author": "Adam E. Mehaffey", "awards": [], "places": [], "character_names": [], "language": "English", "description": ["The following is an account of my journeys throughout the world. What started off as a couple of months to get away for an adventure turned into a ten-year journey of learning, enlightenment, hard times, and moments that will never leave me, including times of joy, sorrow, love, pain, near-death experiences, and experiences nearly worth dying for. During that time, I travelled to over 60 countries, set foot on every continent, including Antarctica; worked in over half a dozen countries; and saw relics from ancient civilisations and technological marvels of the modern world. I saw the highest peak on earth, the lowest valley, and so much in between. I visited places where they had never seen a white man before and countries ruled by governances ranging from democracies to theocracies to military regimes. I saw the cruelty that humanity can have for each other as well as the love that can bind us all. I fell in love, had my heart broken a few times, and broke a few hearts of my own. ~Carpe Diem"]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/23316.Round_Ireland_with_a_Fridge", "image": ["https://images.gr-assets.com/books/1438308095l/23316.jpg"], "avg_ratings": ["\n  3.79\n"], "num_reviews": ["\n  ", "\n  15,427\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Humor", "Cultural", "Ireland", "Autobiography", "Memoir"], "title": "Round Ireland with a Fridge", "author": "Tony Hawks", "num_pages": "248", "awards": [], "places": ["Ireland"], "character_names": [], "language": "English", "ISBN": "0312274920", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/470016.Are_You_Experienced_", "image": ["https://images.gr-assets.com/books/1387712811l/470016.jpg"], "avg_ratings": ["\n  3.57\n"], "num_reviews": ["\n  ", "\n  3,247\n  ratings\n"], "genres": ["Fiction", "Travel", "Cultural", "India", "Humor", "Cultural", "Asia", "Novels"], "title": "Are You Experienced?", "author": "William Sutcliffe", "num_pages": "256", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0140283587", "description": ["Liz travels to India because she wants to find herself. Dave travels to India because he wants to get Liz into bed.", "Liz loves India, hugs the beggars, and is well on her way to finding her tantric center. Dave, however, realizes he hates Liz, and has bad karma toward his fellow travelers: Jeremy, whose spiritual journey is aided by checks from Dad; Jonah, who hasn’t worn shoes for a decade; and Fee and Caz, fresh from leper-washing in Udaipur…", "With refreshing honesty and a healthy dose of cynicism, William Sutcliffe offers a transatlantic, nineties version of ", " that all readers will enjoy."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/85622.Tales_of_a_Female_Nomad", "image": ["https://images.gr-assets.com/books/1320531284l/85622.jpg"], "avg_ratings": ["\n  3.85\n"], "num_reviews": ["\n  ", "\n  13,058\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Autobiography", "Memoir", "Biography"], "title": "Tales of a Female Nomad: Living at Large in the World", "author": "Rita Golden Gelman", "num_pages": "312", "awards": [], "places": ["Mexico", "Guatemala", "Nicaragua", "Israel", "Galápagos Islands", "Indonesia", "Canada", "New Zealand", "Thailand"], "character_names": [], "language": "English", "ISBN": "0609809547", "description": ["” —From the Preface", " is the story of Rita Golden Gelman, an ordinary woman who is living an extraordinary existence. At the age of forty-eight, on the verge of a divorce, Rita left an elegant life in L.A. to follow her dream of connecting with people in cultures all over the world. In 1986 she sold her possessions and became a nomad, living in a Zapotec village in Mexico, sleeping with sea lions on the Galapagos Islands, and residing everywhere from thatched huts to regal palaces. She has observed orangutans in the rain forest of Borneo, visited trance healers and dens of black magic, and cooked with women on fires all over the world. Rita’s example encourages us all to dust off our dreams and rediscover the joy, the exuberance, and the hidden spirit that so many of us bury when we become adults."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/9807262-wanderlove", "image": ["https://images.gr-assets.com/books/1327877152l/9807262.jpg"], "avg_ratings": ["\n  3.91\n"], "num_reviews": ["\n  ", "\n  8,507\n  ratings\n"], "genres": ["Young Adult", "Contemporary", "Romance", "Travel", "Realistic Fiction"], "title": "Wanderlove", "author": "Kirsten Hubbard", "num_pages": "338", "awards": [], "places": ["Washokey, Wyoming", "Belize", "Guatemala"], "character_names": ["Grace Carpenter, Mandarin Ramey, Taffeta Carpenter, Adrina Carpenter"], "language": "English", "ISBN": "0385739370", "description": ["It all begins with a stupid question:", "No, but 18-year-old Bria Sandoval wants to be. In a quest for independence, her neglected art, and no-strings-attached hookups, she signs up for a guided tour of Central America—the wrong one. Middle-aged tourists with fanny packs are hardly the key to self-rediscovery. When Bria meets Rowan, devoted backpacker and dive instructor, and his outspokenly humanitarian sister Starling, she seizes the chance to ditch her group and join them off the beaten path.", "Bria's a good girl trying to go bad. Rowan's a bad boy trying to stay good. As they travel across a panorama of Mayan villages, remote Belizean islands, and hostels plagued with jungle beasties, they discover what they've got in common: both seek to leave behind the old versions of themselves. And the secret to escaping the past, Rowan’s found, is to keep moving forward.", "But Bria comes to realize she can't run forever, no matter what Rowan says. If she ever wants the courage to fall for someone worthwhile, she has to start looking back.", "Kirsten Hubbard lends her artistry to this ultimate backpacker novel, weaving her drawings into the text. Her career as a travel writer and her experiences as a real-life vagabond backpacking Central America are deeply seeded in this inspiring story."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/17355356-stumbling-thru", "image": ["https://images.gr-assets.com/books/1360890238l/17355356.jpg"], "avg_ratings": ["\n  4.05\n"], "num_reviews": ["\n  ", "\n  407\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Environment", "Nature", "Nature", "Outdoors"], "title": "Stumbling Thru: Hike Your Own Hike", "author": "A. Digger Stolz", "num_pages": "278", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0615763583", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/2187.Middlesex", "image": ["https://images.gr-assets.com/books/1437029776l/2187.jpg"], "avg_ratings": ["\n  3.99\n"], "num_reviews": ["\n  ", "\n  543,502\n  ratings\n"], "genres": ["Fiction", "Historical", "Historical Fiction", "Contemporary"], "title": "Middlesex", "author": "Jeffrey Eugenides", "num_pages": "529", "awards": ["Pulitzer Prize for Fiction (2003)", "James Tait Black Memorial Prize Nominee for Fiction (2003)", "Ambassador Book Award for Fiction (2003)", "Audie Award for Fiction, Unabridged (2003)"], "places": ["Bursa", "Izmir", "Detroit, Michigan", "Berlin"], "character_names": ["Calliope Stephanides", "Eleutherios Stephanides", "Desdemona Stephanides", "Sourmelina Zizmo", "Miltiades Stephanides", "Theodora Stephanides", "Chapter Eleven", "The Obscure Object", "James Zizmo", "Michael Antoniou"], "language": "English", "ISBN": "0312422156", "description": [" tells the breathtaking story of Calliope Stephanides, and three generations of the Greek-American Stephanides family, who travel from a tiny village overlooking Mount Olympus in Asia Minor to Prohibition-era Detroit, witnessing its glory days as the Motor City and the race riots of 1967 before moving out to the tree-lined streets of suburban Grosse Pointe, Michigan. To understand why Calliope is not like other girls, she has to uncover a guilty family secret, and the astonishing genetic history that turns Callie into Cal, one of the most audacious and wondrous narrators in contemporary fiction. Lyrical and thrilling, ", " is an exhilarating reinvention of the American epic."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/9992246-eating-smoke", "image": ["https://images.gr-assets.com/books/1329579969l/9992246.jpg"], "avg_ratings": ["\n  3.62\n"], "num_reviews": ["\n  ", "\n  549\n  ratings\n"], "genres": ["Nonfiction", "Mystery", "Crime", "Autobiography", "Memoir", "Cultural", "China", "Mental Health", "Mental Illness"], "title": "Eating Smoke: One Man's Descent Into Crystal Meth Psychosis in Hong Kong's Triad Heartland", "author": "Chris Thrall", "num_pages": "420", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "9881900298", "description": ["Chris Thrall left the Royal Marines to find fortune in Hong Kong, but following a bizarre series of jobs ended up homeless and in psychosis from crystal meth.", "He began working for the 14K, a notorious crime syndicate, as a nightclub doorman in the Wan Chai red-light district, where he uncovered a vast global conspiracy and the 'Foreign Triad' - a secretive expat clique in cahoots with the Chinese gangs.", "Alone and confused in the neon glare of Hong Kong's seedy backstreets, Chris was forced to survive in the world's most unforgiving city, hooked on the world's most dangerous drug.", "Engaging, honest and full of Chris's irrepressible humour, this remarkable memoir combines gripping storytelling with brooding menace as the Triads begin to cast their shadow over him. The result is a truly psychotic urban nightmare ..."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/23492.The_Dharma_Bums", "image": ["https://images.gr-assets.com/books/1413788799l/23492.jpg"], "avg_ratings": ["\n  3.94\n"], "num_reviews": ["\n  ", "\n  72,733\n  ratings\n"], "genres": ["Fiction", "Classics", "Literature", "Novels"], "title": "The Dharma Bums", "author": "Jack Kerouac", "num_pages": "187", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0143039601", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/865.The_Alchemist", "image": ["https://images.gr-assets.com/books/1483412266l/865.jpg"], "avg_ratings": ["\n  3.85\n"], "num_reviews": ["\n  ", "\n  1,688,753\n  ratings\n"], "genres": ["Fiction", "Classics", "Fantasy", "Philosophy"], "title": "The Alchemist", "author": "Paulo Coelho", "num_pages": "197", "awards": ["NBDB National Book Award Nominee for Translation (2015)", "Grand Prix des lectrices de Elle for roman (1995)", "Premio Grinzane Cavour for Narrativa Straniera (1996)", "Corine Internationaler Buchpreis for Belletristik (2002)"], "places": ["Egypt", "Sahara Desert", "Tangier", "Andalusia"], "character_names": ["Santiago", "Alchemist"], "language": "English", "ISBN": "0061122416", "description": ["Paulo Coelho's masterpiece tells the mystical story of Santiago, an Andalusian shepherd boy who yearns to travel in search of a worldly treasure. His quest will lead him to riches far different—and far more satisfying—than he ever imagined. Santiago's journey teaches us about the essential wisdom of listening to our hearts, of recognizing opportunity and learning to read the omens strewn along life's path, and, most importantly, to follow our dreams."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/100247.Vagabonding", "image": ["https://images.gr-assets.com/books/1320532720l/100247.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  17,210\n  ratings\n"], "genres": ["Travel", "Nonfiction", "Adventure", "Philosophy", "Self Help"], "title": "Vagabonding: An Uncommon Guide to the Art of Long-Term World Travel", "author": "Rolf Potts", "num_pages": "205", "awards": [], "places": [], "character_names": [], "language": "English", "ISBN": "0812992180", "description": [" is about taking time off from your normal life - from six weeks to four months to two years - to discover and experience the world on your own terms. Veteran shoestring traveler Rolf Potts shows how anyone armed with an independent spirit can achieve the dream of extended overseas travel. Potts gives the necessary information on:", "- financing your travel time ", "- determining your destination ", "- adjusting to life on the road", "- working and volunteering overseas ", "- handling travel adversity ", "- re-assimilating back into ordinary life", "Not just a plan of action, vagabonding is an outlook on life that emphasizes creativity, discovery, and the growth of the spirit. Visit the vagabonding community's hub at ", "."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/4214.Life_of_Pi", "image": ["https://images.gr-assets.com/books/1320562005l/4214.jpg"], "avg_ratings": ["\n  3.89\n"], "num_reviews": ["\n  ", "\n  1,168,600\n  ratings\n"], "genres": ["Fiction", "Fantasy", "Classics", "Adventure"], "title": "Life of Pi", "author": "Yann Martel", "num_pages": "460", "awards": ["Man Booker Prize (2002)", "Bollinger Everyman Wodehouse Prize Nominee for Comic Fiction (2003)", "Exclusive Books Boeke Prize (2003)", "Governor General's Literary Awards / Prix littéraires du Gouverneur général Nominee for Fiction (2001)", "Lincoln Award Nominee (2005)", "Deutscher Bücherpreis for Belletristik (2004)", "CBC Canada Reads Nominee (2003)", "Luisterboek Award Nominee (2015)", "QWF (Quebec Writer's Federation) Awards for Paragraphe Hugh MacLennan Prize for Fiction (2001)", "Asian/Pacific American Award for Literature for Adult Fiction (2003)"], "places": ["Pacific Ocean", "Pondicherry", "Toronto, Ontario", "Tomatlan"], "character_names": ["Pi Patel", "Richard Parker"], "language": "English", "ISBN": "0770430074", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/33600.Shantaram", "image": ["https://images.gr-assets.com/books/1333482282l/33600.jpg"], "avg_ratings": ["\n  4.27\n"], "num_reviews": ["\n  ", "\n  132,963\n  ratings\n"], "genres": ["Fiction", "Cultural", "India", "Travel", "Adventure"], "title": "Shantaram", "author": "Gregory David Roberts", "num_pages": "936", "awards": ["Commonwealth Writers' Prize Nominee for Best First Book (the Pacific Region) (2004)"], "places": ["Bombay", "Afghanistan", "Australia"], "character_names": ["Lin Ford", "Karla Saraanen", "Lisa", "Prabaker", "Abdel Khader Khan", "Abdullah Taheri", "Nazeer", "Didier"], "language": "English", "ISBN": "192076920X", "description": ["\"It took me a long time and most of the world to learn what I know about love and fate and the choices we make, but the heart of it came to me in an instant, while I was chained to a wall and being tortured.\"", "So begins this epic, mesmerizing first novel set in the underworld of contemporary Bombay. Shantaram is narrated by Lin, an escaped convict with a false passport who flees maximum security prison in Australia for the teeming streets of a city where he can disappear.", "Accompanied by his guide and faithful friend, Prabaker, the two enter Bombay's hidden society of beggars and gangsters, prostitutes and holy men, soldiers and actors, and Indians and exiles from other countries, who seek in this remarkable place what they cannot find elsewhere.", "As a hunted man without a home, family, or identity, Lin searches for love and meaning while running a clinic in one of the city's poorest slums, and serving his apprenticeship in the dark arts of the Bombay mafia. The search leads him to war, prison torture, murder, and a series of enigmatic and bloody betrayals. The keys to unlock the mysteries and intrigues that bind Lin are held by two people. The first is Khader Khan: mafia godfather, criminal-philosopher-saint, and mentor to Lin in the underworld of the Golden City. The second is Karla: elusive, dangerous, and beautiful, whose passions are driven by secrets that torment her and yet give her a terrible power.", "Burning slums and five-star hotels, romantic love and prison agonies, criminal wars and Bollywood films, spiritual gurus and mujaheddin guerrillas – this huge novel has the world of human experience in its reach, and a passionate love for India at its heart. Based on the life of the author, it is by any measure the debut of an extraordinary voice in literature."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/13.The_Ultimate_Hitchhiker_s_Guide_to_the_Galaxy", "image": ["https://images.gr-assets.com/books/1404613595l/13.jpg"], "avg_ratings": ["\n  4.38\n"], "num_reviews": ["\n  ", "\n  254,929\n  ratings\n"], "genres": ["Science Fiction", "Fiction", "Humor", "Fantasy", "Classics"], "title": "The Ultimate Hitchhiker's Guide to the Galaxy", "author": "Douglas Adams", "num_pages": "815", "awards": [], "places": [], "character_names": ["Zaphod Beeblebrox", "Arthur Dent", "Ford Prefect", "Trillian", "Marvin, the paranoid android"], "language": "English", "ISBN": "0345453743", "description": ["At last in paperback in one complete volume, here are the five novels from Douglas Adams's Hitchhiker series. ", "\"The Hitchhiker's Guide to the Galaxy\"", "Seconds before the Earth is demolished for a galactic freeway, Arthur Dent is saved by Ford Prefect, a researcher for the revised Guide. Together they stick out their thumbs to the stars and begin a wild journey through time and space.", "\"The Restaurant at the End of the Universe\"", "Facing annihilation at the hands of warmongers is a curious time to crave tea. It could only happen to the cosmically displaced Arthur Dent and his comrades as they hurtle across the galaxy in a desperate search for a place to eat.", "\"Life, the Universe and Everything\"", "The unhappy inhabitants of planet Krikkit are sick of looking at the night sky- so they plan to destroy it. The universe, that is. Now only five individuals can avert Armageddon: mild-mannered Arthur Dent and his stalwart crew.", "\"So Long, and Thanks for All the Fish\"", "Back on Earth, Arthur Dent is ready to believe that the past eight years were all just a figment of his stressed-out imagination. But a gift-wrapped fishbowl with a cryptic inscription conspires to thrust him back to reality. So to speak.", "\"Mostly Harmless\"", "Just when Arthur Dent makes the terrible mistake of starting to enjoy life, all hell breaks loose. Can he save the Earth from total obliteration? Can he save the Guide from a hostile alien takeover? Can he save his daughter from herself?", "Also includes the short story \"Young Zaphod Plays It Safe\"."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/607639.The_Beach", "image": ["https://images.gr-assets.com/books/1348547768l/607639.jpg"], "avg_ratings": ["\n  3.93\n"], "num_reviews": ["\n  ", "\n  63,214\n  ratings\n"], "genres": ["Fiction", "Travel", "Thriller", "Adventure", "Contemporary"], "title": "The Beach", "author": "Alex Garland", "num_pages": "436", "awards": ["Betty Trask Award (1997)"], "places": ["Thailand"], "character_names": [], "language": "English", "ISBN": "1573226521", "description": []},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/3766.On_the_Road", "image": ["https://images.gr-assets.com/books/1388193090l/3766.jpg"], "avg_ratings": ["\n  3.63\n"], "num_reviews": ["\n  ", "\n  304,665\n  ratings\n"], "genres": ["Classics", "Fiction", "Travel", "Literature"], "title": "On the Road", "author": "Jack Kerouac", "num_pages": "293", "awards": ["Grammy Award Nominee for Best Spoken Word Album (2001)"], "places": [], "character_names": [], "language": "English", "ISBN": "0140283293", "description": ["In its time Jack Kerouac's masterpiece was the bible of the Beat Generation, the essential prose accompaniment to Allen Ginsberg's ", ". While it stunned the public and literary establishment when it was published in 1957, it is now recognized as an American classic. With ", ", Kerouac discovered his voice and his true subject—the search for a place as an outsider in America.", " swings to the rhythms of fifties underground America, jazz, sex, generosity, chill dawns, and drugs, with Sal Paradise and his hero Dean Moriarty, traveler and mystic, the living epitome of Beat."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/1898.Into_Thin_Air", "image": ["https://images.gr-assets.com/books/1463384482l/1898.jpg"], "avg_ratings": ["\n  4.14\n"], "num_reviews": ["\n  ", "\n  333,433\n  ratings\n"], "genres": ["Nonfiction", "Adventure", "Autobiography", "Memoir", "Travel", "Biography", "History"], "title": "Into Thin Air: A Personal Account of the Mount Everest Disaster", "author": "Jon Krakauer", "num_pages": "368", "awards": ["Pulitzer Prize Nominee for General Nonfiction (1998)", "ALA Alex Award (1998)", "National Book Critics Circle Award Nominee for General Nonfiction (1997)", "Boardman Tasker Prize Nominee for Mountain Literature (1997)"], "places": ["Nepal", "Mount Everest"], "character_names": ["Rob Hall", "Jon Krakauer"], "language": "English", "ISBN": "0385494785", "description": ["A bank of clouds was assembling on the not-so-distant horizon, but journalist-mountaineer Jon Krakauer, standing on the summit of Mt. Everest, saw nothing that \"suggested that a murderous storm was bearing down.\" He was wrong. The storm, which claimed five lives and left countless more--including Krakauer's--in guilt-ridden disarray, would also provide the impetus for ", ", Krakauer's epic account of the May 1996 disaster."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/19501.Eat_Pray_Love", "image": ["https://images.gr-assets.com/books/1503066414l/19501.jpg"], "avg_ratings": ["\n  3.53\n"], "num_reviews": ["\n  ", "\n  1,320,480\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Travel"], "title": "Eat, Pray, Love", "author": "Elizabeth Gilbert", "num_pages": "334", "awards": ["Puddly Award for Nonfiction (2008)"], "places": ["Italy", "India", "Bali"], "character_names": [], "language": "English", "ISBN": "0143038419", "description": ["A celebrated writer's irresistible, candid, and eloquent account of her pursuit of worldly pleasure, spiritual devotion, and what she really wanted out of life. ", "Around the time Elizabeth Gilbert turned thirty, she went through an early-onslaught midlife crisis. She had everything an educated, ambitious American woman was supposed to want—a husband, a house, a successful career. But instead of feeling happy and fulfilled, she was consumed with panic, grief, and confusion. She went through a divorce, a crushing depression, another failed love, and the eradication of everything she ever thought she was supposed to be. ", "To recover from all this, Gilbert took a radical step. In order to give herself the time and space to find out who she really was and what she really wanted, she got rid of her belongings, quit her job, and undertook a yearlong journey around the world—all alone. Eat, Pray, Love is the absorbing chronicle of that year. Her aim was to visit three places where she could examine one aspect of her own nature set against the backdrop of a culture that has traditionally done that one thing very well. In Rome, she studied the art of pleasure, learning to speak Italian and gaining the twenty-three happiest pounds of her life. India was for the art of devotion, and with the help of a native guru and a surprisingly wise cowboy from Texas, she embarked on four uninterrupted months of spiritual exploration. In Bali, she studied the art of balance between worldly enjoyment and divine transcendence. She became the pupil of an elderly medicine man and also fell in love the best way—unexpectedly. ", "An intensely articulate and moving memoir of self-discovery, Eat, Pray, Love is about what can happen when you claim responsibility for your own contentment and stop trying to live in imitation of society’s ideals. It is certain to touch anyone who has ever woken up to the unrelenting need for change."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/12262741-wild", "image": ["https://images.gr-assets.com/books/1453189881l/12262741.jpg"], "avg_ratings": ["\n  3.98\n"], "num_reviews": ["\n  ", "\n  506,794\n  ratings\n"], "genres": ["Nonfiction", "Autobiography", "Memoir", "Travel", "Biography"], "title": "Wild: From Lost to Found on the Pacific Crest Trail", "author": "Cheryl Strayed", "num_pages": "315", "awards": ["Oregon Book Award Nominee for Creative Nonfiction (Finalist) (2013)", "Indies Choice Book Award for Adult Nonfiction (2013)", "Puddly Award for Nonfiction (2013)", "Goodreads Choice Award for Memoir & Autobiography (2012)"], "places": ["Oregon"], "character_names": ["Cheryl Strayed"], "language": "English", "ISBN": "0307592731", "description": ["An alternate cover for this ISBN can be found ", ".", "At twenty-two, Cheryl Strayed thought she had lost everything. In the wake of her mother’s death, her family scattered and her own marriage was soon destroyed. Four years later, with nothing more to lose, she made the most impulsive decision of her life. With no experience or training, driven only by blind will, she would hike more than a thousand miles of the Pacific Crest Trail from the Mojave Desert through California and Oregon to Washington State — and she would do it alone.", "Told with suspense and style, sparkling with warmth and humor, ", " powerfully captures the terrors and pleasures of one young woman forging ahead against all odds on a journey that maddened, strengthened, and ultimately healed her."]},
{"list": "Backpacking", "url": "https://www.goodreads.com/book/show/9791.A_Walk_in_the_Woods", "image": ["https://images.gr-assets.com/books/1388189974l/9791.jpg"], "avg_ratings": ["\n  4.05\n"], "num_reviews": ["\n  ", "\n  303,147\n  ratings\n"], "genres": ["Nonfiction", "Travel", "Humor", "Autobiography", "Memoir", "Environment", "Nature", "Adventure"], "title": "A Walk in the Woods: Rediscovering America on the Appalachian Trail", "author": "Bill Bryson", "num_pages": "397", "awards": [], "places": ["United States of America"], "character_names": ["Bill Bryson"], "language": "English", "ISBN": "0307279464", "description": ["The Appalachian Trail stretches from Georgia to Maine and covers some of the most breathtaking terrain in America–majestic mountains, silent forests, sparking lakes. If you’re going to take a hike, it’s probably the place to go. And Bill Bryson is surely the most entertaining guide you’ll find. He introduces us to the history and ecology of the trail and to some of the other hardy (or just foolhardy) folks he meets along the way–and a couple of bears. Already a classic, ", " will make you long for the great outdoors (or at least a comfortable chair to sit and read in)."]}
]